clasp/.emacs.d/etc/init.org
#+TITLE: init
#+STARTUP: indent
#+OPTIONS: author:nil

* dependencies
** Package Manager Setup
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
    ;; set initial boot settings
  (package-initialize)
  (require 'gnutls)
  (require 'package)

  (progn

    (add-to-list 'package-archives
                 '("melpa" . "https://melpa.org/packages/") t)


    (add-to-list 'package-archives
                 '("melpa-stable" . "https://stable.melpa.org/packages/") t)

  
    (when (< emacs-major-version 24)
      ;; For important compatibility libraries like cl-lib
      (add-to-list 'package-archives '("gnu" . "https://elpa.gnu.org/packages/"))))


#+END_SRC

#+RESULTS:

** use-package Configuration
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (require 'package)
  (setq package-enable-at-startup nil)
  ;; (add-to-list 'package-archives '("melpa" . "http://melpa.org/packages/"))
  ;; (add-to-list 'package-archives '("marmalade" . "http://marmalade-repo.org/packages/"))
  ;; (add-to-list 'package-archives '("gnu" . "http://elpa.gnu.org/packages/"))
  ;; (package-initialize)

  (unless (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package))

  (eval-when-compile
    (require 'use-package))
  ;; (require 'diminish)
  ;; (require 'bind-key)
#+END_SRC
*** async
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (use-package async
    :ensure t)
#+END_SRC

*** cl
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (use-package cl
    :ensure t)
#+END_SRC

*** company
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package company
:ensure t
)
#+END_SRC

*** autocomplete
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
   (use-package auto-complete
   :ensure t
   :init
   (require 'auto-complete)
       (define-key ac-complete-mode-map "\C-n" 'ac-next)
       (define-key ac-complete-mode-map "\C-p" 'ac-previous))
#+END_SRC
*** dash
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package dash
:ensure t
)
#+END_SRC

*** f
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package f
:ensure t
)
#+END_SRC

*** s
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package s
:ensure t)
#+END_SRC

*** ht
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package ht
:ensure t)
#+END_SRC

*** exec-path-from-shell
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package exec-path-from-shell
:ensure t
)
#+END_SRC
*** helm
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package helm
:ensure t
)
#+END_SRC

**** helm-projectile
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package helm-projectile
:ensure t
)
#+END_SRC

*** hydra
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package hydra
:ensure t
)
#+END_SRC

*** jabber
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package jabber
:ensure t
)
#+END_SRC

*** magit
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package magit
:ensure t
)
#+END_SRC
**** magit-todos
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package magit-org-todos
:ensure t 
:config
  (magit-org-todos-autoinsert))
#+END_SRC
