clasp/.emacs.d/init.el
;; set initial boot settings
(package-initialize)
(require 'gnutls)
(require 'package)

(progn

  (add-to-list 'package-archives
               '("melpa" . "https://melpa.org/packages/") t)


  (add-to-list 'package-archives
               '("melpa-stable" . "https://stable.melpa.org/packages/") t)


  (when (< emacs-major-version 24)
    ;; For important compatibility libraries like cl-lib
    (add-to-list 'package-archives '("gnu" . "https://elpa.gnu.org/packages/"))))

(require 'package)
(setq package-enable-at-startup nil)
;; (add-to-list 'package-archives '("melpa" . "http://melpa.org/packages/"))
;; (add-to-list 'package-archives '("marmalade" . "http://marmalade-repo.org/packages/"))
;; (add-to-list 'package-archives '("gnu" . "http://elpa.gnu.org/packages/"))
;; (package-initialize)

(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))

(eval-when-compile
  (require 'use-package))
;; (require 'diminish)
;; (require 'bind-key)

(use-package async
  :ensure t)

(use-package cl
  :ensure t)

(use-package company
:ensure t
)

(use-package auto-complete
:ensure t
:init
(require 'auto-complete)
    (define-key ac-complete-mode-map "\C-n" 'ac-next)
    (define-key ac-complete-mode-map "\C-p" 'ac-previous))

(use-package dash
:ensure t
)

(use-package f
:ensure t
)

(use-package s
:ensure t)

(use-package ht
:ensure t)

(use-package exec-path-from-shell
:ensure t
)

(use-package helm
:ensure t
)

(use-package helm-projectile
:ensure t
)

(use-package hydra
:ensure t
)

(use-package jabber
:ensure t
)

(use-package magit
:ensure t
)

(use-package magit-org-todos
:ensure t 
:config
  (magit-org-todos-autoinsert))
