clasp/.emacs.d/init.el

(use-package multi-term
  :ensure t
  :init

  (add-hook 'sh-mode-hook (lambda ()
                            (define-key sh-mode-map (kbd "M-,") 'pop-tag-mark)))


  (add-hook 'term-mode-hook (lambda ()
                              (progn
                                (defun expose-global-binding-in-term (binding)
                                  (define-key term-raw-map binding
                                    (lookup-key (current-global-map) binding)))
                                (expose-global-binding-in-term (kbd "C-o")))))



  (defun vxe-mt-named-shell ()
    (interactive)
    (let ((input (completing-read "current:" (buffer-list))))
      (v-persp/split-terminal input)

      (rename-buffer (concat "$" input))))

  (defun vxe-mt-shell-split-static (shell-name)
    "open named shell and put into perspective"
    (interactive "si hereby christen this shell: ")
    (if (and (one-window-p t)
             (not (active-minibuffer-window)))
        (split-window-vertically))
                                        ;     (other-window 1)
    (vxe-shell shell-name))


  (defun vxe-term-shell-split-static (shell-name)
    "open named shell and put into perspective"
    (interactive "si hereby christen this shell: ")
    (if (and (one-window-p t)
             (not (active-minibuffer-window)))
        (split-window-vertically))
                                        ;     (other-window 1)
    (vxe-shell shell-name))


                                        ;(persp-add-buffer shell-name))

  (defun vxe-shell (name)
    (interactive)
    (if (or (eq system-type 'cygwin)
            (eq system-type 'gnu/linux)
            (eq system-type 'linux)
            (eq system-type 'darwin))

        (new-ansi name)  (new-ansi-powershell name)))

  (defun vxe-shell-term (name)
    (interactive)
    (if (or (eq system-type 'cygwin)
            (eq system-type 'gnu/linux)
            (eq system-type 'linux)
            (eq system-type 'darwin))

        (new-term name)  (new-ansi-powershell name)))


  (defun new-ansi (shell-name)
    "create a named ansi term"
    (interactive "si hereby christen this shell: ")
                                        ;   (other-window 1)
    (multi-term)
    (rename-buffer (format "%s" shell-name)))


  (defun new-term (shell-name)
    "create a named ansi term"
    (interactive "si hereby christen this shell: ")
                                        ;   (other-window 1)
    (term)
    (rename-buffer (format "%s" shell-name)))
  ;; end refactor




  (defun vxe-mt-generic-ssh ()
    (interactive)
    (cond ((eq system-type 'darwin)
           (let ((input (completing-read "server:" (split-string
                                                    (s-chomp (shell-command-to-string "~/bin/get-hostnames-from-dns ~/opt/dns"))
                                                    "\n"))))
             (defun vxe/generate-ssh-mac (host)
               (interactive "s where")
               (fset 'generic-ssh
                     (lambda (&optional arg) "Keyboard macro." (interactive "p") (kmacro-exec-ring-item `(,(concat "ssh " host) 0 "%d") arg)))
               (generic-ssh))
             (vxe-mt-shell-split-static input)
             (rename-buffer (concat "$a" input))
             (vxe/generate-ssh-mac input)))
          ((eq system-type 'gnu/linux)
           (let ((input (completing-read "server:" (split-string
                                                    (s-chomp (shell-command-to-string "cat ~/.emacs.d/var/hosts")
                                        ;(s-chomp "~/.emacs.d/bin/get-hostnames-from-dns ~/.emacs.d/src/dns")
                                                             "\n"))))

                 (defun vxe/generate-ssh-linux (host)
                   (interactive "s where")
                   (fset 'generic-ssh
                         (lambda (&optional arg) "Keyboard macro." (interactive "p") (kmacro-exec-ring-item `(,(concat "ssh " host) 0 "%d") arg)))
                   (generic-ssh))
                 (vxe-mt-shell-split-static input)
                 (rename-buffer (concat "$" input))
                 (vxe/generate-ssh-linux input))))))

  (defun vxe-term-generic-ssh ()
    (interactive)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    (cond ((eq system-type 'darwin)
           (let ((input
                  (if (region-active-p)
                      (buffer-substring (region-beginning) (region-end))
                    (completing-read "server:" sre:hosts)
                    )))

             (defun vxe/generate-ssh-mac (host)
               (interactive "s where")
               (fset 'generic-ssh
                     (lambda (&optional arg) "Keyboard macro." (interactive "p") (kmacro-exec-ring-item `(,(concat "ssh " host) 0 "%d") arg)))
               (generic-ssh))


             (vxe-mt-shell-split-static input)
             (rename-buffer (concat "$" input))
             (vxe/generate-ssh-mac input)))
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
          ((eq system-type 'gnu/linux)
           (let ((input (completing-read "server:" (split-string
                                                    (s-chomp "~/bin/get-hostnames-from-dns ~/opt/dns")
                                                    "\n"))))
             (defun vxe/generate-ssh-linux (host)
               (interactive "s where")
               (fset 'generic-ssh
                     (lambda (&optional arg) "Keyboard macro." (interactive "p") (kmacro-exec-ring-item `(,(concat "ssh " host) 0 "%d") arg)))
               (generic-ssh))

             (vxe-mt-shell-split-static input)
             (rename-buffer (concat "$" input))
             (vxe/generate-ssh-linux input)))))


  (defun vxe:shell-other-window ()
    (interactive)
    (other-window 1)
    (vxe-term-generic-ssh))



                                        ; date functions
  (defun vxe-date-generator (format)
    (interactive "sFormat String: ")
    (message (s-chomp (concat "date " format))))
                                        ; clush

  (defun vxe-mt-toggle-term-mode ()
    (interactive)
    (term-mode)
    (term-mode)
    (term-char-mode))

  (defun vxe-mt-shell-here ()
    (interactive)
    (multi-term)))





  (defun vxe-eww-inplace ()
    (interactive)
    (shell-command "touch ~/.emacs.d/.eww-history")
    (let ((url (completing-read "url: " (split-string (s-chomp "cat ~/.emacs.d/.eww-history") "\n"))))
      (shell-command (concat "echo " url " >> ~/.emacs.d/.eww-history"))
      (eww url)
      (sleep-for 3)
      (switch-to-buffer "*eww*")
      (rename-buffer (concat "*eww*-" url))))

  (require 'shell)
  (define-key shell-mode-map (kbd "C-c C-r") nil)
  (define-key shell-mode-map (kbd "C-x C-x") 'helm-M-x)

(use-package cc-mode
  :ensure t
  :init
  (require 'cc-mode)
  (define-key java-mode-map (kbd "C-k") 'sp-kill-hybrid-sexp)
  (add-hook 'java-mode-hook #'smartparens-mode)

  (define-key c-mode-map (kbd "C-k") 'sp-kill-hybrid-sexp)
  (add-hook 'c-mode-hook #'smartparens-mode)

  (define-key c++-mode-map (kbd "C-k") 'sp-kill-hybrid-sexp)
  (add-hook 'c++-mode-hook #'smartparens-mode))

(use-package ag
:ensure t)
