clasp/.emacs.d/init.el

(use-package ace-window
  :ensure t
  :init)
(setq aw-keys '(?e ?f ?p ?n ?q ?a ?d ?s ))

(defun aw-keys-8-windows ()
  (interactive)
  (setq aw-keys '(?q ?a ?d ?s ?e ?f ?p ?n )))

(defun aw-keys-4-windows ()
  (interactive)
  (setq aw-keys '(?e ?f ?p ?n ?q ?a ?d ?s )))

(use-package magit
  :ensure t)

(use-package emacsql
:ensure t
:init)

(use-package emacsql-sqlite
  :ensure t
  :init
(require 'emacsql-sqlite))

(cond ((not (file-exists-p "~/.emacs.d/emacs.db"))
       (defvar db (emacsql-sqlite "~/.emacs.d/emacs.db"))))

(use-package pdf-tools
    :ensure t
      :init
      ;;     (add-to-list 'auto-mode-alist '("\\.pdf\\'" . pdf-view-mode))

      (require 'pdf-tools)
      (add-to-list 'auto-mode-alist '("\\.pdf\\'" . pdf-view-mode))

      :config
      ;; (require 'org-pdfview)
  )

(require 'pdf-occur)
(define-key pdf-occur-buffer-mode-map (kbd "C-o") nil)

(use-package eredis
:ensure t 
)

(use-package es-mode
  :ensure t
  :init
  (autoload 'es-mode "es-mode.el"
    "Major mode for editing Elasticsearch queries" t)
  (add-to-list 'auto-mode-alist '("\\.es$" . es-mode)))

(use-package twittering-mode
:ensure t
:init
(setq twittering-use-master-password t)
)

(use-package sx
:ensure t
)

(defun vxe:sx-search ()
	 (interactive)
	 (let ((current-prefix-arg 4)) ;; emulate C-u
	 (call-interactively 'sx-search)))

(use-package elfeed
:ensure t
)

(use-package gnuplot
:ensure t
)

(use-package esup
:ensure t)

;;   (use-package darkburn-theme
  ;;     :ensure t)
  ;;   (use-package monokai-theme
  ;;     :ensure t)

    (use-package ir-black-theme
      :ensure t)

  ;;   (use-package color-theme-sanityinc-tomorrow
  ;;     :ensure t)
    (use-package zenburn-theme
      :ensure t)

  ;; (defun load-dark-theme ()
  ;; (interactive)
  ;;   (load-theme 'sanityinc-tomorrow-eighties t)

  ;;                                           ;(load-theme 'ir-black t)
  ;;                                           ;
  ;;                                           ;(load-theme 'darkburn t)
  ;;   (load-theme 'monokai t)
  ;;   (load-theme 'ir-black t)
  ;;   (load-theme 'zenburn t)			;
  ;;   (load-theme 'ir-black t)
  ;;   (load-theme 'darkburn t)
  ;;   (load-theme 'monokai t)
  ;;   (load-theme 'ir-black t)

  ;; )


;; (use-package org-beautify-theme
;;   :ensure t)


(defun atom-theme ()
  (interactive)
  (load-theme 'atom-dark-theme t)
  (load-theme 'org-beautify-theme t)
  (load-theme 'zenburn t)			;
  (load-theme 'ir-black t))


  ;; (use-package org-beautify-theme
  ;;           :ensure t)




                                            ;(load "~/.emacs.d/bin/erosiond-theme/erosiond-theme.el")
    (menu-bar-mode -1)
    (tool-bar-mode -1)
    (setq inhibit-splash-screen t)
    ;; (setq inhibit-splash-screen (find-file "~/.emacs.d/doc/init.org"))
    (setq-default cursor-type 'bar)

    (use-package beacon
      :ensure t)

(cond ((file-exists-p "~/.emacs.d/lib/work")
              (add-to-list 'load-path "~/.emacs.d/lib/work" t)
              (load-file "~/.emacs.d/lib/work/clush.el")
              (load-file "~/.emacs.d/lib/work/work.el")
              (load-file "~/.emacs.d/lib/work/sre.el")))

;; (setq tramp-ssh-controlmaster-options
      ;;       (concat
      ;;        "-o ControlPath=~/.ssh/sockets/%%r@%%h-%%p "
      ;;        "-o ControlMaster=auto -o ControlPersist=yes"))
(setq tramp-completion-reread-directory-timeout nil)
(setq temporary-file-directory "/tmp/")
(setq tramp-ssh-controlmaster-options "-o ControlPath='/tmp/ssh-ControlPath-%%r@%%h:%%p' -o ControlMaster=auto -o ControlPersist=5h")

(fset 'yes-or-no-p 'y-or-n-p)

                                        ; Mac OsX remap meta to commands
(setq mac-command-modifier 'meta)

;(setq mac-option-modifier nil)
                                        ; copy con select


                                        ; global flycheck
;(add-hook 'after-init-hook #'global-flycheck-mode)
                                    ; dired

(add-hook 'dired-mode-hook (lambda ()
                             (progn
			   (defun expose-global-binding-in-dired (binding)
                                 (define-key dired-mode-map binding
                                   (lookup-key (current-global-map) binding)))
			   (expose-global-binding-in-dired (kbd "C-o")))))

(defun vxe-copy-from-osx ()
  "http://stackoverflow.com/questions/9985316/how-to-paste-to-emacs-from-clipboard"
  (shell-command-to-string "pbpaste"))

(defun vxe-paste-to-osx (text &optional push)
  "http://stackoverflow.com/questions/9985316/how-to-paste-to-emacs-from-clipboard"
  (let ((process-connection-type nil))
    (let ((proc (start-process "pbcopy" "*Messages*" "pbcopy")))
      (process-send-string proc text)
      (process-send-eof proc))))


                                        ; make copy and paste work
(cond ((eq system-type 'darwin)
       (setq interprogram-cut-function 'vxe-paste-to-osx)
       (setq interprogram-paste-function 'vxe-copy-from-osx))
      ((eq system-type 'linux)
       (message "good os")))

(setq default-major-mode 'org-mode)

(cond ((eq system-type 'darwin)
       (setq browse-url-browser-function 'browse-url-generic
	 browse-url-generic-program "open"))
      ((eq system-type 'gnu/linux) (setq browse-url-browser-function 'eww-browse-url)))
; dired C-o
;; (defun expose-global-binding-in-dired (binding)
;;    (define-key dired-mode-map binding
;;      (lookup-key (current-global-map) binding)))

;; (progn
;;   (expose-global-binding-in-dired (kbd "C-o")))

(setq system-uses-terminfo nil)

(setq backup-directory-alist '(("." . "~/.emacs.d/backups")))

(setq desktop-save-mode t)

(setq-default indent-tabs-mode nil)

(add-hook 'emacs-lisp-mode-hook
            (lambda ()
              (push '(">=" . ?≥) prettify-symbols-alist)))

(defconst lisp--prettify-symbols-alist
  '(("lambda"  . ?λ)))

(global-prettify-symbols-mode +1)

(appt-activate)

(server-start)

(setq browse-url-browser-function 'browse-url-generic)

(setq custom-file "~/.emacs.d/.customized.el")
(load-file "~/.emacs.d/.customized.el")

(defun htk (key map)
(interactive)
  (ht-get map key))

(defun json-ht-read (str)
  (interactive)
  (let ((json-key-type 'keyword)
        (json-object-type 'hash-table))
    (json-read-from-string str)))

(defun vxe-shell-on-region ()
  (interactive)
  (let ((current-prefix-arg 4)) ;; emulate C-u
    (call-interactively 'shell-command-on-region)))
