clasp/.emacs.d/etc/init.org
** org-mode screenshot insert
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun my-org-screenshot ()
    " WARNING OSX ONLY: Take a screenshot into a time stamped unique-named file in the
  same directory as the org-buffer and insert a link to this file."
    (interactive)
    ;; (setq filename
    ;;       (concat
    ;;        (make-temp-name
    ;;         (concat (file-name-nondirectory (buffer-file-name))
    ;;                 "_"
    ;;                 (format-time-string "%Y%m%d_%H%M%S_")) ) ".png"))

    (shell-command "mkdir -p img")
    (setq filename (completing-read "filename:" (split-string
                         (s-chomp
                          (shell-command-to-string
                           "find -L ~/.emacs.d/wiki/img -maxdepth 1 -type f -print0 | xargs -0 basename"))
                         "\n")))
    (call-process "screencapture" nil nil nil "-i" (concat "./img/" filename ".png"))
    (insert (concat "[[./img/" filename ".png" "]]"))
    (org-display-inline-images))

  (setq mouse-drag-copy-region t)
#+END_SRC
** search github by genning a url query
this might be done better with engine mode: https://github.com/hrs/engine-mode
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(defun vxe:gen-github-search (name)
(interactive "sproject name: ")
(kill-new (concat "https://github.com/search?utf8=?&q=" name "&type="))
(vxe-eww-inplace)
)
#+END_SRC
** clear the value of a hook
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun clear-hook (hook)
    (interactive "Shook")
    (mapcar (lambda (feature)
              (remove-hook hook feature))
            (eval hook)))
#+END_SRC
** emulate vim's yy
check these hacks out, named macros are the bomb
#+BEGIN_QUOTE
one of the thing every sorcerer will tell you: if you have the name of the spirit you have the power over it


- hal and gerry
#+END_QUOTE
*** implementation
basically you macro from point to beginning of line, yank, then proceed back to end of line
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun yank-line ()
    (interactive)
    (push-mark)
    (fset 'yy-enhanced
     (lambda (&optional arg) "Keyboard macro." (interactive "p") (kmacro-exec-ring-item (quote ([5 67108896 1 134217847] 0 "%d")) arg)))
    (yy-enhanced)
    (pop-to-mark-command))


#+END_SRC
**** issues
1. one minor issue is that it goes to end of line for some reason even though we are pushing to mark at the
   beginning, likely the issues here is on of a not using a built-in function correctly
** auto-correct and typo database implementation
This is shamelessly stolen from [[http://endlessparentheses.com/ispell-and-abbrev-the-perfect-auto-correct.html][Endless Parenthesis]] essentially when a typo is spotted, ideally using flyspell
red line it will open ispell to prompt for a completion, then from that point on it will add a new abbrev to
expands that typo into is correct spelling :D
*** get the ispell corrections for the previous word
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(defun endless/simple-get-word ()
  (car-safe (save-excursion (ispell-get-word nil))))
#+END_SRC
*** generate the (local) abbrev
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(defun endless/ispell-word-then-abbrev (p)
  "Call `ispell-word', then create an abbrev for it.
With prefix P, create local abbrev. Otherwise it will
be global.
If there's nothing wrong with the word at point, keep
looking for a typo until the beginning of buffer. You can
skip typos you don't want to fix with `SPC', and you can
abort completely with `C-g'."
  (interactive "P")
  (let (bef aft)
    (save-excursion
      (while (if (setq bef (endless/simple-get-word))
                 ;; Word was corrected or used quit.
                 (if (ispell-word nil 'quiet)
                     nil ; End the loop.
                   ;; Also end if we reach `bob'.
                   (not (bobp)))
               ;; If there's no word at point, keep looking
               ;; until `bob'.
               (not (bobp)))
        (backward-word)
        (backward-char))
      (setq aft (endless/simple-get-word)))
    (if (and aft bef (not (equal aft bef)))
        (let ((aft (downcase aft))
              (bef (downcase bef)))
          (define-abbrev
            (if p local-abbrev-table global-abbrev-table)
            bef aft)
          (message "\"%s\" now expands to \"%s\" %sally"
                   bef aft (if p "loc" "glob")))
      (user-error "No typo at or before point"))))
#+END_SRC
*** save abbrevs without prompts
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(setq save-abbrevs 'silently)
#+END_SRC
*** enable global abbrev mode
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(setq-default abbrev-mode t)
#+END_SRC
** a basic wiki based on text files
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun vxe-wiki-search ()
    (interactive)
    (s-chomp (shell-command-to-string "mkdir -p ~/.emacs.d/wiki"))
    (defun vxe/generic-wiki (topic)
      (interactive "s ")
      ;; (if (and (one-window-p t)
      ;; 	     (not (active-minibuffer-window)))
      ;; 	(split-window-vertically))
      ;; (other-window 1)
      (cond ((string= topic "sc")
         (switch-to-buffer "*scratch*")
         (vxe-journal-mode))
        (t (find-file (concat "~/.emacs.d/wiki/" topic)))))

    (cond ((eq system-type 'windows-nt)
       (find-file (completing-read "book:"
                       (split-string (s-chomp
                              (concat "perl5.20.2.exe "
                                  emacs-root
                                  "Dropbox/.emacs.d/windows/get-wiki-list.pl"))"\n"))))
      ((eq system-type 'darwin)
       (let ((input (completing-read "topic:" (split-string
                                               (s-chomp
                                                (shell-command-to-string
                                                 "find -L ~/.emacs.d/wiki -maxdepth 1 -type f -print0 | xargs -0 basename | grep -Ev '^#|^[.]'"))
                        "\n"))))
         (vxe/generic-wiki input)))
      ((eq system-type 'gnu/linux)
       (let ((input (completing-read "topic:" (split-string
                           (s-chomp
                            "find -L ~/.emacs.d/wiki -maxdepth 1 -type f -printf '%f\n' | grep -Ev '^#|^[.]' ")
                           "\n"))))
         (vxe/generic-wiki input)))


      (t     (let ((input (completing-read "topic:" (split-string
                                 (s-chomp
                              "find -L ~/.emacs.d/wiki -maxdepth 1 -type f ! -name '*[#~]' ! -name '*html' ! -name '*git*' -printf '%f\n'")
                                 "\n"))))
           (vxe/generic-wiki input)))))
#+END_SRC
** save history for database sql shells
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(defun my-sql-save-history-hook ()
    (let ((lval 'sql-input-ring-file-name)
          (rval 'sql-product))
      (if (symbol-value rval)
          (let ((filename
                 (concat "~/.emacs.d/sql/"
                         (symbol-name (symbol-value rval))
                         "-history.sql")))
            (set (make-local-variable lval) filename))
        (error
         (format "SQL history will not be saved because %s is nil"
                 (symbol-name rval))))))

  (add-hook 'sql-interactive-mode-hook 'my-sql-save-history-hook)
#+END_SRC
** run one line async shell command with titled buffer
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun vxe:async-shell-command (command buffer-name)
    (interactive)
    (async-shell-command command buffer-name))
#+END_SRC
** predicate to check if a process is running
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun process-running-p (process)
    (if (string= ""
                 (shell-command-to-string
                  (concat "ps -eaf | grep " process)))
               t)
           nil)
#+END_SRC
** find process listening on port in osx
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun whats-listening-on-port-osx (port)
    (interactive "sport: ")
    (async-shell-command (concat "sudo lsof -PiTCP -sTCP:LISTEN | grep " port)))
#+END_SRC
** goto random page in pdf
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun pdf-goto-random-page (max-pages)
    (interactive "nnumber of pages:")
    (let ((random-page (random max-pages)))
      (pdf-view-goto-page random-page)))
#+END_SRC
** yank current buffer name
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(defun yank-buffer ()
(interactive)
(kill-new (current-buffer)))
#+END_SRC
** kill process by name
  #+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
    (defun pkill (process)
      (interactive "sprocess: ")
      (async-shell-command (concat "ps -eaf | grep " process " |  awk '{print $2}' | xargs kill -9")))
  #+END_SRC
** extract all regex matches from region
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(defun regex-extract (regex)
	 (interactive "sregex")
	 (kill-new (concat "perl -ne 'print \"$1\\n\" if /(" regex ")/'"))
	 (vxe-shell-on-region))
#+END_SRC
*** extract ip addresses no port
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(defun ip-extract-no-port ()
	 (interactive)
	 (kill-new (concat "perl -ne 'print \"$1\\n\" if /(\\d{1,3}\\.\\d{1,3}\\.\\d{1,3}\\.\\d{1,3})/'"))
	 (vxe-shell-on-region))
#+END_SRC
