clasp/.emacs.d/init.el

(defun ip-extract-with-port ()
	 (interactive)
	 (kill-new (concat "perl -ne 'print \"$1\\n\" if /(\\d{1,3}\\.\\d{1,3}\\.\\d{1,3}\\.\\d{1,3}\\:\\d{1,5})/'"))
	 (vxe-shell-on-region))

(defun apache:download-commons (package)
(interactive "sPackage: ")
(async-shell-command (concat "cd ~/.emacs.d/src; git clone git://git.apache.org/commons-" package ".git; cd ~/.emacs.d/src/commons-" package " && mvn package"))
)

; from enberg on #emacs
(setq compilation-finish-function
  (lambda (buf str)
    (if (null (string-match ".*exited abnormally.*" str))
        ;;no errors, make the compilation window go away in a few seconds
        (progn
          (run-at-time
           "2 sec" nil 'delete-windows-on
           (get-buffer-create "*compilation*"))
          (message "No Compilation Errors!")))))

(defun goto-random-line ()
  "Go to a random line in this buffer."
  ; good for electrobibliomancy.
  (interactive)
  (goto-line (1+ (random (buffer-line-count)))))

(defun buffer-line-count ()
  "Return the number of lines in this buffer."
  (count-lines (point-min) (point-max)))

(defun goto-random-quote ()
  (interactive)
  (goto-random-line)
  (search-forward "BEGIN_QUOTE"))

(defun vxe:occur (query)
	 (interactive "s/search term: ")
	 (occur query)
	 (other-window 1))

(defun dos2unix (buffer)
  "Automate M-% C-q C-m RET C-q C-j RET"
  (interactive "*b")
  (save-excursion
    (goto-char (point-min))
    (while (search-forward (string ?\C-m) nil t)
      (replace-match (string ?\C-j) nil t))))

(defun vxe:window-configuration-to-register ()
  (interactive)
  (let ((current-prefix-arg 4)) ;; emulate C-u
    (call-interactively 'window-configuration-to-register)))

(defun vxe:jump-to-register ()
  (interactive)
  (let ((current-prefix-arg 4)) ;; emulate C-u
    (call-interactively 'jump-to-register)))

(defun vxe:extract-ips ()
  (interactive)
  (kill-new (concat "perl -ne 'print " "\"" "$1\\n" "\"" " if /(\\d{1,3}\\.\\d{1,3}\\.\\d{1,3}\\.\\d{1,3}\\:\\d{1,5})/'"))
  (vxe-shell-on-region))

(defun vxe:url-decode (string)
  (interactive "s String:")
  (kill-new (shell-command-to-string
	     (concat "echo '" string  "' | perl -MURI::Escape -ne 'print uri_unescape(\$_);'"))))

(defun vxe:url-encode (string)
  (interactive "s String:")
  (kill-new (shell-command-to-string
	     (concat "echo '" string  "' | perl -MURI::Escape -ne 'print uri_escape(\$_);'"))))

(defun vxe-import-snippet-term-to-org ()
  (interactive)
   (let ((snippet (completing-read "snippet: " (split-string
					   (s-chomp
						"find -L ~/.emacs.d/snippets/term-mode -maxdepth 1 -type f -print0 | xargs -0 basename")
					   "\n"))))
  (s-chomp (concat "cp ~/.emacs.d/snippets/term-mode/" snippet " ~/.emacs.d/snippets/org-mode/" snippet))))

(defun vxe-import-snippet-org-to-term ()
  (interactive)
   (let ((snippet (completing-read "snippet: " (split-string
					   (s-chomp
						"find -L ~/.emacs.d/snippets/org-mode -maxdepth 1 -type f -print0 | xargs -0 basename")
					   "\n"))))
  (s-chomp (concat "cp ~/.emacs.d/snippets/org-mode/" snippet " ~/.emacs.d/snippets/term-mode/" snippet))))

(defun vxe-import-snippet-ielm-to-org ()
  (interactive)
   (let ((snippet (completing-read "snippet: " (split-string
					   (s-chomp
						"find -L ~/.emacs.d/snippets/inferior-emacs-lisp-mode -maxdepth 1 -type f -print0 | xargs -0 basename")
					   "\n"))))
  (s-chomp (concat "cp ~/.emacs.d/snippets/inferior-emacs-lisp-mode/" snippet " ~/.emacs.d/snippets/org-mode/" snippet))))

(defun vxe-import-snippet-org-to-inferior-emacs-lisp ()
  (interactive)
   (let ((snippet (completing-read "snippet: " (split-string
					   (s-chomp
						"find -L ~/.emacs.d/snippets/org-mode -maxdepth 1 -type f -print0 | xargs -0 basename")
					   "\n"))))
  (s-chomp (concat "cp ~/.emacs.d/snippets/org-mode/" snippet " ~/.emacs.d/snippets/inferior-emacs-lisp-mode/" snippet))))

(defun vxe-import-snippet-term-to-comint ()
  (interactive)
   (let ((snippet (completing-read "snippet: " (split-string
					   (s-chomp
						"find -L ~/.emacs.d/snippets/term-mode -maxdepth 1 -type f -print0 | xargs -0 basename")
					   "\n"))))
  (s-chomp (concat "cp ~/.emacs.d/snippets/term-mode/" snippet " ~/.emacs.d/snippets/comint-mode/" snippet))))

(defun vxe-import-snippet-comint-to-term ()
  (interactive)
   (let ((snippet (completing-read "snippet: " (split-string
					   (s-chomp
						"find -L ~/.emacs.d/snippets/comint-mode -maxdepth 1 -type f -print0 | xargs -0 basename")
					   "\n"))))
  (s-chomp (concat "cp ~/.emacs.d/snippets/comint-mode/" snippet " ~/.emacs.d/snippets/term-mode/" snippet))))

(use-package undo-tree
:ensure t
:init
;(global-undo-tree-mode 1)
;; make ctrl-z undo

(global-set-key (kbd "C-/") 'undo)
;; (global-set-key (kbd "C-z C-z") 'undo) ;for terminal emacs
;; make ctrl-Z redo
;; (defalias 'redo 'undo-tree-redo)
;; (global-set-key (kbd "C-S-/") 'redo)

)

(if (eq window-system nil)
    (global-set-key (kbd "M-z") 'undo)
  (global-set-key (kbd "C-/") 'undo))

(defun wget (url)
  (interactive "surl")
  (cd "~/Downloads")
  (async-shell-command (concat "wget " url))
  (dired "~/Downloads"))

(defun ls ()
(interactive)
(async-shell-command "ls -ltr"))

(defun vxe:open-url ()
  (interactive)
  (cond ((eq system-type 'darwin)
	 (copy-region-as-kill (point-min) (point-max) t)
	 (shell-command (concat "open \""
				(with-temp-buffer (yank) (buffer-string))
                             "\"")))))

(defun vxe:toggle-eww-browser ()
  (interactive)
  (setq browse-url-browser-function'eww-browse-url))

(defun vxe:toggle-desktop-browser ()
  (interactive)
  (setq browse-url-browser-function 'browse-url-generic))
