clasp/.emacs.d/init.el

(setq focus-areas-work '("unclear" "administrative" "kaizen" "release_management" "root_cause_analysis" "incident_management"))
  (setq activity-type-work '("unclear" "communicating" "reading" "watching" "researching" "writing" "troubleshooting" "creativing" "erranding" "practicing"))
   (setq context-work '("unclear" "email" "emacs" "grafana" "quip" "cst" "jenkins" "nagios" "radr" "leisure"))

  (defun vxe-tag-search-work ()
    (interactive)
    (let ((focus (completing-read "focus: " focus-areas-work))
	  (type (completing-read "type: " activity-type-work))
	  (context (completing-read "context" context-work)))
      (org-tags-view nil (concat ":" focus ":" type ":" context ":"))))


  (defun vxe-work-capture ()
    (interactive)
    (let ((focus (completing-read "focus: " focus-areas-work))
	  (type (completing-read "type: " activity-type-work))
	  (context (completing-read "context" context-work)))
      (kill-new (concat ":" focus ":" type ":" context ":work:"))
      (org-capture nil "w")))

  (defun vxe-work-capture-tag ()
    (interactive)
    (let ((focus (completing-read "focus: " focus-areas-work))
	  (type (completing-read "type: " activity-type-work))
	  (context (completing-read "context" context-work)))
      (kill-new (concat ":" focus ":" type ":" context ":work:"))))

  (defun vxe-work-focus-search ()
    (interactive)
    (let ((query (completing-read "focus: " focus-areas-work)))
      (org-tags-view nil query)))

  (defun vxe-work-activity-search ()
    (interactive)
    (let ((query (completing-read "focus: " activity-type-work)))
      (org-tags-view nil query)))

  (defun vxe-work-context-search ()
    (interactive)
    (let ((query (completing-read "focus: " context-work)))
      (org-tags-view nil query)))

  ; the goal is a minimal set of categories which covers most tasks
  (setq focus-areas-home '("unclear" "administrative" "career_development" "personal_development" "family" "social" "health" "dating"))
  (setq activity-type-home '("unclear" "communicating" "reading" "researching" "writing" "troubleshooting" "creativing" "erranding" "practicing"))
  (setq context-home '("unclear" "apartment" "emacs" "gym" "leisure")) ; favor specific places outside work, vs home, house etc.

  (defun vxe-tag-search-home ()
    (interactive)
    (let ((focus (completing-read "focus: " focus-areas-home))
	  (type (completing-read "type: " activity-type-home))
	  (context (completing-read "context" context-home)))
      (org-tags-view nil (concat ":" focus ":" type ":" context ":"))))


  (defun vxe-home-capture ()
    (interactive)
    (let ((focus (completing-read "focus: " focus-areas-home))
	  (type (completing-read "type: " activity-type-home))
	  (context (completing-read "context" context-home)))
      (kill-new (concat ":" focus ":" type ":" context ":home:"))
      (org-capture nil "h")))

  (defun vxe-home-capture-tag ()
    (interactive)
    (let ((focus (completing-read "focus: " focus-areas-home))
	  (type (completing-read "type: " activity-type-home))
	  (context (completing-read "context" context-home)))
      (kill-new (concat ":" focus ":" type ":" context ":home:"))))

  (defun vxe-home-focus-search ()
    (interactive)
    (let ((query (completing-read "focus: " focus-areas-home)))
      (org-tags-view nil query)))

  (defun vxe-home-activity-search ()
    (interactive)
    (let ((query (completing-read "focus: " activity-type-home)))
      (org-tags-view nil query)))

  (defun vxe-home-context-search ()
    (interactive)
    (let ((query (completing-read "focus: " context-home)))
      (org-tags-view nil query)))


  (setq focus-areas-bug-tracker '("unclear" "feature" "performance" "clarity"))
  (setq activity-type-bug-tracker '("unclear" "communicating" "researching" "troubleshooting" "creativing"))
  (setq context-bug-tracker '("emacs" "kepler" "jenkins" "work" "algo")) ; favor specific places outside work, vs bug-tracker, house etc.

  (defun vxe-tag-search-bug-tracker ()
    (interactive)
    (let ((focus (completing-read "focus: " focus-areas-bug-tracker))
	  (type (completing-read "type: " activity-type-bug-tracker))
	  (context (completing-read "context" context-bug-tracker)))
      (org-tags-view nil (concat ":" focus ":" type ":" context ":"))))


  (defun vxe-bug-tracker-capture ()
    (interactive)
    (let ((focus (completing-read "focus: " focus-areas-bug-tracker))
	  (type (completing-read "type: " activity-type-bug-tracker))
	  (context (completing-read "context" context-bug-tracker)))
      (kill-new (concat ":" focus ":" type ":" context ":bug:"))
      (org-capture nil "b")))

  (defun vxe-bug-tracker-capture-tag ()
    (interactive)
    (let ((focus (completing-read "focus: " focus-areas-bug-tracker))
	  (type (completing-read "type: " activity-type-bug-tracker))
	  (context (completing-read "context" context-bug-tracker)))
      (kill-new (concat ":" focus ":" type ":" context ":bug:"))))

  (defun vxe-bug-tracker-focus-search ()
    (interactive)
    (let ((query (completing-read "focus: " focus-areas-bug-tracker)))
      (org-tags-view nil query)))

  (defun vxe-bug-tracker-activity-search ()
    (interactive)
    (let ((query (completing-read "focus: " activity-type-bug-tracker)))
      (org-tags-view nil query)))

  (defun vxe-bug-tracker-context-search ()
    (interactive)
    (let ((query (completing-read "focus: " context-bug-tracker)))
      (org-tags-view nil query)))

  (setq focus-areas-drumming '("unclear" "theory" "coordination" "style"))
  (setq activity-type-drumming '("unclear" "communicating" "reading" "researching" "writing" "troubleshooting" "creativing" "erranding" "practicing"))
  (setq context-drumming '("unclear" "drum_set" "pad" "computer" "public")) ; favor specific places outside work, vs drumming, house etc.

  (defun vxe-tag-search-drumming ()
    (interactive)
    (let ((focus (completing-read "focus: " focus-areas-drumming))
	  (type (completing-read "type: " activity-type-drumming))
	  (context (completing-read "context" context-drumming)))
      (org-tags-view nil (concat ":" focus ":" type ":" context ":"))))


  (defun vxe-drumming-capture ()
    (interactive)
    (let ((focus (completing-read "focus: " focus-areas-drumming))
	  (type (completing-read "type: " activity-type-drumming))
	  (context (completing-read "context" context-drumming)))
      (kill-new (concat ":" focus ":" type ":" context ":drumming:"))
      (org-capture nil "d")))

  (defun vxe-drumming-capture-tag ()
    (interactive)
    (let ((focus (completing-read "focus: " focus-areas-drumming))
	  (type (completing-read "type: " activity-type-drumming))
	  (context (completing-read "context" context-drumming)))
      (kill-new (concat ":" focus ":" type ":" context ":drumming:"))))

  (defun vxe-drumming-focus-search ()
    (interactive)
    (let ((query (completing-read "focus: " focus-areas-drumming)))
      (org-tags-view nil query)))

  (defun vxe-drumming-activity-search ()
    (interactive)
    (let ((query (completing-read "focus: " activity-type-drumming)))
      (org-tags-view nil query)))

  (defun vxe-drumming-context-search ()
    (interactive)
    (let ((query (completing-read "focus: " context-drumming)))
      (org-tags-view nil query)))

  (setq focus-areas-blog '("unclear" "emacs" "linux" "politics" "fiction" "humor"))
  (setq activity-type-blog '("unclear" "communicating" "reading" "researching" "writing" "troubleshooting" "creativing" "erranding" "practicing"))
  (setq context-blog '("unclear" "internet" "emacs")) ; favor specific places outside work, vs blog, house etc.

  (defun vxe-tag-search-blog ()
    (interactive)
    (let ((focus (completing-read "focus: " focus-areas-blog))
	  (type (completing-read "type: " activity-type-blog))
	  (context (completing-read "context" context-blog)))
      (org-tags-view nil (concat ":" focus ":" type ":" context ":"))))


  (defun vxe-blog-capture ()
    (interactive)
    (let ((focus (completing-read "focus: " focus-areas-blog))
	  (type (completing-read "type: " activity-type-blog))
	  (context (completing-read "context" context-blog)))
      (kill-new (concat ":" focus ":" type ":" context ":blog:"))
      (org-capture nil "l")))

  (defun vxe-blog-capture-tag ()
    (interactive)
    (let ((focus (completing-read "focus: " focus-areas-blog))
	  (type (completing-read "type: " activity-type-blog))
	  (context (completing-read "context" context-blog)))
      (kill-new (concat ":" focus ":" type ":" context ":blog:"))))

  (defun vxe-blog-focus-search ()
    (interactive)
    (let ((query (completing-read "focus: " focus-areas-blog)))
      (org-tags-view nil query)))

  (defun vxe-blog-activity-search ()
    (interactive)
    (let ((query (completing-read "focus: " activity-type-blog)))
      (org-tags-view nil query)))

  (defun vxe-blog-context-search ()
    (interactive)
    (let ((query (completing-read "focus: " context-blog)))
      (org-tags-view nil query)))

(setq focus-areas-journal '("unclear" "administrative" "career_development" "personal_development" "family" "social" "health" "dating"))
(setq activity-type-journal '("unclear" "communicating" "reading" "researching" "writing" "troubleshooting" "creativing" "erranding" "practicing"))
(setq context-journal '("unclear" "apartment" "emacs" "gym" "leisure")) ; favor specific places outside work, vs journal, house etc.

(defun vxe-tag-search-journal ()
(interactive)
(let ((focus (completing-read "focus: " focus-areas-journal))
(type (completing-read "type: " activity-type-journal))
(context (completing-read "context" context-journal)))
(org-tags-view nil (concat ":" focus ":" type ":" context ":"))))


(defun vxe-journal-capture ()
(interactive)
(let ((focus (completing-read "focus: " focus-areas-journal))
(type (completing-read "type: " activity-type-journal))
(context (completing-read "context" context-journal)))
(kill-new (concat ":" focus ":" type ":" context ":journal:"))
(org-capture nil "j")))

(defun vxe-journal-capture-tag ()
(interactive)
(let ((focus (completing-read "focus: " focus-areas-journal))
(type (completing-read "type: " activity-type-journal))
(context (completing-read "context" context-journal)))
(kill-new (concat ":" focus ":" type ":" context ":journal:"))))

(defun vxe-journal-focus-search ()
(interactive)
(let ((query (completing-read "focus: " focus-areas-journal)))
(org-tags-view nil query)))

(defun vxe-journal-activity-search ()
(interactive)
(let ((query (completing-read "focus: " activity-type-journal)))
(org-tags-view nil query)))

(defun vxe-journal-context-search ()
(interactive)
(let ((query (completing-read "focus: " context-journal)))
(org-tags-view nil query)))

;;;;;;;;;;;;;;;;;;

(setq focus-areas-agenda '("persons" "name" "here" "with" "underscores" ))
(setq activity-type-agenda '("unclear" "brainstorming" "troubleshooting" "learning" "teaching" "planning"))
(setq context-agenda '("unclear" "office" "private" "email" "phone" )) ; favor specific places outside work, vs agenda, house etc.

(defun vxe-tag-search-agenda ()
(interactive)
(let ((focus (completing-read "focus: " focus-areas-agenda))
(type (completing-read "type: " activity-type-agenda))
(context (completing-read "context" context-agenda)))
(org-tags-view nil (concat ":" focus ":" type ":" context ":"))))


(defun vxe-agenda-capture ()
(interactive)
(let ((focus (completing-read "focus: " focus-areas-agenda))
(type (completing-read "type: " activity-type-agenda))
(context (completing-read "context" context-agenda)))
(kill-new (concat ":" focus ":" type ":" context ":agenda:"))
(org-capture nil "a")))

(defun vxe-agenda-capture-tag ()
(interactive)
(let ((focus (completing-read "focus: " focus-areas-agenda))
(type (completing-read "type: " activity-type-agenda))
(context (completing-read "context" context-agenda)))
(kill-new (concat ":" focus ":" type ":" context ":agenda:"))))

(defun vxe-agenda-focus-search ()
(interactive)
(let ((query (completing-read "focus: " focus-areas-agenda)))
(org-tags-view nil query)))

(defun vxe-agenda-activity-search ()
(interactive)
(let ((query (completing-read "focus: " activity-type-agenda)))
(org-tags-view nil query)))

(defun vxe-agenda-context-search ()
(interactive)
(let ((query (completing-read "focus: " context-agenda)))
(org-tags-view nil query)))


(setq focus-areas-career '("unclear" "administrative" "skills" "networking" "vision"))
(setq activity-type-career '("unclear" "communicating" "reading" "researching" "writing" "troubleshooting" "creativing" "practicing"))
(setq context-career '("unclear" "apartment" "emacs" "gym" "leisure")) ; favor specific places outside work, vs career, house etc.

(defun vxe-tag-search-career ()
(interactive)
(let ((focus (completing-read "focus: " focus-areas-career))
(type (completing-read "type: " activity-type-career))
(context (completing-read "context" context-career)))
(org-tags-view nil (concat ":" focus ":" type ":" context ":"))))


(defun vxe-career-capture ()
(interactive)
(let ((focus (completing-read "focus: " focus-areas-career))
(type (completing-read "type: " activity-type-career))
(context (completing-read "context" context-career)))
(kill-new (concat ":" focus ":" type ":" context ":career:"))
(org-capture nil "c")))

(defun vxe-career-capture-tag ()
(interactive)
(let ((focus (completing-read "focus: " focus-areas-career))
(type (completing-read "type: " activity-type-career))
(context (completing-read "context" context-career)))
(kill-new (concat ":" focus ":" type ":" context ":career:"))))

(defun vxe-career-focus-search ()
(interactive)
(let ((query (completing-read "focus: " focus-areas-career)))
(org-tags-view nil query)))

(defun vxe-career-activity-search ()
(interactive)
(let ((query (completing-read "focus: " activity-type-career)))
(org-tags-view nil query)))

(defun vxe-career-context-search ()
(interactive)
(let ((query (completing-read "focus: " context-career)))
(org-tags-view nil query)))
