clasp/.emacs.d/etc/init.org
** command line tool driver
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun command-line-tool  (command-name command-argument task-list  &optional task)
  (interactive "argument")
    (let* ((task
            (if (string= nil task)
                (completing-read "task: " task-list)
              task)))

      (async-shell-command (concat command-name
                                   " "
                                   task
                                   " '"
                                   command-argument
                                   "'")
                           (concat "*" command-name "*" " - " " task " " - "  command-argument))))
#+END_SRC
** package manager driver
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun call-package-manager (package &optional task)
    (interactive "spackage")
    (cond ((string= system-type "darwin")
           (command-line-tool "brew "
                              package
                              (list "search"
                                    "info"
                                    "install"
                                    "update"
                                    "upgrade"
                                    "uninstall"
                                    "list"
                                    "config"
                                    "doctor"
                                    "install -vd ")
                              task))

          ((string= "Ubuntu" (shell-command-to-string "lsb_release -ds | awk '{print $1}'"))
           (command-line-tool "sudo apt-get "
                              package
                              (list "update"
                                   "upgrade"
                                   "install"
                                   "remove"
                                   "autoremove"
                                   "purge"
                                   "source"
                                   "build"
                                   "dist-upgrade"
                                   "dselect-upgrade"
                                   "clean"
                                   "autoclean"
                                   "check"
                                   "changelog"
                                   "download")

                              task))))
#+END_SRC
** compile latest Emacs binary
*** compile latest
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun emacs:compile-latest-osx ()
    (interactive)
    (async-shell-command (concat
                          "mkdir -p $HOME/.emacs.d/src;"
                          "cd $HOME/.emacs.d/src/ ;"
                          "rm -rf $HOME/.emacs.d/src/emacs;"
                          "git clone https://github.com/emacs-mirror/emacs.git;"
                          "cd emacs;"
                          "autoreconf -i;"
                          "./configure --with-modules --prefix=$HOME/.emacs.d;"
                          "make && make install"
                          )


                         (concat "*Emacs* - compile")))
#+END_SRC

#+RESULTS:
: emacs:compile-osx

*** compile release by version number
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun emacs:compile-by-version (version)
    (interactive "sversion: ")
    (async-shell-command (concat
                          "mkdir -p $HOME/.emacs/src;"
                          "cd $HOME/.emacs.d/src/ ;"
                          "rm -rf $HOME/.emacs.d/src/emacs-"
                          version
                          ".tar.gz;"
                          "wget https://github.com/emacs-mirror/emacs/archive/emacs-"
                          version
                          ".tar.gz -O emacs-"
                          version
                          ".tar.gz;"
                          "tar xvf emacs-"
                          version
                          ".tar.gz;"
                          "cd $HOME/.emacs.d/src/emacs-emacs-"
                          version
                          ";"
                          "autoreconf -i;"
                          "./configure --with-modules --prefix=$HOME/.emacs.d;"
                          "make && make install"
                          )


                         (concat "*Emacs* - compile"))

    (kill-new version)
    (find-file "~/Downloads"))
#+END_SRC

*** compile release by version number osx
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun emacs:compile-by-version-osx (version)
    (interactive "sversion: ")
    (async-shell-command (concat
                          "mkdir -p $HOME/.emacs/src;"
                          "cd $HOME/.emacs.d/src/ ;"
                          "rm -rf $HOME/.emacs.d/src/emacs-"
                          version
                          ".tar.gz;"
                          "wget https://github.com/emacs-mirror/emacs/archive/emacs-"
                          version
                          ".tar.gz -O emacs-"
                          version
                          ".tar.gz;"
                          "tar xvf emacs-"
                          version
                          ".tar.gz;"
                          "cd $HOME/.emacs.d/src/emacs-emacs-"
                          version
                          ";"
                          "autoreconf -i;"
                          "./configure --with-modules --with-ns;"
                          "make && sudo make install"
                          )


                         (concat "*Emacs* - compile"))

    (kill-new version)
    (find-file "~/Downloads"))
#+END_SRC

*** compile release by version number no manuals osx
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun emacs:compile-by-version-no-manuals-osx (version)
    (interactive "sversion: ")
    (async-shell-command (concat
                          "mkdir -p $HOME/.emacs/src;"
                          "cd $HOME/.emacs.d/src/ ;"
                          "rm -rf $HOME/.emacs.d/src/emacs-"
                          version
                          ".tar.gz;"
                          "wget https://github.com/emacs-mirror/emacs/archive/emacs-"
                          version
                          ".tar.gz -O emacs-"
                          version
                          ".tar.gz;"
                          "tar xvf emacs-"
                          version
                          ".tar.gz;"
                          "cd $HOME/.emacs.d/src/emacs-emacs-"
                          version
                          ";"
                          "autoreconf -i;"
                          "./configure --with-modules --without-makeinfo --with-ns;"
                          "make && sudo make install"
                          )


                         (concat "*Emacs* - compile"))

    (kill-new version)
    (find-file "~/Downloads"))
#+END_SRC

*** compile release by version number no info manuals
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun emacs:compile-by-version-no-info (version)
    (interactive "sversion: ")
    (async-shell-command (concat
                          "cd $HOME/.emacs.d/src/ ;"
                          "rm -rf $HOME/.emacs.d/src/emacs-"
                          version
                          ".tar.gz;"
                          "wget https://github.com/emacs-mirror/emacs/archive/emacs-"
                          version
                          ".tar.gz -O emacs-"
                          version
                          ".tar.gz;"
                          "tar xvf emacs-"
                          version
                          ".tar.gz;"
                          "cd $HOME/.emacs.d/src/emacs-emacs-"
                          version
                          ";"
                          "autoreconf -i;"
                          "./configure --with-modules --without-makeinfo --prefix=$HOME/.emacs.d;"
                          "make && make install"
                          )


                         (concat "*Emacs* - compile"))

    (kill-new version)
    (find-file "~/Downloads"))
#+END_SRC

#+RESULTS:
: emacs:compile-osx
