clasp/.emacs.d/etc/init.org
*** compile release by version number no info, no gnutls
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun emacs:compile-by-version-xinfo-xgnutls (version)
    (interactive "sversion: ")
    (async-shell-command (concat
                          "mkdir -p $HOME/.emacs/src;"
                          "cd $HOME/.emacs.d/src/ ;"
                          "rm -rf $HOME/.emacs.d/src/emacs-"
                          version
                          ".tar.gz;"
                          "wget https://github.com/emacs-mirror/emacs/archive/emacs-"
                          version
                          ".tar.gz -O emacs-"
                          version
                          ".tar.gz;"
                          "tar xvf emacs-"
                          version
                          ".tar.gz;"
                          "cd $HOME/.emacs.d/src/emacs-emacs-"
                          version
                          ";"
                          "autoreconf -i;"
                          "./configure --with-modules --without-makeinfo --with-gnutls=no --prefix=$HOME/.emacs.d;"
                          "make && make install"
                          )


                         (concat "*Emacs* - compile"))

    (kill-new version)
    (find-file "~/Downloads"))
#+END_SRC
** new wiki entry
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun new-wiki-entry (title)
    (interactive "stitle ")
    (find-file (concat "~/.emacs.d/wiki/" title ".org")))
#+END_SRC
* package configuration
** org-mode Configuration
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (add-to-list 'package-archives
               '("org" . "http://orgmode.org/elpa/") t)

  (use-package org
    :ensure t
    :init)

  (setq org-agenda-default-appointment-duration 30)
  (setq org-agenda-todo-ignore-scheduled 'future)
  (setq org-agenda-tags-todo-honor-ignore-options t)
  (setq org-mobile-inbox-for-pull "~/Dropbox/desktop/Documents/gtd/flagged.org")
  (setq org-mobile-directory "~/Dropbox/Apps/MobileOrg")
  (setq org-goto-interface 'outline-path-completion)
  (setq org-goto-max-level 10)
  (setq org-src-fontify-natively t)

  (require 'ox-md)
  (require 'ox-latex)

  (setq org-confirm-babel-evaluate nil)
  (setq org-babel-default-header-args:sh '((:results . "output")))

  (add-hook 'org-mode-hook 'flyspell-mode)
  (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
  (add-hook 'org-mode-hook
            '(lambda ()
               (define-key org-mode-map (kbd "C-c C-d") 'org-deadline) ;untested
               (define-key org-mode-map (kbd "C-c C-s") 'org-schedule)
               (define-key org-mode-map (kbd "C-c C-r") nil)
               (define-key org-mode-map (kbd "C-c r") nil)))
  (add-hook 'org-mode-hook (lambda ()
                             (progn
                               (defun expose-global-binding-in-org (binding)
                                 (define-key dired-mode-map binding
                                   (lookup-key (current-global-map) binding)))
                               (expose-global-binding-in-org (kbd "M-y")))))
#+END_SRC
*** org-contrib packages
everything that is required from org-contrib should be placed here

#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (cond ((not (file-exists-p "~/.emacs.d/lib/org-mode"))
         (shell-command (concat
                               "mkdir -p ~/.emacs.d/lib;"
                               "cd ~/.emacs.d/lib;"
                               "curl -LO https://orgmode.org/org-9.1.6.tar.gz;"
                               "tar -xvf org-9.1.6.tar.gz;"
                               "mv ~/.emacs.d/lib/org-9.1.6 ~/.emacs.d/lib/org-mode"))))

  (add-to-list 'load-path "~/.emacs.d/lib/org-mode/contrib/lisp" t)
#+END_SRC


**** org-notmuch
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  ;; (require 'org-notmuch)
#+END_SRC
**** org-mime
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (cond ((not (file-exists-p "~/.emacs.d/lib/org-mime.el"))
         (shell-command (concat "curl 'https://gist.githubusercontent.com/vxe/12509a252c07efa22b5fdf85fd4c6236/raw/5e26f49035d4c85ac9dd51081d027582dfbb28b3/gistfile1.txt' > ~/.emacs.d/lib/org-mime.el"))
         (add-to-list 'load-path "~/.emacs.d/lib" t)
         (require 'org-mime)))
#+END_SRC
**** org-checklist
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (require 'org-checklist)
#+END_SRC
**** org-drill
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  ;; (use-package org-drill
  ;;              :config (progn
  ;; 		       (add-to-list 'org-modules 'org-drill)
  ;; 		       (plist-put org-format-latex-options :scale 2.0)
  ;; 		       (setq org-format-latex-options (plist-put org-format-latex-options :scale 2.0))
  ;; 		       (setq org-drill-add-random-noise-to-intervals-p t)
  ;; 		       (setq org-drill-hint-separator "||")
  ;; 		       (setq org-drill-left-cloze-delimiter "<[")
  ;; 		       (setq org-drill-right-cloze-delimiter "]>")
  ;; 		       (setq org-drill-learn-fraction 0.15)))
#+END_SRC
**** org-eww

#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (cond ((not (file-exists-p "~/.emacs.d/lib/org-eww.el"))
         (shell-command (concat "curl 'https://gist.githubusercontent.com/vxe/7425c0d47ff3406e0b67290fba5182ff/raw/439f3ebcdeb7bb28aae58bb73f3b42c0c93711eb/org-eww.el' > ~/.emacs.d/lib/org-eww.el"))
         (add-to-list 'load-path "~/.emacs.d/lib" t)
         (require 'org-eww)))


#+END_SRC
**** ob-groovy
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  ;; (require 'ob-groovy)
#+END_SRC
*** org-bullets
Gotta have those stylish org-mode bullet points
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package org-bullets
:ensure t)
#+END_SRC
*** ox-gfm
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (use-package ox-gfm
    :ensure t)

#+END_SRC
*** export table to csv and open file
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun vxe-org-table-export (output)
    (interactive "F")
    (org-table-export output)
    (find-file output))
#+END_SRC
*** org blog generating functions
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  ;; (cond ((file-exists-p "~/pull-requests")
  ;;        (load-file "~/pull-requests/blog/home/sbin/generate-html.el")))
#+END_SRC
*** ox-clip formatted-copy
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun ox-clip:install ()
    (interactive)
    (shell-command "cd ~/.emacs.d/lib; git clone https://github.com/jkitchin/ox-clip.git"))

  (use-package htmlize
    :ensure t
    :init
    (cond((not (file-exists-p "~/.emacs.d/lib/ox-clip/ox-clip.el"))
          (ox-clip:install)))

    (load-file "~/.emacs.d/lib/ox-clip/ox-clip.el"))
#+END_SRC
*** toc-org
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (use-package toc-org
    :ensure t
    :init
    (if (require 'toc-org nil t)
        (add-hook 'org-mode-hook 'toc-org-enable)
      (warn "toc-org not found"))
    (add-to-list 'org-tag-alist '("TOC" . ?T)))


#+END_SRC
*** org-mind-map
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun org-mind-map-install ()
    (interactive)
    (shell-command (concat
                          "cd ~/.emacs.d/lib;"
                          "git clone https://github.com/theodorewiles/org-mind-map.git;")))
  (cond ((file-exists-p "~/.emacs.d/lib/org-mind-map")
         (add-to-list 'load-path "~/.emacs.d/lib/org-mind-map")))
#+END_SRC
*** org-mime
**** enable keybinding to export document to email
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (add-hook 'org-mode-hook
            (lambda ()
              (local-set-key "\C-c\M-o" 'org-mime-org-buffer-htmlize)))
#+END_SRC
*** enable yasnippet in org buffers
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (add-hook 'org-mode-hook
            (lambda ()
              (yas-minor-mode)))
#+END_SRC
