clasp/.emacs.d/init.el

(use-package yasnippet
  :ensure t
  :init

                                        ; set snippet directory
  (cond ((eq system-type 'darwin) (setq yas-snippet-dirs  '("~/.emacs.d/snippets")))
        ((eq system-type 'gnu/linux) (setq yas-snippet-dirs '("~/.emacs.d/snippets")))
        ((eq system-type 'windows-nt) (setq yas-snippet-dirs '("~/put-dir-here"))))
                                        ; reload snippets on emacs reboot



  (defun vxe-term-toggle-mode ()
    (interactive)
    (if (term-in-line-mode)
        (term-char-mode)
      (term-line-mode)))


  (defun vxe-helm-yas-complete ()
    (interactive)
                                        ;  (vxe-term-toggle-mode)

    (cond ((string= "term-mode" (message "%s" major-mode))
           (vxe-term-toggle-mode)))
    (yas-reload-all)
    (yas-minor-mode-on)
    (helm-yas-complete)
                                        ; (cond ((string= "term-mode" (message "%s" major-mode))(vxe-term-toggle-mode)))
    )

  ;; suppress warning when embedding elisp into snippets
                                        ;(add-to-list 'warning-suppress-types '(yasnippet backquote-change))

  :config
  (require 'yasnippet)
  (yas-reload-all))

(use-package helm
  :ensure t
  :init
