clasp/.emacs.d/etc/init.org
** helm Configuration
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (use-package helm
    :ensure t
    :init
    (add-hook 'helm-after-update-hook (lambda () (with-helm-window (fit-window-to-buffer))))
    (setq helm-always-two-windows  t)
    (setq helm-split-window-in-side-p           t ; open helm buffer inside current window, not occupy whole other window
          helm-move-to-line-cycle-in-source     t ; move to end or beginning of source when reaching top or bottom of source.
          helm-ff-search-library-in-sexp        t ; search for library in `require' and `declare-function' sexp.
          helm-scroll-amount                    8 ; scroll 8 lines other window using M-<next>/M-<prior>
          helm-ff-file-name-history-use-recentf t)
    (setq helm-buffer-max-length nil)
    :config
    (require 'helm)
    (require 'helm-config)
  
    (when (executable-find "curl")
      (setq helm-google-suggest-use-curl-p t))
    (helm-mode 1)
  
  
  
    (defun vxe-helm-switch-buffer ()
      "this used to work"
      (interactive)
      (if (and (one-window-p t)
               (not (active-minibuffer-window)))
          (split-window-vertically))
                                          ;      (other-window 1)
      (helm-mini)
                                          ; if we get persp mode working
      ;;  (let ((current-buff (buffer-name)))
      ;;   (persp-add-buffers-by-regexp current-buff)))
      )
  
  
    ;; (defun vxe-helm-switch-buffer-new ()
    ;;   "this used to work"
    ;;   (interactive)
    ;; ;  (if (and (one-window-p t)
    ;; ;;      (not (active-minibuffer-window)))
    ;; ;      (split-window-vertically))
    ;; ;  (other-window 1)
    ;;   (helm-mini)
    ;;   (let ((current-buff (buffer-name)))
    ;;     (persp-add-buffers-by-regexp current-buff)))
  
  
    (defun vxe-helm-yas-complete-old ()
      (interactive)
      (cond ((string= "term-mode" (message "%s" major-mode))(vxe-term-toggle-mode)))
      (yas-reload-all)
      (yas-minor-mode-on)
      (helm-yas-complete)
      (cond ((string= "term-mode" (message "%s" major-mode))(vxe-term-toggle-mode))))
  
    (defun vxe-helm-yas-complete ()
      (interactive)
                                          ;  (vxe-term-toggle-mode)
      (cond ((string= "term-mode" (message "%s" major-mode))
             (vxe-term-toggle-mode)))
      (yas-reload-all)
      (yas-minor-mode-on)
      (helm-yas-complete)
                                          ; (cond ((string= "term-mode" (message "%s" major-mode))(vxe-term-toggle-mode)))
      )
  
    (defun vxe-helm-suggest-code-block ()
      (interactive)
      (let ((lang (completing-read "what language: " (split-string
                                                      (s-chomp "cat ~/.emacs.d/data/org-block-languages")
                                                      "\n"))))
        (insert lang)))
  
    (defun vxe-split-window-vertically ()
      (interactive)
      (split-window-vertically)
      (vxe-helm-switch-buffer))
  
    (defun vxe-split-window-horizontally ()
      (interactive)
      (split-window-horizontally)
      (vxe-helm-switch-buffer))
  
    (defun vxe-kb-search ()
      (interactive)
      (s-chomp "mkdir -p ~/.emacs.d/kb")
      (defun vxe/generic-kb (topic)
        (interactive "s ")
        ;; (if (and (one-window-p t)
        ;; 	     (not (active-minibuffer-window)))
        ;; 	(split-window-vertically))
        ;; (other-window 1)
        (cond ((string= topic "sc")
               (switch-to-buffer "*scratch*")
               (vxe-journal-mode))
              (t (find-file (concat "~/.emacs.d/kb/" topic)))))
    
      (cond ((eq system-type 'windows-nt)
             (find-file (completing-read "book:"
                                         (split-string (s-chomp
                                                        (concat "perl5.20.2.exe "
                                                                emacs-root
                                                                "Dropbox/.emacs.d/windows/get-kb-list.pl"))"\n"))))
            ((eq system-type 'darwin)
             (let ((input (completing-read "topic:" (split-string
                                                     (s-chomp
                                                      "find -L ~/Documents/kb -maxdepth 1 -type f -print0 | xargs -0 basename | grep -Ev '^#|^[.]'")
                                                     "\n"))))
               (vxe/generic-kb input)))
            ((eq system-type 'gnu/linux)
             (let ((input (completing-read "topic:" (split-string
                                                     (s-chomp
                                                      "find -L ~/Documents/kb -maxdepth 1 -type f -printf '%f\n' | grep -Ev '^#|^[.]' ")
                                                     "\n"))))
               (vxe/generic-kb input)))
	  
	  
            (t     (let ((input (completing-read "topic:" (split-string
                                                           (s-chomp
                                                            "find -L ~/.emacs.d/kb -maxdepth 1 -type f ! -name '*[#~]' ! -name '*html' ! -name '*git*' -printf '%f\n'")
                                                           "\n"))))
                     (vxe/generic-kb input)))))
  
  
  
    (defun vxe-img-search ()
      (interactive)
      (s-chomp "mkdir -p ~/.emacs.d/wiki/img")
      (defun vxe/generic-wiki (topic)
        (interactive "s ")
        ;; (if (and (one-window-p t)
        ;; 	     (not (active-minibuffer-window)))
        ;; 	(split-window-vertically))
        ;; (other-window 1)
        (cond ((string= topic "sc")
               (switch-to-buffer "*scratch*")
               (vxe-journal-mode))
              (t (find-file (concat "~/.emacs.d/wiki/img/" topic)))))
    
      (cond ((eq system-type 'windows-nt)
             (find-file (completing-read "book:"
                                         (split-string (s-chomp
                                                        (concat "perl5.20.2.exe "
                                                                emacs-root
                                                                "Dropbox/.emacs.d/windows/get-kb-list.pl"))"\n"))))
            ((eq system-type 'darwin)
             (let ((input (completing-read "topic:" (split-string
                                                     (s-chomp
                                                      "find -L ~/Documents/wiki/img -maxdepth 1 -type f -print0 | xargs -0 basename | grep -Ev '^#|^[.]'")
                                                     "\n"))))
               (vxe/generic-wiki input)))
            ((eq system-type 'gnu/linux)
             (let ((input (completing-read "topic:" (split-string
                                                     (s-chomp
                                                      "find -L ~/Documents/wiki/img -maxdepth 1 -type f -printf '%f\n' | grep -Ev '^#|^[.]' ")
                                                     "\n"))))
               (vxe/generic-wiki input)))
	  
	  
            (t     (let ((input (completing-read "topic:" (split-string
                                                           (s-chomp
                                                            "find -L ~/.emacs.d/wiki/img -maxdepth 1 -type f ! -name '*[#~]' ! -name '*html' ! -name '*git*' -printf '%f\n'")
                                                           "\n"))))
                     (vxe/generic-wiki input)))))
  
  
    (global-set-key (kbd "C-x C-f") 'helm-find-files)
    (global-set-key (kbd "C-x F") 'find-file)
    (global-set-key (kbd "C-x f") 'find-file-at-point)
    (global-set-key (kbd "C-x RET") 'helm-mini)
    (global-set-key (kbd "C-x <C-return>") 'helm-mini))
  ;; (global-set-key (kbd "M-\\") 'vxe-split-window-vertically)
  ;; (global-set-key (kbd "C-x C-Y") 'split-window-vertically)
  ;; (global-set-key (kbd "C-x Y") 'split-window-vertically)
  ;; (global-set-key (kbd "M-p") 'vxe-split-window-horizontally)
  (global-set-key (kbd "C-x C-w") 'yank-line)
  (global-set-key (kbd "C-x w") 'yank-line)
  ;; (global-set-key (kbd "C-x y") 'split-window-horizontally)
  (global-set-key (kbd "C-x 4") 'vxe-wiki-search)
  (global-set-key (kbd "C-x \#") 'vxe-img-search)
  (define-key helm-map (kbd "<tab>") 'helm-execute-persistent-action) ; rebind tab to run persistent action
  (define-key helm-map (kbd "C-i") 'helm-execute-persistent-action) ; make TAB works in terminal
  (define-key helm-map (kbd "C-z")  'helm-select-action) ; list actions using C-z

#+END_SRC
