clasp/.emacs.d/init.el

(use-package helm-ag
  :ensure t
  :init)

(defun vxe:install-ag ()
  (interactive)
  (cond ((eq system-type 'darwin)
         (shell-command "brew install ag"))))

(use-package helm-swoop
    :ensure t
    :init)

(use-package helm-c-yasnippet
    :ensure t
    :init)

(use-package helm-org-rifle
  :ensure t)

(setq multi-term-program (s-chomp (shell-command-to-string "which zsh")))

(use-package exec-path-from-shell
  :ensure t
  :init
    (when (memq window-system '(mac ns))
    (exec-path-from-shell-initialize)
    (exec-path-from-shell-copy-env "WORKON_HOME")
    (exec-path-from-shell-copy-env "PATH")
    (exec-path-from-shell-copy-env "TERM")
    (exec-path-from-shell-copy-env "GROOVY_HOME")
    (exec-path-from-shell-copy-env "NVM_DIR")
    (exec-path-from-shell-copy-env "PYTHONSTARTUP"))


  :config
  ;; find zsh
  ;; (if (string= "" (s-chomp (shell-command-to-string "which zsh")))
  ;;       (setenv "SHELL" (s-chomp (shell-command-to-string "which bash")))
  ;;   (setenv "SHELL" (s-chomp (shell-command-to-string "which zsh"))))


  )

(use-package notmuch
  :ensure t
  :init

  (require 'notmuch)



  (add-hook 'notmuch-message-mode-hook (lambda ()
                                         (define-key notmuch-message-mode-map (kbd "r") nil)))

  (add-hook 'notmuch-message-mode-hook
            '(lambda ()
               (define-key notmuch-message-mode-map (kbd "C-x i") 'mml-attach-file)
               (define-key notmuch-message-mode-map (kbd "C-c C-r") nil)
               (define-key notmuch-message-mode-map (kbd "C-c r") nil)))



  (setq message-default-mail-headers "Cc: \n")
  (define-key notmuch-show-mode-map (kbd "w") 'vxe-notmuch-show-save-attachment)
  (define-key notmuch-show-mode-map (kbd "c m") 'notmuch-get-message-id))
;; default function overrides

(defun notmuch-search-messageid-region ()
  (interactive)
  (copy-region-as-kill (point-min) (point-max) t)
  (notmuch-search-by-message-id (with-temp-buffer (yank) (buffer-string))))

(defun vxe-notmuch-show-save-attachment ()
  (interactive)
  (shell-command "mkdir -p ~/Downloads")
  (let (cwd (pwd))
    (with-temp-buffer
      (cd "~/Downloads")
      (notmuch-show-save-attachments))))

(defun vxe-compose-mail ()
  (interactive)
  (with-temp-buffer
    (cd "~/Downloads")
    (compose-mail)
    (company-mode)
    (setq pyenv-mode nil)))

(defun vxe:nm-edit-queries ()
  (interactive)
  (find-file "/usr/local/bin/mail-sync"))

(defun vxe-enable-gmail ()
  (interactive)
  (setq message-send-mail-function 'smtpmail-send-it
        smtpmail-starttls-credentials '(("smtp.gmail.com" 587 nil nil))
        smtpmail-auth-credentials '(("smtp.gmail.com" 587 "vedwin.dev@gmail.com" nil))
        smtpmail-default-smtp-server "smtp.gmail.com"
        smtpmail-smtp-server "smtp.gmail.com"
        smtpmail-smtp-service 587))

(defun vxe-default-email-config ()
  (interactive)
  (load-file "~/.gnus"))

(defun notmuch-get-message-id ()
  "get message id in Mail.app format"
  (interactive)
  (let* ((unformatted-id (notmuch-show-get-message-id))
         (first-iteration (replace-regexp-in-string "^id:" "message:<" unformatted-id))
         (output (replace-regexp-in-string "$" ">" first-iteration)))
    (kill-new output)))

(defun notmuch-search-by-message-id (message-id)
  (interactive "smessage-id: ")
  (let* ((first-iteration (replace-regexp-in-string "message:<" "" message-id))
         (output (replace-regexp-in-string ">$" "" first-iteration)))
    (notmuch-search (concat "id:" output))))

(add-hook 'notmuch-message-mode-hook #'flyspell-mode)
