clasp/.emacs.d/init.el

(use-package emms
  :ensure t
  :config
  (require 'emms-setup)
  (require 'emms-player-mplayer)
                                        ;(emms-standard)
  (emms-all)
  (emms-default-players)

  :init

  (defun vxe-emms-streams ()
    (interactive)
    (setq exec-path (append exec-path '("/usr/local/bin")))
    (require 'emms-setup)
    (require 'emms-player-mplayer)
                                        ;(emms-standard)
    (emms-all)
    (emms-default-players)

    (define-emms-simple-player mplayer '(file url)
      (regexp-opt '(".ogg" ".mp3" ".wav" ".mpg" ".mpeg" ".wmv" ".wma"
                    ".mov" ".avi" ".divx" ".ogm" ".asf" ".mkv" "http://" "mms://"
                    ".rm" ".rmvb" ".mp4" ".flac" ".vob" ".m4a" ".flv" ".ogv" ".pls"))
      "mplayer" "-nogui" "-slave" "-quiet" "-really-quiet")
    (emms-streams))


  (defun vxe-emms-play-video ()
    (interactive)

    (let ((input (completing-read "song: "
                                  (split-string (s-chomp "find -L \"$HOME/Movies\" -iname '*m4a' -o -iname '*m4a' -o -iname '*mp4' ")  "\n"))))
      (setq exec-path (append exec-path '("/usr/local/bin")))
      (require 'emms-setup)
      (require 'emms-player-mplayer)
                                        ;(emms-standard)
      (emms-all)
      (emms-default-players)

      (define-emms-simple-player mplayer '(file url)
        (regexp-opt '(".ogg" ".mp3" ".wav" ".mpg" ".mpeg" ".wmv" ".wma"
                      ".mov" ".avi" ".divx" ".ogm" ".asf" ".mkv" "http://" "mms://"
                      ".rm" ".rmvb" ".mp4" ".flac" ".vob" ".m4a" ".flv" ".ogv" ".pls"))
        "mplayer" "-nogui" "-slave" "-quiet" "-really-quiet")
      (emms-play-file input)))


  (defun vxe-emms-itunes-search ()
    (interactive)
    (let ((input (completing-read "song: "
                                  (split-string (s-chomp "find -L \"$HOME/Music/iTunes/iTunes Media/Music\" -iname '*m4a' -o -iname '*mp3' ")  "\n"))))
      ;; TODO add gnu/linux  case
      (cond ((eq system-type 'darwin)
             (define-emms-simple-player afplay '(file)
               (regexp-opt '(".mp3" ".m4a" ".aac" "pls"))
               "afplay")
             (setq emms-player-list `(,emms-player-afplay))))
      (emms-play-file input)))


  (defun vxe-emms-itunes-dir-play ()
    (interactive)
    (let ((input (completing-read "song: "
                                  (split-string (s-chomp "find -L \"$HOME/Music/iTunes/iTunes Media/Music\" -type d")  "\n"))))
      ;; TODO add gnu/linux  case
      (cond ((eq system-type 'darwin)
             (define-emms-simple-player afplay '(file)
               (regexp-opt '(".mp3" ".m4a" ".aac" "pls"))
               "afplay")
             (setq emms-player-list `(,emms-player-afplay))))
      (emms-play-file input)))


  (defun vxe-emms-shuffle-and-play-regexp ()
    (interactive)
    (let ((input (completing-read "song: "
                                  (split-string (s-chomp "find -L \"$HOME/Music/iTunes/iTunes Media/Music\" -type d")  "\n"))))
      ;; TODO add gnu/linux  case
      (cond ((eq system-type 'darwin)
             (define-emms-simple-player afplay '(file)
               (regexp-opt '(".mp3" ".m4a" ".aac" "pls"))
               "afplay")
             (setq emms-player-list `(,emms-player-afplay))))
      (emms-play-find "~/Music" input)
      (emms-shuffle)
      ))

  (defun vxe-emms-insert-find (regexp)
    (interactive "sinsert by regexp: ")
    (emms-insert-find "~/Music" regexp)
    (hydra-emms/body))


  (defun vxe-emms-playlist-new (name)
    (interactive "splaylist name: ")
    (let ((playlist-name (concat "emms-playlist-" name)))
      (emms-playlist-new playlist-name)
      (switch-to-buffer playlist-name)
      (hydra-emms/body)))

  (defun vxe-emms-podcast-play ()
    (interactive)
    (let ((input (completing-read "song: "
                                  (split-string (s-chomp "find -L \"$HOME/Music/iTunes/iTunes Media/Podcasts\" -iname '*m4a' -o -name '*mp3'")  "\n"))))
      (emms-play-file input))))

(defun vxe:download-geeknote ()
      (interactive)
      (with-temp-buffer
        (cd "~/.emacs.d/opt")
        (async-shell-command "git clone https://github.com/jeffkowalski/geeknote")))


    (defun vxe:install-geeknote ()
      (interactive)
      (with-temp-buffer
        (cd "~/.emacs.d/opt/geeknote")
        (shell-shell-command "pip install -r requirements.txt")
        (shell-shell-command "python setup.py install")
        (async-shell-command "geeknote settings --editor 'emacsclient'")
        (setq geeknote-command "python ~/.emacs.d/opt/geeknote/geeknote/geeknote.py")))

(defun vxe:download-emacs-geeknote ()
(interactive)
(async-shell-command "cd ~/.emacs.d/lib ; git clone https://github.com/vxe/emacs-geeknote.git")
)

(defun vxe:install-emacs-geeknote ()
(interactive)
(load-file "~/.emacs.d/lib/emacs-geeknote/geeknote.el"))

(defun vxe:create-geeknote-virtualenv ()
(interactive)
(async-shell-command "cd ~/.emacs.d/opt/geeknote; virtualenv .geeknote"))

  ;; (use-package geeknote
  ;;   :ensure t
  ;;   :init
  ;;  (setq geeknote-command "python ~/.emacs.d/opt/geeknote/geeknote/geeknote.py"))


(cond ((file-exists-p "~/.emacs.d/lib/emacs-geeknote/geeknote.el")
       (load-file "~/.emacs.d/lib/emacs-geeknote/geeknote.el")))

(defun geeknote:install-in-venv ()
  (interactive)
  (async-shell-command (concat "source ~/.emacs.d/var/"
                               venv-current-name
                               "/bin/activate;"
                               "mkdir -p ~/.emacs.d/tmp;"
                               "rm -rf ~/.emacs.d/tmp/geeknote;"
                               "cd ~/.emacs.d/tmp;"
                               "git clone https://github.com/jeffkowalski/geeknote.git;"
                               "cd geeknote;"
                               "python setup.py build;"
                               "pip install --upgrade .  ")
                               (concat "*geeknote* - install in venv " venv-current-name)))

(defun geeknote:install-in-specified-venv ()
  (interactive)
  (venv-workon)
  (async-shell-command (concat "source ~/.emacs.d/var/"
                               venv-current-name
                               "/bin/activate;"
                               "mkdir -p ~/.emacs.d/tmp;"
                               "rm -rf ~/.emacs.d/tmp/geeknote;"
                               "cd ~/.emacs.d/tmp;"
                               "git clone https://github.com/jeffkowalski/geeknote.git;"
                               "cd geeknote;"
                               "python setup.py build;"
                               "pip install --upgrade .  ")
                               (concat "*geeknote* - install in venv " venv-current-name)))
