clasp/.emacs.d/etc/init.org
*** install maxima
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (setq maxima-version "5.40.0")
  (setq maxima-binary (s-chomp "which maxima"))

  (defun install-maxima-osx ()
    (interactive)
    (async-shell-command (concat "cd ~/.emacs.d/opt; wget https://sourceforge.net/projects/maxima/files/Maxima-MacOS/5.40.0-MacOSX/Maxima-"
                                 maxima-version
                                 "-VTK-macOS.dmg/download -O maxima.dmg; open maxima.dmg")))

  ;; (cond ((eq system-type 'darwin)
  ;;        (if (not (string= ""
  ;;                          maxima-binary))
  ;;            (progn
  ;;              (add-to-list 'load-path (s-chomp (shell-command-to-string "find /usr/local/Cellar -name  emacs | grep maxima")))
  ;;              (require 'maxima)
  ;;              (require 'imaxima)
  ;;              (require 'imath)
  ;;               (require 'emaxima))
  ;;          (message "install maxima"))))

#+END_SRC
*** launch command override
aka emulate a hook since imaxima operates in comint mode
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun vxe-imaxima ()
  (interactive)
  (imaxima)
  (smartparens-mode))
#+END_SRC
* programming environments
** Generic Tools
*** Project Management
**** projectile
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package projectile
:ensure t
)
#+END_SRC

**** skeletor
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package skeletor
:ensure t
)
#+END_SRC
**** GNATS - bug tracker
***** Download
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun GNATS:download ()
    (interactive)
    (async-shell-command (concat
                          "cd ~/Downloads;"
                          "wget https://ftp.gnu.org/pub/gnu/gnats/gnats-4.2.0.tar.gz;"
                          "tar xvf gnats-4.2.0.tar.gz")
                         (concat "*GNATS - download*")))
#+END_SRC
***** Compile
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun GNATS:compile ()
    (interactive)
    (async-shell-command (concat
                          "cd ~/Downloads/gnats-4.2.0;"
                          "./configure --prefix=$HOME/.emacs.d"
                          "make; "
                          "make install;"
                          "make install install-info")
                         (concat "*GNATS - compile*")))
#+END_SRC
***** Configure Emacs
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
 (add-to-list 'load-path "~/.emacs.d/lib/gnats")
  (autoload 'send-pr "gnats"
     "Command to create and send a problem report." t)
  (autoload 'edit-pr "gnats"
     "Command to edit a problem report." t)
  (autoload 'view-pr "gnats"
     "Command to view a problem report." t)
  (autoload 'query-pr "gnats"
     "Command to query information about problem reports." t)
  (autoload 'unlock-pr "gnats"
     "Unlock a problem report." t)
  (autoload 'gnats-dbconfig-mode "gnats"
    "Major mode for editing the `dbconfig' GNATS configuration file." t)
  (add-to-list 'auto-mode-alist '("\\<dbconfig$" . gnats-dbconfig-mode))
#+END_SRC
***** Create Defualt Database
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun GNATS:create-default-db ()
    (interactive)
    (async-shell-command (concat "/usr/local/libexec/gnats/mkdb default")
                         (concat "*GNATS - create db*")
                         )
    )
#+END_SRC
*** Build Tools
**** cmake
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package cmake-mode
:ensure t
:init
(require 'cmake-mode)
(define-key cmake-mode-map (kbd "C-c d") 'cmake-help))
#+END_SRC
***** generate compilation database broken
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun cmake-generate-compilation-database ()
    (interactive)
    (async-shell-command (concat "mkdir -p "
                                 projectile-project-root
                                 "/build;"
                                 "cd "
                                 projectile-project-root
                                 "/build;"
                                 "cmake -DCMAKE_EXPORT_COMPILE_COMMANDS=1 .. ;"
                                 "make")
                         (concat "*CMake* - compile with database")))
#+END_SRC
**** cmake-ide
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package cmake-ide
:ensure t )
#+END_SRC

*** Documentation
**** dash
***** download javadoc generator
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(defun dash:download-javadoc-generator ()
(interactive)
(async-shell-command "cd ~/.emacs.d/bin; wget http://kapeli.com/javadocset.zip; unzip javadocset.zip; chmod a+x javadocset ")
)
#+END_SRC
**** helpful
improved emacs help system
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (use-package helpful
    :ensure t
    :init
    ;; Note that the built-in `describe-function' includes both functions
    ;; and macros. `helpful-function' is functions only, so we provide
    ;; `helpful-callable' as a drop-in replacement.
    (global-set-key (kbd "C-h f") #'helpful-callable)

    (global-set-key (kbd "C-h v") #'helpful-variable)
    (global-set-key (kbd "C-h k") #'helpful-key)

    ;; Lookup the current symbol at point. C-c C-d is a common keybinding
  ;; for this in lisp modes.
  (global-set-key (kbd "C-c C-d") #'helpful-at-point)

  ;; Look up *F*unctions (excludes macros).
  ;;
  ;; By default, C-h F is bound to `Info-goto-emacs-command-node'. Helpful
  ;; already links to the manual, if a function is referenced there.
  (global-set-key (kbd "C-h F") #'helpful-function)

  ;; Look up *C*ommands.
  ;;
  ;; By default, C-h C is bound to describe `describe-coding-system'. I
  ;; don't find this very useful, but it's frequently useful to only
  ;; look at interactive functions.
  (global-set-key (kbd "C-h C") #'helpful-command)
    )
#+END_SRC
**** helm-dash
dash is awesome, helm-dash is phenomenal, install docsets and view output in eww.  rad.
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package helm-dash
:ensure t
)
#+END_SRC
**** company-quickhelp
provide AutoComplete like documentation for completion condidates
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package company-quickhelp
:ensure t
:config
 (add-hook 'company-mode-hook #'company-quickhelp-mode)
)
#+END_SRC
**** lice
generate licenses
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package lice
:ensure t)
#+END_SRC
**** doxymacs
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun compile-doxymacs ()
    (interactive)
    (async-shell-command "git clone https://github.com/vxe/doxymacs-osx.git && cd doxymacs-osx && ./configure && make && sudo make install"))
#+END_SRC
***** load doxymacs if installed, download and compile if not (untested and potentially dangerous on a new install because of all to sudo)
#+BEGIN_SRC elisp tangle ~/.emacs.d/init.el
  (cond ((not (file-exists-p "~/.emacs.d/opt/doxymacs-osx"))
         (compile-doxymacs)
         (add-to-list 'load-path "~/.emacs.d/opt/doxymacs-osx"))
        (t (add-to-list 'load-path "~/.emacs.d/opt/doxymacs-osx")))

#+END_SRC
**** man pages
***** download and install linux manpages by kernel version
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun download-linux-manpages-by-kernel (kernel-version)
    (interactive "skernel version")
    (async-shell-command (concat
                          "mkdir -p ~/.emacs.d/var/man"
                          "cd ~/.emacs.d/var/man;"
                          "wget https://www.kernel.org/pub/linux/docs/man-pages/man-pages-" kernel-version".tar.gz; "
                          "tar xvf man-pages-" kernel-version".tar.gz;")
                         (concat "*woman* - downloading linux manpages"))
    (customize-variable 'woman-manpath))
#+END_SRC
***** download procps manpages
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun download-procps-manpages ()
    (interactive)
    (async-shell-command (concat
                          "mkdir -p ~/.emacs.d/var/man"
                          "cd ~/.emacs.d/var/man;"
                          "git clone https://gitlab.com/procps-ng/procps/ ;"
                          "cd procps;"
                          "mkdir -p man;"
                          "mv * man")
                         (concat "*woman* - downloading procps manpages"))
    (customize-variable 'woman-manpath))
#+END_SRC
***** download docker manpages
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun download-docker-manpages ()
    (interactive)
    (async-shell-command (concat
                          "mkdir -p ~/.emacs.d/var/man;"
                          "mkdir -p ~/.emacs.d/var/man/docker/man;"
                          "cd ~/.emacs.d/var/man/docker/man;"
                          "wget http://manpages.ubuntu.com/manpages.gz/xenial/man1/docker.1.gz ;"
                          "gunzip docker.1.gz;")
                         (concat "*woman* - downloading docker manpages"))
    (customize-variable 'woman-manpath))
#+END_SRC
***** syscall lookup
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun linux-syscall-man-lookup ()
    (interactive)
    (let ((syscall (completing-read "syscall:" linux-system-calls)))
      (woman syscall)))
#+END_SRC
*** Debugging
**** isend
This basically will send the current line to the last line of your interactive session
(repl/debugger), effectively evaling it.
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package isend-mode
:ensure t
)
#+END_SRC
**** flycheck
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package flycheck
:ensure t)
#+END_SRC
