clasp/.emacs.d/init.el

(setq maxima-version "5.40.0")
(setq maxima-binary (s-chomp "which maxima"))

(defun install-maxima-osx ()
  (interactive)
  (async-shell-command (concat "cd ~/.emacs.d/opt; wget https://sourceforge.net/projects/maxima/files/Maxima-MacOS/5.40.0-MacOSX/Maxima-"
                               maxima-version
                               "-VTK-macOS.dmg/download -O maxima.dmg; open maxima.dmg")))

;; (cond ((eq system-type 'darwin)
;;        (if (not (string= ""
;;                          maxima-binary))
;;            (progn
;;              (add-to-list 'load-path (s-chomp (shell-command-to-string "find /usr/local/Cellar -name  emacs | grep maxima")))
;;              (require 'maxima)
;;              (require 'imaxima)
;;              (require 'imath)
;;               (require 'emaxima))
;;          (message "install maxima"))))

(defun vxe-imaxima ()
(interactive)
(imaxima)
(smartparens-mode))

(use-package projectile
:ensure t
)

(use-package skeletor
:ensure t
)

(defun GNATS:download ()
  (interactive)
  (async-shell-command (concat
                        "cd ~/Downloads;"
                        "wget https://ftp.gnu.org/pub/gnu/gnats/gnats-4.2.0.tar.gz;"
                        "tar xvf gnats-4.2.0.tar.gz")
                       (concat "*GNATS - download*")))

(defun GNATS:compile ()
  (interactive)
  (async-shell-command (concat
                        "cd ~/Downloads/gnats-4.2.0;"
                        "./configure --prefix=$HOME/.emacs.d"
                        "make; "
                        "make install;"
                        "make install install-info")
                       (concat "*GNATS - compile*")))

(add-to-list 'load-path "~/.emacs.d/lib/gnats")
 (autoload 'send-pr "gnats"
    "Command to create and send a problem report." t)
 (autoload 'edit-pr "gnats"
    "Command to edit a problem report." t)
 (autoload 'view-pr "gnats"
    "Command to view a problem report." t)
 (autoload 'query-pr "gnats"
    "Command to query information about problem reports." t)
 (autoload 'unlock-pr "gnats"
    "Unlock a problem report." t)
 (autoload 'gnats-dbconfig-mode "gnats"
   "Major mode for editing the `dbconfig' GNATS configuration file." t)
 (add-to-list 'auto-mode-alist '("\\<dbconfig$" . gnats-dbconfig-mode))

(defun GNATS:create-default-db ()
  (interactive)
  (async-shell-command (concat "/usr/local/libexec/gnats/mkdb default")
                       (concat "*GNATS - create db*")
                       )
  )

(use-package cmake-mode
:ensure t
:init
(require 'cmake-mode)
(define-key cmake-mode-map (kbd "C-c d") 'cmake-help))

(defun cmake-generate-compilation-database ()
  (interactive)
  (async-shell-command (concat "mkdir -p "
                               projectile-project-root
                               "/build;"
                               "cd "
                               projectile-project-root
                               "/build;"
                               "cmake -DCMAKE_EXPORT_COMPILE_COMMANDS=1 .. ;"
                               "make")
                       (concat "*CMake* - compile with database")))

(use-package cmake-ide
:ensure t )

(defun dash:download-javadoc-generator ()
(interactive)
(async-shell-command "cd ~/.emacs.d/bin; wget http://kapeli.com/javadocset.zip; unzip javadocset.zip; chmod a+x javadocset ")
)

(use-package helpful
  :ensure t
  :init
  ;; Note that the built-in `describe-function' includes both functions
  ;; and macros. `helpful-function' is functions only, so we provide
  ;; `helpful-callable' as a drop-in replacement.
  (global-set-key (kbd "C-h f") #'helpful-callable)

  (global-set-key (kbd "C-h v") #'helpful-variable)
  (global-set-key (kbd "C-h k") #'helpful-key)

  ;; Lookup the current symbol at point. C-c C-d is a common keybinding
;; for this in lisp modes.
(global-set-key (kbd "C-c C-d") #'helpful-at-point)

;; Look up *F*unctions (excludes macros).
;;
;; By default, C-h F is bound to `Info-goto-emacs-command-node'. Helpful
;; already links to the manual, if a function is referenced there.
(global-set-key (kbd "C-h F") #'helpful-function)

;; Look up *C*ommands.
;;
;; By default, C-h C is bound to describe `describe-coding-system'. I
;; don't find this very useful, but it's frequently useful to only
;; look at interactive functions.
(global-set-key (kbd "C-h C") #'helpful-command)
  )

(use-package helm-dash
:ensure t
)

(use-package company-quickhelp
:ensure t
:config
 (add-hook 'company-mode-hook #'company-quickhelp-mode)
)

(use-package lice
:ensure t)

(defun compile-doxymacs ()
  (interactive)
  (async-shell-command "git clone https://github.com/vxe/doxymacs-osx.git && cd doxymacs-osx && ./configure && make && sudo make install"))

(defun download-linux-manpages-by-kernel (kernel-version)
  (interactive "skernel version")
  (async-shell-command (concat
                        "mkdir -p ~/.emacs.d/var/man"
                        "cd ~/.emacs.d/var/man;"
                        "wget https://www.kernel.org/pub/linux/docs/man-pages/man-pages-" kernel-version".tar.gz; "
                        "tar xvf man-pages-" kernel-version".tar.gz;")
                       (concat "*woman* - downloading linux manpages"))
  (customize-variable 'woman-manpath))

(defun download-procps-manpages ()
  (interactive)
  (async-shell-command (concat
                        "mkdir -p ~/.emacs.d/var/man"
                        "cd ~/.emacs.d/var/man;"
                        "git clone https://gitlab.com/procps-ng/procps/ ;"
                        "cd procps;"
                        "mkdir -p man;"
                        "mv * man")
                       (concat "*woman* - downloading procps manpages"))
  (customize-variable 'woman-manpath))

(defun download-docker-manpages ()
  (interactive)
  (async-shell-command (concat
                        "mkdir -p ~/.emacs.d/var/man;"
                        "mkdir -p ~/.emacs.d/var/man/docker/man;"
                        "cd ~/.emacs.d/var/man/docker/man;"
                        "wget http://manpages.ubuntu.com/manpages.gz/xenial/man1/docker.1.gz ;"
                        "gunzip docker.1.gz;")
                       (concat "*woman* - downloading docker manpages"))
  (customize-variable 'woman-manpath))

(defun linux-syscall-man-lookup ()
  (interactive)
  (let ((syscall (completing-read "syscall:" linux-system-calls)))
    (woman syscall)))

(use-package isend-mode
:ensure t
)

(use-package flycheck
:ensure t)

(use-package flycheck-rtags
:ensure t)
