clasp/.emacs.d/etc/init.org
***** flycheck-rtags
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package flycheck-rtags
:ensure t)
#+END_SRC
**** realgud
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package realgud
:ensure t)
#+END_SRC

**** gdb
***** install
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun gdb:install ()
    (interactive)
    (async-shell-command (concat  "mkdir -p ~/.emacs.d/src;"
                                  "cd ~/.emacs.d/src;"
;                                  "rm -rf ~/.emacs.d/src/binutils-gdb.git;"
;                                  "git clone git://sourceware.org/git/binutils-gdb.git;"
                                  "cd ~/.emacs.d/src/binutils-gdb;"
                                  "./configure --prefix=$HOME/.emacs.d ;"
                                  "make && make install")
                         (concat "*gdb* - installing")))
#+END_SRC
*** Version Control
**** git-gitter
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package git-gutter
:ensure t)
#+END_SRC
*** Lisp
**** paredit
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package paredit
:ensure t)

#+END_SRC
**** rainbow delimeters
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package rainbow-delimiters
:ensure t)
#+END_SRC
**** lispy
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (use-package lispy
    :ensure t
    :init
    (require 'lispy)
    (define-key lispy-mode-map (kbd "C-j") 'paredit-newline)
    (define-key lispy-mode-map (kbd "[") 'paredit-open-square)
    (define-key lispy-mode-map (kbd "M-.") nil)
    (define-key lispy-mode-map (kbd ":") 'self-insert-command)
    )
#+END_SRC

*** Blub
**** smartparens
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (use-package smartparens
    :ensure t )
#+END_SRC
**** ycmd
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (use-package ycmd
    :ensure t
    :config
    (cond
     ((not (file-exists-p "~/.emacs.d/opt/ycmd/"))
      (shell-command (concat  "if [[ -d ~/.emacs.d/opt/ycmd ]]; then exit 0; else mkdir -p ~/.emacs.d/opt; cd ~/.emacs.d/opt; git clone https://github.com/Valloric/ycmd.git ; cd ycmd; git submodule update --init --recursive ; ./build.py --all ; fi")
                           (concat "*ycmd* - installing"))))

    (require 'ycmd-eldoc)
    (add-hook 'ycmd-mode-hook 'ycmd-eldoc-setup)
    (setq ycmd-server-command (list "python" (file-truename "~/.emacs.d/opt/ycmd/ycmd"))))


#+END_SRC
***** redownload ycmd
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(defun ycmd:redownload
(interactive)
(shell-command "rm -rf ~/.emacs.d/opt/ycmd")
(async-shell-command "if [[ -d ~/.emacs.d/opt/ycmd ]]; then exit 0; else mkdir -p ~/.emacs.d/opt; cd ~/.emacs.d/opt; git clone https://github.com/Valloric/ycmd.git ; cd ycmd; git submodule update --init --recursive ; ./build.py --all ; fi")
)
#+END_SRC
***** company-ycmd
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (use-package company-ycmd
  :ensure t
  :init
  (require 'company-ycmd)
  (company-ycmd-setup))
#+END_SRC
***** flycheck-ycmd
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (use-package flycheck-ycmd
    :ensure t
    :init
    (require 'flycheck-ycmd)
    (flycheck-ycmd-setup))
#+END_SRC
** Programming Languages
*** Emacs Lisp
**** dependencies
***** Environment
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
     (use-package elisp-slime-nav
     :ensure t
     ;; :init
     ;; (require 'elisp-slime-nav)
     ;; (dolist (hook '(emacs-lisp-mode-hook ielm-mode-hook))
     ;;   (add-hook hook 'elisp-slime-nav-mode))
     )





#+END_SRC
***** hooks
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el

  (add-hook 'ielm-mode-hook             #'enable-paredit-mode)
  (add-hook 'ielm-mode-hook             #'rainbow-delimiters-mode)
  (add-hook 'ielm-mode-hook             #'show-paren-mode)
  (add-hook 'ielm-mode-hook             #'eldoc-mode)
  (add-hook 'ielm-mode-hook             #'lispy-mode)
  (add-hook 'scheme-mode-hook             #'enable-paredit-mode)
  (add-hook 'emacs-lisp-mode-hook             #'show-paren-mode)


#+END_SRC
***** Syntactic Macros
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  ;;; clojure forms

  (defmacro ->> (&rest body)
    (let ((result (pop body)))
      (dolist (form body result)
        (setq result (append form (list result))))))

  (defmacro -> (&rest body)
    (let ((result (pop body)))
      (dolist (form body result)
        (setq result (append (list (car form) result)
                             (cdr form))))))

#+END_SRC
***** elisp-refs
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package elisp-refs
:ensure t
)
#+END_SRC
***** elisp 
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package elisp-def
:ensure t
:init
(dolist (hook '(emacs-lisp-mode-hook ielm-mode-hook))
  (add-hook hook #'elisp-def-mode))
)
#+END_SRC
***** enable yasnippet 
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(add-hook 'emacs-lisp-mode-hook #'yas-minor-mode)
#+END_SRC
***** enable lispy in .el files
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (add-hook 'emacs-lisp-mode-hook #'lispy-mode)
#+END_SRC
***** enable eldoc in all .el files
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (add-hook 'emacs-lisp-mode-hook #'eldoc-mode)
#+END_SRC
***** ht.el
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package ht
:ensure t)
#+END_SRC
***** s.el
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package s
:ensure t)
#+END_SRC
***** dash.el
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package dash
:ensure t)
#+END_SRC
***** trie.el
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  ;; (use-package trie
  ;; :ensure t
  ;; :init
  ;; (require 'trie)
  ;; )
#+END_SRC
***** heap.el
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package heap
:ensure t
:init
(require 'heap))
#+END_SRC
***** avl-tree
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package avl-tree
:ensure t
:init
(require 'avl-tree))
#+END_SRC
***** queue
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package queue
:ensure t)
#+END_SRC
*** Clojure
**** dependencies
***** clojure-mode
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (use-package clojure-mode
    :ensure t
    :init

    (add-hook 'clojure-mode-hook #'linum-mode)
    (add-hook 'clojure-mode-hook #'paredit-mode)
    (add-hook 'clojure-mode-hook #'rainbow-mode)
    (add-hook 'clojure-mode-hook #'lispy-mode)
    (add-hook 'clojure-mode-hook #'projectile-mode))


#+END_SRC
***** cider
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package cider
:ensure t
:init
(require 'cider)
(define-key cider-repl-mode-map (kbd "C-c b") 'cider-repl-clear-buffer)
)
#+END_SRC
***** clj-refactor
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (use-package clj-refactor
    :ensure t
    :init
    (require 'clj-refactor)

    (defun my-clojure-mode-hook ()
      (clj-refactor-mode 1)
      (yas-minor-mode 1) ; for adding require/use/import statements
      ;; This choice of keybinding leaves cider-macroexpand-1 unbound
      (cljr-add-keybindings-with-prefix "C-c C-m"))

    (add-hook 'clojure-mode-hook #'my-clojure-mode-hook))
#+END_SRC
***** clojars search
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package clojars
:ensure t)
#+END_SRC

***** setup local maven cache
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(shell-command "mkdir -p ~/.emacs.d/.m2")
#+END_SRC
***** cider connect wrapper
because the out of the box one doesn't seem to work

#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun vxe:cider-connect (host port)
    (interactive "shost: \nsport: ")
    (cider-connect host port))
#+END_SRC

****** plus clojurescript jack in 
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun vxe:cider-connect-clojurescript (host port)
    (interactive "shost: \nsport: ")
    (cider-connect host port)
    (cider-jack-in-clojurescript))
#+END_SRC

***** pretty lambdas
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (cond ((file-exists-p "~/.emacs.d/lib/clojure-pretty-lambda.el")
         (require 'clojure-pretty-lambda)
         ))
#+END_SRC
**** State
**** IO
*** Clojurescript
**** dependencies
    #+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
      (use-package inf-clojure
        :ensure t
        :init)

      (define-key clojurescript-mode-map (kbd "C-c C-k") nil)
      (define-key clojurescript-mode-map (kbd "C-c C-k") 'org-edit-src-abort)

    #+END_SRC
*** Common Lisp
**** dependencies
***** lisp-mode
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (add-hook 'lisp-mode-hook #'paredit-mode)
  (add-hook 'lisp-mode-hook #'lispy-mode)
  (add-hook 'lisp-mode-hook #'projectile-mode)
  (add-hook 'lisp-mode-hook #'enable-paredit-mode)
  (add-hook 'lisp-mode-hook #'rainbow-delimiters-mode)
  (add-hook 'lisp-mode-hook #'show-paren-mode)
  (add-hook 'lisp-mode-hook #'eldoc-mode)

#+END_SRC
***** slime
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  ;;   (use-package slime
  ;;     :ensure t
  ;;     :init
  ;;     (require 'slime)
  ;; ;    (require 'slime-asdf)
  ;; )

  (cond ((not (file-exists-p "~/.emacs.d/lib/slime"))
         (shell-command "cd ~/.emacs.d/lib; git clone https://github.com/slime/slime.git")))

  (add-to-list 'load-path "~/.emacs.d/lib/slime")
  (add-to-list 'load-path "~/.emacs.d/lib/slime/contrib")



    (use-package slime-docker
      :ensure t
      :init
  ;    (require 'slime-asdf)
  )


  (use-package ac-slime
  :ensure t
  :init
  (require 'slime-repl)
  (add-hook 'slime-mode-hook 'set-up-slime-ac)
  (add-hook 'slime-repl-mode-hook 'set-up-slime-ac)
  (add-hook 'slime-repl-mode-hook 'auto-complete-mode)
  (add-hook 'slime-repl-mode-hook 'enable-paredit-mode)
  (eval-after-load "auto-complete"
    '(add-to-list 'ac-modes 'slime-repl-mode)))

    #+END_SRC
