clasp/.emacs.d/init.el

(use-package realgud
:ensure t)

(defun gdb:install ()
    (interactive)
    (async-shell-command (concat  "mkdir -p ~/.emacs.d/src;"
                                  "cd ~/.emacs.d/src;"
;                                  "rm -rf ~/.emacs.d/src/binutils-gdb.git;"
;                                  "git clone git://sourceware.org/git/binutils-gdb.git;"
                                  "cd ~/.emacs.d/src/binutils-gdb;"
                                  "./configure --prefix=$HOME/.emacs.d ;"
                                  "make && make install")
                         (concat "*gdb* - installing")))

(use-package git-gutter
:ensure t)

(use-package paredit
:ensure t)

(use-package rainbow-delimiters
:ensure t)

(use-package lispy
  :ensure t
  :init
  (require 'lispy)
  (define-key lispy-mode-map (kbd "C-j") 'paredit-newline)
  (define-key lispy-mode-map (kbd "[") 'paredit-open-square)
  (define-key lispy-mode-map (kbd "M-.") nil)
  (define-key lispy-mode-map (kbd ":") 'self-insert-command)
  )

(use-package smartparens
  :ensure t )

(use-package ycmd
  :ensure t
  :config
  (cond
   ((not (file-exists-p "~/.emacs.d/opt/ycmd/"))
    (shell-command (concat  "if [[ -d ~/.emacs.d/opt/ycmd ]]; then exit 0; else mkdir -p ~/.emacs.d/opt; cd ~/.emacs.d/opt; git clone https://github.com/Valloric/ycmd.git ; cd ycmd; git submodule update --init --recursive ; ./build.py --all ; fi")
                         (concat "*ycmd* - installing"))))

  (require 'ycmd-eldoc)
  (add-hook 'ycmd-mode-hook 'ycmd-eldoc-setup)
  (setq ycmd-server-command (list "python" (file-truename "~/.emacs.d/opt/ycmd/ycmd"))))

(defun ycmd:redownload
(interactive)
(shell-command "rm -rf ~/.emacs.d/opt/ycmd")
(async-shell-command "if [[ -d ~/.emacs.d/opt/ycmd ]]; then exit 0; else mkdir -p ~/.emacs.d/opt; cd ~/.emacs.d/opt; git clone https://github.com/Valloric/ycmd.git ; cd ycmd; git submodule update --init --recursive ; ./build.py --all ; fi")
)

(use-package company-ycmd
:ensure t
:init
(require 'company-ycmd)
(company-ycmd-setup))

(use-package flycheck-ycmd
  :ensure t
  :init
  (require 'flycheck-ycmd)
  (flycheck-ycmd-setup))

(use-package elisp-slime-nav
:ensure t
;; :init
;; (require 'elisp-slime-nav)
;; (dolist (hook '(emacs-lisp-mode-hook ielm-mode-hook))
;;   (add-hook hook 'elisp-slime-nav-mode))
)

(add-hook 'ielm-mode-hook             #'enable-paredit-mode)
(add-hook 'ielm-mode-hook             #'rainbow-delimiters-mode)
(add-hook 'ielm-mode-hook             #'show-paren-mode)
(add-hook 'ielm-mode-hook             #'eldoc-mode)
(add-hook 'ielm-mode-hook             #'lispy-mode)
(add-hook 'scheme-mode-hook             #'enable-paredit-mode)
(add-hook 'emacs-lisp-mode-hook             #'show-paren-mode)

;;; clojure forms

(defmacro ->> (&rest body)
  (let ((result (pop body)))
    (dolist (form body result)
      (setq result (append form (list result))))))

(defmacro -> (&rest body)
  (let ((result (pop body)))
    (dolist (form body result)
      (setq result (append (list (car form) result)
                           (cdr form))))))

(use-package elisp-refs
:ensure t
)

(use-package elisp-def
:ensure t
:init
(dolist (hook '(emacs-lisp-mode-hook ielm-mode-hook))
  (add-hook hook #'elisp-def-mode))
)

(add-hook 'emacs-lisp-mode-hook #'yas-minor-mode)

(add-hook 'emacs-lisp-mode-hook #'lispy-mode)

(add-hook 'emacs-lisp-mode-hook #'eldoc-mode)

(use-package ht
:ensure t)

(use-package s
:ensure t)

(use-package dash
:ensure t)

;; (use-package trie
;; :ensure t
;; :init
;; (require 'trie)
;; )

(use-package heap
:ensure t
:init
(require 'heap))

(use-package avl-tree
:ensure t
:init
(require 'avl-tree))

(use-package queue
:ensure t)

(use-package clojure-mode
  :ensure t
  :init

  (add-hook 'clojure-mode-hook #'linum-mode)
  (add-hook 'clojure-mode-hook #'paredit-mode)
  (add-hook 'clojure-mode-hook #'rainbow-mode)
  (add-hook 'clojure-mode-hook #'lispy-mode)
  (add-hook 'clojure-mode-hook #'projectile-mode))

(use-package cider
:ensure t
:init
(require 'cider)
(define-key cider-repl-mode-map (kbd "C-c b") 'cider-repl-clear-buffer)
)

(use-package clj-refactor
  :ensure t
  :init
  (require 'clj-refactor)

  (defun my-clojure-mode-hook ()
    (clj-refactor-mode 1)
    (yas-minor-mode 1) ; for adding require/use/import statements
    ;; This choice of keybinding leaves cider-macroexpand-1 unbound
    (cljr-add-keybindings-with-prefix "C-c C-m"))

  (add-hook 'clojure-mode-hook #'my-clojure-mode-hook))

(use-package clojars
:ensure t)

(shell-command "mkdir -p ~/.emacs.d/.m2")

(defun vxe:cider-connect (host port)
  (interactive "shost: \nsport: ")
  (cider-connect host port))

(defun vxe:cider-connect-clojurescript (host port)
  (interactive "shost: \nsport: ")
  (cider-connect host port)
  (cider-jack-in-clojurescript))

(cond ((file-exists-p "~/.emacs.d/lib/clojure-pretty-lambda.el")
       (require 'clojure-pretty-lambda)
       ))

(use-package inf-clojure
  :ensure t
  :init)

(define-key clojurescript-mode-map (kbd "C-c C-k") nil)
(define-key clojurescript-mode-map (kbd "C-c C-k") 'org-edit-src-abort)

(add-hook 'lisp-mode-hook #'paredit-mode)
(add-hook 'lisp-mode-hook #'lispy-mode)
(add-hook 'lisp-mode-hook #'projectile-mode)
(add-hook 'lisp-mode-hook #'enable-paredit-mode)
(add-hook 'lisp-mode-hook #'rainbow-delimiters-mode)
(add-hook 'lisp-mode-hook #'show-paren-mode)
(add-hook 'lisp-mode-hook #'eldoc-mode)

;;   (use-package slime
;;     :ensure t
;;     :init
;;     (require 'slime)
;; ;    (require 'slime-asdf)
;; )

(cond ((not (file-exists-p "~/.emacs.d/lib/slime"))
       (shell-command "cd ~/.emacs.d/lib; git clone https://github.com/slime/slime.git")))

(add-to-list 'load-path "~/.emacs.d/lib/slime")
(add-to-list 'load-path "~/.emacs.d/lib/slime/contrib")



  (use-package slime-docker
    :ensure t
    :init
;    (require 'slime-asdf)
)


(use-package ac-slime
:ensure t
:init
(require 'slime-repl)
(add-hook 'slime-mode-hook 'set-up-slime-ac)
(add-hook 'slime-repl-mode-hook 'set-up-slime-ac)
(add-hook 'slime-repl-mode-hook 'auto-complete-mode)
(add-hook 'slime-repl-mode-hook 'enable-paredit-mode)
(eval-after-load "auto-complete"
  '(add-to-list 'ac-modes 'slime-repl-mode)))
