clasp/.emacs.d/etc/init.org
****** setup fancy repl
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (require 'slime-autoloads)
  (setq slime-contribs '(slime-fancy))
  ;; (slime-setup '(slime-fancy))
#+END_SRC
****** standard lisp repl packages
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (add-hook 'slime-repl-mode-hook #'paredit-mode)
  (add-hook 'slime-repl-mode-hook #'lispy-mode)
  (add-hook 'slime-repl-mode-hook #'projectile-mode)
  (add-hook 'slime-repl-mode-hook #'enable-paredit-mode)
  (add-hook 'slime-repl-mode-hook #'rainbow-delimiters-mode)
  (add-hook 'slime-repl-mode-hook #'show-paren-mode)
  (add-hook 'slime-repl-mode-hook #'eldoc-mode)
#+END_SRC

****** disable repl keybindings
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(define-key slime-repl-mode-map (kbd "C-x 5") 'vxe-wiki-search)
(define-key slime-repl-mode-map (kbd "C-x $") 'yas-new-snippet)
(define-key slime-repl-mode-map (kbd "C-x 4") 'vxe-helm-yas-complete)
(define-key slime-repl-mode-map (kbd "C-x %") 'yas-reload-all)
#+END_SRC
****** slime-company
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
    (use-package slime-company
      :ensure t)

#+END_SRC
***** install local version of ECL (embeddable common lisp)
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun vxe:download-ecl ()
    (interactive)
    (with-temp-buffer
      (cd "~/src")
      (async-shell-command "git clone https://gitlab.com/embeddable-common-lisp/ecl.git")))

  (defun vxe:redownload-ecl ()
    (interactive)
    (with-temp-buffer
      (cd "~/src")
      (async-shell-command "rm ~/src/ecl")
      (async-shell-command "git clone https://gitlab.com/embeddable-common-lisp/ecl.git")))

  (defun vxe:build-ecl ()
    (interactive)
    (with-temp-buffer
      (cd "~/src/ecl")
      (async-shell-command "./configure && make")))


#+END_SRC
***** clasp
****** install externals
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun clasp:install-externals ()
    (interactive)
    (async-shell-command (concat "mkdir -p ~/.emacs.d/opt;"
                                 "cd ~/.emacs.d/opt;"
                                 "git clone https://github.com/drmeister/externals-clasp;"
                                 "cd ~/.emacs.d/opt/externals-clasp;"
                                 "make"
                                 )
                         (concat "*Clasp* Installing Externals")))
#+END_SRC

*** Scheme
**** dependencies
***** geiser
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (use-package geiser
    :ensure t
    :init)
#+END_SRC
****** repl configuration
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (add-hook 'geiser-repl-mode-hook #'lispy-mode)
  (add-hook 'geiser-repl-mode-hook #'projectile-mode)
  (add-hook 'geiser-repl-mode-hook #'enable-paredit-mode)
  (add-hook 'geiser-repl-mode-hook #'rainbow-delimiters-mode)
  (add-hook 'geiser-repl-mode-hook #'show-paren-mode)
  (add-hook 'geiser-repl-mode-hook #'eldoc-mode)
#+END_SRC
***** scheme hook
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (add-hook 'scheme-mode-hook #'geiser-mode)
#+END_SRC
*** LFE
**** dependencies
***** install binary
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun lfe-install ()
    (interactive)
    (async-shell-command (concat "cd ~/.emacs.d/opt; git clone https://github.com/rvirding/lfe.git; cd lfe; make compile; sudo make install")
                         (concat "*lfe* building...")))
#+END_SRC
***** major mode
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (use-package lfe-mode
    :ensure t
    :init
    ;; repl config
    (require 'lfe-mode)
    (require 'inferior-lfe)
    (add-hook 'inferior-lfe-mode-hook #'smartparens-mode)
    (define-key inferior-lfe-mode-map (kbd "C-k") 'sp-kill-sexp))
#+END_SRC
***** enable paredit in source file
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (add-hook 'lfe-mode-hook #'enable-paredit-mode)
#+END_SRC
***** linum mode
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (add-hook 'lfe-mode-hook #'linum-mode)
#+END_SRC
***** ob-lfe
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  ;; (use-package ob-lfe
  ;; :ensure t )
#+END_SRC
*** Shell
**** dependencies
***** line numbers in script files
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (add-hook 'sh-mode-hook #'linum-mode)
  (add-hook 'shell-mode-hook #'goto-address-mode)
  (add-hook 'sh-mode-hook #'yas-minor-mode)
  (add-hook 'shell-mode-hook #'yas-minor-mode)
#+END_SRC
***** smartparents
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (add-hook 'sh-mode-hook #'smartparens-mode)
  (add-hook 'shell-mode-hook #'smartparens-mode)
#+END_SRC
*** C
**** dependencies
***** c coding styles
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
    (setq c-default-style "linux")
#+END_SRC
***** enable rtags in c buffers
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
   (when (require 'rtags nil :noerror)
            ;; make sure you have company-mode installed
            (require 'company)
            (define-key c-mode-map (kbd "M-.")
              (function rtags-find-symbol-at-point))
            (define-key c-mode-map (kbd "M-,")
              (function rtags-location-stack-back))

            ;; disable prelude's use of C-c r, as this is the rtags keyboard prefix
            ;; (define-key prelude-mode-map (kbd "C-c r") nil)
            ;; install standard rtags keybindings. Do M-. on the symbol below to
            ;; jump to definition and see the keybindings.
            (rtags-enable-standard-keybindings)
            ;; comment this out if you don't have or don't use helm
            (setq rtags-use-helm t)
            ;; company completion setup
            (setq rtags-autostart-diagnostics t)
            (rtags-diagnostics)
            (setq rtags-completions-enabled t)
            (push 'company-rtags company-backends)
                                        ;	  (global-company-mode)
            (define-key c-mode-base-map (kbd "<C-tab>") (function company-complete))
            ;; use rtags flycheck mode -- clang warnings shown inline
            (require 'flycheck-rtags)
            ;; c-mode-common-hook is also called by c++-mode
                                        ;	(add-hook 'c++-mode-hook #'setup-flycheck-rtags)
            )
#+END_SRC
***** disable rtags in c buffers
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun disable-rtags ()
    (interactive)
    (define-key c-mode-base-map (kbd "M-.") (function tags-find-symbol-at-point))
    (define-key c-mode-base-map (kbd "M-,") (function tags-find-references-at-point))
                                          ;(define-key c-mode-base-map (kbd "M-;") (function tags-find-file))
    (define-key c-mode-base-map (kbd "C-.") (function tags-find-symbol))
    (define-key c-mode-base-map (kbd "C-,") (function tags-find-references))
    (define-key c-mode-base-map (kbd "C-<") (function rtags-find-virtuals-at-point))
    (define-key c-mode-base-map (kbd "M-i") (function tags-imenu)))
#+END_SRC
***** enable yas
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(add-hook 'c-mode-hook #'yas-minor-mode)
#+END_SRC
***** linum mode
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (add-hook 'c-mode-hook #'linum-mode)
#+END_SRC
***** changes tab to 4 spaces
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(setq-default c-basic-offset 4)
#+END_SRC
***** Change the compile command to generate makefile if doesn't exist with correct parameters
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (require 'compile)
   (add-hook 'c-mode-hook
             (lambda ()
               (unless (file-exists-p "Makefile")
                 (set (make-local-variable 'compile-command)
                      ;; emulate make's .c.o implicit pattern rule, but with
                      ;; different defaults for the CC, CPPFLAGS, and CFLAGS
                      ;; variables:
                      ;; $(CC) -c -o $@ $(CPPFLAGS) $(CFLAGS) $<
                      (let ((file (file-name-nondirectory buffer-file-name)))
                        (format "%s -c -o %s.o %s %s %s"
                                (or (getenv "CC") "gcc")
                                (file-name-sans-extension file)
                                (or (getenv "CPPFLAGS") "-DDEBUG=9")
                                (or (getenv "CFLAGS") "-ansi -pedantic -Wall -g")
                                file))))))



#+END_SRC
***** Hide the compile window
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(defun recompile-quietly ()
  "Re-compile without changing the window configuration."
  (interactive)
  (save-window-excursion
    (recompile)))
#+END_SRC
*** Java
**** dependencies
***** hooks
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
 (add-hook 'java-mode-hook 'projectile-mode)
 (add-hook 'java-mode-hook 'linum-mode)
#+END_SRC
