clasp/.emacs.d/etc/init.org
****** java version
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun java:install-version (version)
    (interactive "sjava version")
    (with-temp-buffer
      (async-shell-command (concat
                            "mkdir -p ~/.emacs.d/opt/java"
                            "cd ~/.emacs.d/opt/java;"
                            "curl -L --header \"Cookie: s_nr=1359635827494; s_cc=true; gpw_e24=http%3A%2F%2Fwww.oracle.com%2Ftechnetwork%2Fjava%2Fjavase%2Fdownloads%2Fjdk6downloads-1902814.html; s_sq=%5B%5BB%5D%5D; gpv_p24=no%20value\" http://download.oracle.com/otn-pub/java/jdk/6u39-b04/jdk-"
                            version
                            "-linux-x64.tar.gz -o jdk-"
                            version
                            "-linux-x64.tar.gz")
                           (concat "*Java* - Downloading new version..."))))
#+END_SRC
****** javadoc-lookup
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package javadoc-lookup
:ensure t)
#+END_SRC

***** Maven
****** install
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(defun mvn:install-osx ()
(interactive)
(async-shell-command "brew install maven"))
#+END_SRC
****** search maven
     #+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
       (defun mvn:search-central (query)
	 (interactive "squery: ")
	 (async-shell-command (concat "~/.emacs.d/bin/search-maven.rb " query)))
     #+END_SRC
******* maven search script
      - original author: https://stackoverflow.com/questions/14465721/maven-browse-central-repository-via-command-line-client
      #+BEGIN_SRC ruby :tangle ~/.emacs.d/bin/search-maven.rb :tangle-mode (identity #o755)
#!/usr/bin/env ruby
      require 'httparty'

 query = ARGV[0]

 class MavenCentral
     include HTTParty
     base_uri 'search.maven.org'

     def initialize(query, rows=20)
         @options = { query: {rows: rows, wt: 'json', q: query} }
     end

     def artifacts
	self.class.get('/solrsearch/select', @options)
     end
 end

 maven_central = MavenCentral.new(query)
 maven_central.artifacts['response']['docs'].each do |doc|
     puts "#{doc['id']}:#{doc['latestVersion']}"
 end

      #+END_SRC
***** JDEE
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  ;; (use-package jdee
  ;; :ensure t
  ;; :init

  ;;   (defun vxe:download-jdee-server ()
  ;;   (interactive)
  ;; 	(with-temp-buffer
  ;;           (cd "~/.emacs.d/opt")
  ;;           (async-shell-command "git clone https://github.com/jdee-emacs/jdee-server.git")))



  ;;   (defun vxe:build-jdee-server ()
  ;;   (interactive)
  ;; 	(with-temp-buffer
  ;;         (cd "~/.emacs.d/opt/jdee-server")
  ;;         (async-shell-command "mvn -DskipTests=true assembly:assembly")
  ;;         (shell-command "cp target/jdee-bundle* ~/.emacs.d/bin")))

  ;; (setq jdee-server-dir "~/.emacs.d/bin")

  ;; )






#+END_SRC
***** Meghanada
****** install
btw this takes fucking forever to download the first time, install in a separat emacs
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (use-package meghanada
  :ensure t
  :init
  (require 'meghanada)
  (add-hook 'java-mode-hook
            (lambda ()
              ;; meghanada-mode on
              (meghanada-mode t)
              (setq c-basic-offset 2)
              ;; jump to defintion
              (define-key java-mode-map (kbd "M-,") 'meghanada-back-jump)
              ;; use code format
              (add-hook 'before-save-hook 'meghanada-code-beautify-before-save))))
#+END_SRC
******* for osx need a way to do use multiple java's or move back to virtual machine
***** lsp
****** lsp-java
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (use-package lsp-java
    :ensure t
    :init
    (require 'lsp-java)
    (add-hook 'java-mode-hook #'lsp-java-enable)
  )

  (use-package lsp-java
    :ensure t
    :init
    (require 'lsp-java)
    (require 'lsp-mode)
    (add-hook 'java-mode-hook #'lsp-java-enable)
    ;; (setq lsp-java--workspace-folders (list "/path/to/project1"
    ;;                                       "/path/to/project2"
    ;;                                       ...))
    )
#+END_SRC
****** company-lsp
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
    (use-package company-lsp
      :ensure t
      :init
      (require 'company-lsp)
      (push 'company-lsp company-backends))
#+END_SRC
***** ant
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun ant:compile-osx ()
    (interactive)
    (async-shell-command (concat "brew install ant")
                         (concat "*Ant* Install")))
#+END_SRC
***** jtags
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package jtags
:ensure t
)
#+END_SRC
***** java-repl
****** install
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun java-repl:install ()
    (interactive)
    (async-shell-command (concat "mkdir -p ~/.emacs.d/opt;"
                                 "cd ~/.emacs.d/opt;"
                                 "rm -rf ~/.emacs.d/opt/java-repl;"
                                 "git clone https://github.com/albertlatacz/java-repl.git;"
                                 "cd java-repl;"
                                 "gradle shadowJar;")
                         (concat "*Java-Repl* - installing")))
#+END_SRC
****** run 
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun java-repl:run ()
    (interactive)
    (async-shell-command (concat "cd ~/.emacs.d/opt/java-repl;"
                                 "java -jar build/libs/javarepl-dev.jar")
                         (concat "*JavaRepl* - running")))
#+END_SRC

*** C++
**** dependencies
