clasp/.emacs.d/init.el

(defun java:install-version (version)
  (interactive "sjava version")
  (with-temp-buffer
    (async-shell-command (concat
                          "mkdir -p ~/.emacs.d/opt/java"
                          "cd ~/.emacs.d/opt/java;"
                          "curl -L --header \"Cookie: s_nr=1359635827494; s_cc=true; gpw_e24=http%3A%2F%2Fwww.oracle.com%2Ftechnetwork%2Fjava%2Fjavase%2Fdownloads%2Fjdk6downloads-1902814.html; s_sq=%5B%5BB%5D%5D; gpv_p24=no%20value\" http://download.oracle.com/otn-pub/java/jdk/6u39-b04/jdk-"
                          version
                          "-linux-x64.tar.gz -o jdk-"
                          version
                          "-linux-x64.tar.gz")
                         (concat "*Java* - Downloading new version..."))))

(use-package javadoc-lookup
:ensure t)

(defun mvn:install-osx ()
(interactive)
(async-shell-command "brew install maven"))

(defun mvn:search-central (query)
(interactive "squery: ")
(async-shell-command (concat "~/.emacs.d/bin/search-maven.rb " query)))

;; (use-package jdee
;; :ensure t
;; :init

;;   (defun vxe:download-jdee-server ()
;;   (interactive)
;; 	(with-temp-buffer
;;           (cd "~/.emacs.d/opt")
;;           (async-shell-command "git clone https://github.com/jdee-emacs/jdee-server.git")))



;;   (defun vxe:build-jdee-server ()
;;   (interactive)
;; 	(with-temp-buffer
;;         (cd "~/.emacs.d/opt/jdee-server")
;;         (async-shell-command "mvn -DskipTests=true assembly:assembly")
;;         (shell-command "cp target/jdee-bundle* ~/.emacs.d/bin")))

;; (setq jdee-server-dir "~/.emacs.d/bin")

;; )

(use-package meghanada
:ensure t
:init
(require 'meghanada)
(add-hook 'java-mode-hook
          (lambda ()
            ;; meghanada-mode on
            (meghanada-mode t)
            (setq c-basic-offset 2)
            ;; jump to defintion
            (define-key java-mode-map (kbd "M-,") 'meghanada-back-jump)
            ;; use code format
            (add-hook 'before-save-hook 'meghanada-code-beautify-before-save))))

(use-package lsp-java
  :ensure t
  :init
  (require 'lsp-java)
  (add-hook 'java-mode-hook #'lsp-java-enable)
)

(use-package lsp-java
  :ensure t
  :init
  (require 'lsp-java)
  (require 'lsp-mode)
  (add-hook 'java-mode-hook #'lsp-java-enable)
  ;; (setq lsp-java--workspace-folders (list "/path/to/project1"
  ;;                                       "/path/to/project2"
  ;;                                       ...))
  )

(use-package company-lsp
  :ensure t
  :init
  (require 'company-lsp)
  (push 'company-lsp company-backends))

(defun ant:compile-osx ()
  (interactive)
  (async-shell-command (concat "brew install ant")
                       (concat "*Ant* Install")))

(use-package jtags
:ensure t
)

(defun java-repl:install ()
  (interactive)
  (async-shell-command (concat "mkdir -p ~/.emacs.d/opt;"
                               "cd ~/.emacs.d/opt;"
                               "rm -rf ~/.emacs.d/opt/java-repl;"
                               "git clone https://github.com/albertlatacz/java-repl.git;"
                               "cd java-repl;"
                               "gradle shadowJar;")
                       (concat "*Java-Repl* - installing")))

(defun java-repl:run ()
  (interactive)
  (async-shell-command (concat "cd ~/.emacs.d/opt/java-repl;"
                               "java -jar build/libs/javarepl-dev.jar")
                       (concat "*JavaRepl* - running")))
