clasp/.emacs.d/etc/init.org
***** rtags
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
          (use-package rtags
            :ensure t
            :init
            :config
            (define-key c-mode-base-map (kbd "<C-tab>") (function company-complete))

            (push 'company-rtags company-backends)
            (require 'flycheck-rtags)
            (setq rtags-display-result-backend 'helm)
            (cond ((file-exists-p "~/.emacs.d/opt/rtags")
                   (load-file "~/.emacs.d/opt/rtags/src/rtags.el")))

            ;; (cond
            ;;  ((not (file-exists-p "~/.emacs.d/opt/rtags/"))
            ;;   (async-shell-command "if [[ -d ~/.emacs.d/opt/rtags ]]; then exit 0; else mkdir -p ~/.emacs.d/opt; cd ~/.emacs.d/opt; git clone --recursive https://github.com/Andersbakken/rtags.git ; cd rtags ; cmake -DCMAKE_EXPORT_COMPILE_COMMANDS=1 . ; make; fi")))

            ;; (add-to-list 'load-path "~/.emacs.d/opt/rtags/src" t)
            (defun setup-flycheck-rtags ()
              (interactive)
              (flycheck-select-checker 'rtags)
              ;; RTags creates more accurate overlays.
              (setq-local flycheck-highlighting-mode nil)
              (setq-local flycheck-check-syntax-automatically nil))
            ;; only run this if rtags is installed


            ;; c++ config
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
            (when (require 'rtags nil :noerror)
              ;; make sure you have company-mode installed
              (require 'company)
              (define-key c++-mode-map (kbd "M-.")
                (function rtags-find-symbol-at-point))
              (define-key c++-mode-map (kbd "M-,")
                (function rtags-location-stack-back))

              ;; disable prelude's use of C-c r, as this is the rtags keyboard prefix
              ;; (define-key prelude-mode-map (kbd "C-c r") nil)
              ;; install standard rtags keybindings. Do M-. on the symbol below to
              ;; jump to definition and see the keybindings.
              (rtags-enable-standard-keybindings)
              ;; comment this out if you don't have or don't use helm
              (setq rtags-use-helm t)
              ;; company completion setup
              (setq rtags-autostart-diagnostics t)
              (rtags-diagnostics)
              (setq rtags-completions-enabled t)
              (push 'company-rtags company-backends)
                                          ;	  (global-company-mode)
              (define-key c-mode-base-map (kbd "<C-tab>") (function company-complete))
              ;; use rtags flycheck mode -- clang warnings shown inline
              (require 'flycheck-rtags)
              ;; c-mode-common-hook is also called by c++-mode
                                          ;	(add-hook 'c++-mode-hook #'setup-flycheck-rtags)

              ;; c config
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
              )

            (when (require 'rtags nil :noerror)
              ;; make sure you have company-mode installed
              (require 'company)
              (define-key c-mode-map (kbd "M-.")
                (function rtags-find-symbol-at-point))
              (define-key c-mode-map (kbd "M-,")
                (function rtags-location-stack-back))

              ;; disable prelude's use of C-c r, as this is the rtags keyboard prefix
              ;; (define-key prelude-mode-map (kbd "C-c r") nil)
              ;; install standard rtags keybindings. Do M-. on the symbol below to
              ;; jump to definition and see the keybindings.
              (rtags-enable-standard-keybindings)
              ;; comment this out if you don't have or don't use helm
              (setq rtags-use-helm t)
              ;; company completion setup
              (setq rtags-autostart-diagnostics t)
              (rtags-diagnostics)
              (setq rtags-completions-enabled t)
              (push 'company-rtags company-backends)
                                          ;	  (global-company-mode)
              (define-key c-mode-base-map (kbd "<C-tab>") (function company-complete))
              ;; use rtags flycheck mode -- clang warnings shown inline
              (require 'flycheck-rtags)
              ;; c-mode-common-hook is also called by c++-mode
                                          ;	(add-hook 'c++-mode-hook #'setup-flycheck-rtags)
              )



            )
#+END_SRC

****** company-rtags
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package company-rtags
:ensure t)
#+END_SRC
****** helm-rtags
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package helm-rtags
:ensure t)
#+END_SRC
****** helper functions
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun vxe:redownload-rtags ()
  (interactive)
  (with-temp-buffer
  (cd "~/.emacs.d/opt")
  (async-shell-command (concat
                        "rm -rf rtags;"
                        "git clone --recursive https://github.com/Andersbakken/rtags.git")
                       (concat "*RTags Install*"))))


  (defun vxe:rebuild-rtags ()
  (interactive)
  (with-temp-buffer
    (cd "~/.emacs.d/opt/rtags")
    (async-shell-command (concat
                          "cmake -DCMAKE_EXPORT_COMPILE_COMMANDS=1 .;"
                          "make;"
                          "sudo make install")
                         (concat "*RTags Compile*"))))


  (defun vxe:start-rtags-daemon ()
  (interactive)
  (with-temp-buffer
  (async-shell-command "~/.emacs.d/opt/rtags/bin/rdm &")
  ))

  (defun vxe:clear-rtags-cache ()
  (interactive)
  (async-shell-command "rm -rf ~/.cache/rtags")
  )

  (defun vxe:rtags-index-project ()
  (interactive)
  (with-temp-buffer
  (async-shell-command "rc -J .")))

#+END_SRC
****** fall back to built in source code taggers
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun use-rtags (&optional useFileManager)
    (and (rtags-executable-find "rc")
         (cond ((not (gtags-get-rootpath)) t)
               ((and (not (eq major-mode 'c++-mode))
                     (not (eq major-mode 'c-mode))) (rtags-has-filemanager))
               (useFileManager (rtags-has-filemanager))
               (t (rtags-is-indexed)))))

  (defun tags-find-symbol-at-point (&optional prefix)
    (interactive "P")
    (if (and (not (rtags-find-symbol-at-point prefix)) rtags-last-request-not-indexed)
        (gtags-find-tag)))
  (defun tags-find-references-at-point (&optional prefix)
    (interactive "P")
    (if (and (not (rtags-find-references-at-point prefix)) rtags-last-request-not-indexed)
        (gtags-find-rtag)))
  (defun tags-find-symbol ()
    (interactive)
    (call-interactively (if (use-rtags) 'rtags-find-symbol 'gtags-find-symbol)))
  (defun tags-find-references ()
    (interactive)
    (call-interactively (if (use-rtags) 'rtags-find-references 'gtags-find-rtag)))
  (defun tags-find-file ()
    (interactive)
    (call-interactively (if (use-rtags t) 'rtags-find-file 'gtags-find-file)))
  (defun tags-imenu ()
    (interactive)
    (call-interactively (if (use-rtags t) 'rtags-imenu 'idomenu)))

  ;; (define-key c-mode-base-map (kbd "M-.") (function tags-find-symbol-at-point))
  ;; (define-key c-mode-base-map (kbd "M-,") (function tags-find-references-at-point))
  ;; ;(define-key c-mode-base-map (kbd "M-;") (function tags-find-file))
  ;; (define-key c-mode-base-map (kbd "C-.") (function tags-find-symbol))
  ;; (define-key c-mode-base-map (kbd "C-,") (function tags-find-references))
  ;; (define-key c-mode-base-map (kbd "C-<") (function rtags-find-virtuals-at-point))
  ;; (define-key c-mode-base-map (kbd "M-i") (function tags-imenu))

  ;; (define-key global-map (kbd "M-.") (function tags-find-symbol-at-point))
  ;; (define-key global-map (kbd "M-,") (function tags-find-references-at-point))
  ;; ;(define-key global-map (kbd "M-;") (function tags-find-file))
  ;; (define-key global-map (kbd "C-.") (function tags-find-symbol))
  ;; (define-key global-map (kbd "C-,") (function tags-find-references))
  ;; (define-key global-map (kbd "C-<") (function rtags-find-virtuals-at-point))
  ;; (define-key global-map (kbd "M-i") (function tags-imenu))
#+END_SRC
***** ac-rtags
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package ac-rtags
:ensure t
)
#+END_SRC
***** flycheck-rtags
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package flycheck-rtags
:ensure t
)
#+END_SRC
