clasp/.emacs.d/etc/init.org
***** helm-rtags
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package helm-rtags
:ensure t
)
#+END_SRC
***** changes tab to 4 spaces
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(defun c++-mode-indent-hook ()
  (setq c-basic-offset 4)
  (c-set-offset 'substatement-open 0))
(add-hook 'c++-mode-hook 'c++-mode-indent-hook)
#+END_SRC
***** cpp-hook
#+BEGIN_SRC 
(add-hook 'c++-mode-hook 'flycheck-mode)
(add-hook 'c++-mode-hook 'linum-mode)
#+END_SRC
*** Golang
**** dependencies
***** pull down personal go repo
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  ;; (cond ((not (file-exists-p "~/go"))
  ;;        (shell-command (concat "cd ~/;"
  ;;                               "git clone https://github.com/vxe/.go.git go"))))
#+END_SRC
***** go-mode
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  ;(load-file "~/.emacs.d/site-lisp/go-autocomplete.el")
  (use-package go-mode
    :ensure t
    :init
                                      ;    (require 'go-mode)
    (when (memq window-system '(mac ns))
      (exec-path-from-shell-initialize)
      (exec-path-from-shell-copy-env "GOPATH"))

    ;; (cond
    ;;  ((not (file-exists-p "~/go/bin/gocode"))
    ;;   (setenv "GOPATH" (concat (getenv "HOME") "/go") )        
    ;;   (shell-command "go get  -u github.com/nsf/gocode")))




    :config
  (cond
   ((not (file-exists-p "~/.emacs.d/lib/company-go.el")) (shell-command "cd ~/.emacs.d/lib; wget https://raw.githubusercontent.com/nsf/gocode/master/emacs-company/company-go.el")))

    (setq gofmt-command "$HOME/go/bin/goimports")
    (defun vxe-go-mode-hook ()
      ;; https://gist.github.com/samertm/8bccfeb30c0902194de5
      ;; UPDATE: I commented the next line out because it isn't needed
      ;; with the gofmt-before-save hook above.
      ;; (local-set-key (kbd "C-c m") 'gofmt)
      (local-set-key (kbd "M-.") 'godef-jump)
      (local-set-key (kbd "M-,") 'pop-tag-mark)
      (local-set-key (kbd "C-x 5") 'vxe-helm-yas-complete)
      (set (make-local-variable 'company-backends) '(company-go))
      )






    ;; (add-hook 'before-save-hook 'gofmt-before-save)
    (add-hook 'go-mode-hook 'vxe-go-mode-hook)
    (add-hook 'go-mode-hook 'go-eldoc-setup)
    (add-hook 'go-mode-hook 'linum-mode)
    (add-hook 'go-mode-hook 'company-mode)


    (setq company-tooltip-limit 20)	; bigger popup window
    (setq company-idle-delay .3) ; decrease delay before autocompletion popup shows
    (setq company-echo-delay 0)  ; remove annoying blinking
    (setq company-begin-commands '(self-insert-command)) ; start autocompletion only after typing

    (require 'go-mode)
    (define-key go-mode-map (kbd "C-k") 'sp-kill-hybrid-sexp)
    (add-hook 'go-mode-hook #'smartparens-mode))
#+END_SRC
***** go-eldoc
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
    (use-package go-eldoc
    :ensure t
    :init)
#+END_SRC
***** go-dlv (delve/GUD)
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package go-dlv
:ensure t)
#+END_SRC
***** gore (repl)
****** install
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun gore-install ()
    (interactive)
    (async-shell-command (concat "go get -u github.com/motemen/gore")
                         (concat "*gore* - instaling")))
#+END_SRC
****** minor mode
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package gorepl-mode
:ensure t )
#+END_SRC
***** ob-go install
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun install-custom-ob-go ()
    (interactive)
    (shell-command (concat
                    "cd ~/.emacs.d/lib;"
                    "rm -rf ob-go;"
                    "git clone https://github.com/vxe/ob-go.git;"
                    ))
    (cond ((file-exists-p "~/.emacs.d/lib/ob-go")
           (add-to-list 'load-path "~/.emacs.d/lib/ob-go")
           (require 'ob-go))))
#+END_SRC
***** go get a package by name
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun go-get (package)
    (interactive "spackage: ")
    (async-shell-command (concat "go get -v -u "
                                 package
                                 )
                         (concat "*Go* - get: " package)))


#+END_SRC
*** Erlang
**** dependencies
***** major mode
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package erlang
:ensure t
:init
(exec-path-from-shell-copy-env "TERM") ;; run-lfe unless TERM is set to something other than https://github.com/rvirding/lfe/issues/156
)

#+END_SRC
***** edts
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (use-package edts
    :ensure t
    :init
    (require 'edts)
    (require 'edts-start)
    (define-key edts-mode-map (kbd "C-k") 'sp-kill-hybrid-sexp)
    (add-hook 'edts-mode-hook #'smartparens-mode)
    (add-hook 'edts-mode-hook #'auto-complete-mode)
    (add-hook 'edts-shell-mode-hook #'smartparens-mode)
    (add-hook 'edts-shell-mode-hook #'auto-complete-mode))
#+END_SRC
***** enable smartparens in repl
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (add-hook 'erlang-mode-hook #'smartparens-mode)
  (add-hook 'erlang-shell-mode-hook #'smartparens-mode)
#+END_SRC
***** enable line numbers
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (add-hook 'erlang-mode-hook #'linum-mode)
#+END_SRC
***** rebar3
****** install
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun rebar3:install ()
    (interactive)
    (async-shell-command (concat "cd ~/.emacs.d/bin; wget https://s3.amazonaws.com/rebar3/rebar3 && chmod +x rebar3")
                         (concat "*rebar3* - install")))
#+END_SRC
****** update
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun rebar3:update ()
    (interactive)
    (async-shell-command (concat "rebar3 update")
                         (concat "*rebar3* - updating")))
#+END_SRC
****** new project
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun rebar3:new-project (name)
    (interactive "sapp-name: ")
    (async-shell-command (concat "rebar3 new release " name)
                         (concat "*rebar3* - new app: " name)))

#+END_SRC
****** compile
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun rebar3:compile ()
    (interactive)
    (async-shell-command (concat "rebar3 compile")
                         (concat "*rebar3* - compile")))
#+END_SRC
*** Javascript
**** dependencies
***** npm
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun npm:install (package)
  (interactive "spackage: ")
  (async-shell-command (concat "npm install " package)
                       (concat "*npm* - installing: " package)))
#+END_SRC
****** npm install package globally
     #+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
       (defun npm:install-globally (package)
       (interactive "spackage: ")
       (async-shell-command (concat "npm install -g " package)
                            (concat "*npm* - installing - " package)))
     #+END_SRC
****** install yeoman
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(defun npm:install-yeoman ()
(interactive)
(async-shell-command "sudo npm install -g yo")
)
#+END_SRC
******* react fullstack geneator
I guess yeoman genearators are just project creation platforms
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(defun yo:install-react-fullstack ()
(interactive)
(async-shell-command "sudo npm install -g generator-react-fullstack")
)
#+END_SRC
***** nvm
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (use-package nvm
    :ensure t
    :init
    (defcustom vxe/node-version nil "Set node binary version"))
#+END_SRC
***** tern
****** installation
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun vxe:download-tern ()
  (interactive)
  (async-shell-command "cd ~/.emacs.d/lib; git clone https://github.com/ternjs/tern.git; cd tern; npm init"))

  (defun vxe:load-tern ()
    (interactive)
    (load-file "~/.emacs.d/lib/tern/emacs/tern.el")
    (load-file "~/.emacs.d/lib/tern/emacs/tern-auto-complete.el"))

  (if (file-exists-p "~/.emacs.d/lib/tern/emacs/tern.el")
      (vxe:load-tern)
    (progn
      (vxe:download-tern)
      (message "run (vxe:load-tern)")
      (kill-new "(vxe:load-tern)")))
#+END_SRC
****** kill server
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun tern-kill-server ()
    (interactive)
    (async-shell-command (concat "ps -eaf | grep '[t]ern' | awk '{print $2}' | xargs kill -9")
                         (concat "*tern* - killing server...")))
#+END_SRC
****** restart
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun tern-restart ()
    (interactive)
    (tern-kill-server)
    (tern-mode)
    (tern-mode))
#+END_SRC
****** set up auto-complete
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el

#+END_SRC
***** company-tern
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  ;; (use-package company-tern
  ;;   :ensure t
  ;;   :init
  ;;   (require 'company-tern)
  ;;   (add-to-list 'company-backends 'company-tern))
#+END_SRC
***** indium
requires emacs 25 and node.js > 8.0
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (use-package indium
  :ensure t)
#+END_SRC
****** enable smart parens in indium js repl
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (add-hook 'indium-repl-mode-hook #'smartparens-mode)
#+END_SRC
