clasp/.emacs.d/init.el

(defun c++-mode-indent-hook ()
  (setq c-basic-offset 4)
  (c-set-offset 'substatement-open 0))
(add-hook 'c++-mode-hook 'c++-mode-indent-hook)

;; (cond ((not (file-exists-p "~/go"))
;;        (shell-command (concat "cd ~/;"
;;                               "git clone https://github.com/vxe/.go.git go"))))

;(load-file "~/.emacs.d/site-lisp/go-autocomplete.el")
(use-package go-mode
  :ensure t
  :init
                                    ;    (require 'go-mode)
  (when (memq window-system '(mac ns))
    (exec-path-from-shell-initialize)
    (exec-path-from-shell-copy-env "GOPATH"))

  ;; (cond
  ;;  ((not (file-exists-p "~/go/bin/gocode"))
  ;;   (setenv "GOPATH" (concat (getenv "HOME") "/go") )        
  ;;   (shell-command "go get  -u github.com/nsf/gocode")))




  :config
(cond
 ((not (file-exists-p "~/.emacs.d/lib/company-go.el")) (shell-command "cd ~/.emacs.d/lib; wget https://raw.githubusercontent.com/nsf/gocode/master/emacs-company/company-go.el")))

  (setq gofmt-command "$HOME/go/bin/goimports")
  (defun vxe-go-mode-hook ()
    ;; https://gist.github.com/samertm/8bccfeb30c0902194de5
    ;; UPDATE: I commented the next line out because it isn't needed
    ;; with the gofmt-before-save hook above.
    ;; (local-set-key (kbd "C-c m") 'gofmt)
    (local-set-key (kbd "M-.") 'godef-jump)
    (local-set-key (kbd "M-,") 'pop-tag-mark)
    (local-set-key (kbd "C-x 5") 'vxe-helm-yas-complete)
    (set (make-local-variable 'company-backends) '(company-go))
    )






  ;; (add-hook 'before-save-hook 'gofmt-before-save)
  (add-hook 'go-mode-hook 'vxe-go-mode-hook)
  (add-hook 'go-mode-hook 'go-eldoc-setup)
  (add-hook 'go-mode-hook 'linum-mode)
  (add-hook 'go-mode-hook 'company-mode)


  (setq company-tooltip-limit 20)	; bigger popup window
  (setq company-idle-delay .3) ; decrease delay before autocompletion popup shows
  (setq company-echo-delay 0)  ; remove annoying blinking
  (setq company-begin-commands '(self-insert-command)) ; start autocompletion only after typing

  (require 'go-mode)
  (define-key go-mode-map (kbd "C-k") 'sp-kill-hybrid-sexp)
  (add-hook 'go-mode-hook #'smartparens-mode))

(use-package go-eldoc
:ensure t
:init)

(use-package go-dlv
:ensure t)

(defun gore-install ()
  (interactive)
  (async-shell-command (concat "go get -u github.com/motemen/gore")
                       (concat "*gore* - instaling")))

(use-package gorepl-mode
:ensure t )

(defun install-custom-ob-go ()
  (interactive)
  (shell-command (concat
                  "cd ~/.emacs.d/lib;"
                  "rm -rf ob-go;"
                  "git clone https://github.com/vxe/ob-go.git;"
                  ))
  (cond ((file-exists-p "~/.emacs.d/lib/ob-go")
         (add-to-list 'load-path "~/.emacs.d/lib/ob-go")
         (require 'ob-go))))

(defun go-get (package)
  (interactive "spackage: ")
  (async-shell-command (concat "go get -v -u "
                               package
                               )
                       (concat "*Go* - get: " package)))

(use-package erlang
:ensure t
:init
(exec-path-from-shell-copy-env "TERM") ;; run-lfe unless TERM is set to something other than https://github.com/rvirding/lfe/issues/156
)

(use-package edts
  :ensure t
  :init
  (require 'edts)
  (require 'edts-start)
  (define-key edts-mode-map (kbd "C-k") 'sp-kill-hybrid-sexp)
  (add-hook 'edts-mode-hook #'smartparens-mode)
  (add-hook 'edts-mode-hook #'auto-complete-mode)
  (add-hook 'edts-shell-mode-hook #'smartparens-mode)
  (add-hook 'edts-shell-mode-hook #'auto-complete-mode))

(add-hook 'erlang-mode-hook #'smartparens-mode)
(add-hook 'erlang-shell-mode-hook #'smartparens-mode)

(add-hook 'erlang-mode-hook #'linum-mode)

(defun rebar3:install ()
  (interactive)
  (async-shell-command (concat "cd ~/.emacs.d/bin; wget https://s3.amazonaws.com/rebar3/rebar3 && chmod +x rebar3")
                       (concat "*rebar3* - install")))

(defun rebar3:update ()
  (interactive)
  (async-shell-command (concat "rebar3 update")
                       (concat "*rebar3* - updating")))

(defun rebar3:new-project (name)
  (interactive "sapp-name: ")
  (async-shell-command (concat "rebar3 new release " name)
                       (concat "*rebar3* - new app: " name)))

(defun rebar3:compile ()
  (interactive)
  (async-shell-command (concat "rebar3 compile")
                       (concat "*rebar3* - compile")))

(defun npm:install (package)
(interactive "spackage: ")
(async-shell-command (concat "npm install " package)
                     (concat "*npm* - installing: " package)))

(defun npm:install-globally (package)
(interactive "spackage: ")
(async-shell-command (concat "npm install -g " package)
                     (concat "*npm* - installing - " package)))

(defun npm:install-yeoman ()
(interactive)
(async-shell-command "sudo npm install -g yo")
)

(defun yo:install-react-fullstack ()
(interactive)
(async-shell-command "sudo npm install -g generator-react-fullstack")
)

(use-package nvm
  :ensure t
  :init
  (defcustom vxe/node-version nil "Set node binary version"))

(defun vxe:download-tern ()
(interactive)
(async-shell-command "cd ~/.emacs.d/lib; git clone https://github.com/ternjs/tern.git; cd tern; npm init"))

(defun vxe:load-tern ()
  (interactive)
  (load-file "~/.emacs.d/lib/tern/emacs/tern.el")
  (load-file "~/.emacs.d/lib/tern/emacs/tern-auto-complete.el"))

(if (file-exists-p "~/.emacs.d/lib/tern/emacs/tern.el")
    (vxe:load-tern)
  (progn
    (vxe:download-tern)
    (message "run (vxe:load-tern)")
    (kill-new "(vxe:load-tern)")))

(defun tern-kill-server ()
  (interactive)
  (async-shell-command (concat "ps -eaf | grep '[t]ern' | awk '{print $2}' | xargs kill -9")
                       (concat "*tern* - killing server...")))

(defun tern-restart ()
  (interactive)
  (tern-kill-server)
  (tern-mode)
  (tern-mode))



;; (use-package company-tern
;;   :ensure t
;;   :init
;;   (require 'company-tern)
;;   (add-to-list 'company-backends 'company-tern))

(use-package indium
:ensure t)

(add-hook 'indium-repl-mode-hook #'smartparens-mode)
