clasp/.emacs.d/init.el

(use-package nodejs-repl
:ensure t
:init
(add-hook 'js-mode-hook
        (lambda ()
          (define-key js-mode-map (kbd "C-x C-e") 'nodejs-repl-send-last-expression)
          (define-key js-mode-map (kbd "C-c C-j") 'nodejs-repl-send-line)
          (define-key js-mode-map (kbd "C-c C-c") 'nodejs-repl-send-buffer)
          (define-key js-mode-map (kbd "C-c C-r") 'nodejs-repl-send-region)
          (define-key js-mode-map (kbd "C-c C-l") 'nodejs-repl-load-file)
          (define-key js-mode-map (kbd "C-c C-z") 'nodejs-repl-switch-to-repl))))

(use-package skewer-mode
:ensure t )

(add-to-list 'auto-mode-alist '("\\.js\\'" . js2-mode))

(add-hook 'js2-mode-hook (lambda ()
                           (tern-mode)
                           (tern-ac-setup)
                           (auto-complete-mode)
                           (smartparens-mode)
                           (linum-mode)
                                        ;(sp-use-smartparens-bindings)
                           (indium-interaction-mode)))

(define-key js2-mode-map (kbd "C-k") 'sp-kill-hybrid-sexp)

(add-to-list 'semantic-inhibit-functions
             (lambda () (member major-mode '(js2-mode))))

(defun react:install-locally ()
  (interactive)
  (async-shell-command (concat "npm init;"
                               "npm install --save react react-dom")
                       (concat "*react* installing")))

(defun react:install-babel-locally ()
  (interactive)
  (async-shell-command (concat "npm init;"
                               "npm install --save-dev babel-core")
                       (concat "*react* installing babel")))

(defun react:install-build-tool ()
    (interactive)
    (npm:install-globally "create-react-app"))

(defun react:new-app (name)
  (interactive "sname")
  (async-shell-command (concat "create-react-app "
                               name)
                       (concat "*react* - creating project - " name))
  (find-file name))

(defun react:build-app ()
  (interactive)
  (async-shell-command (concat "npm run build"
                               (concat "*react* - building project - "))))

(define-skeleton babel:preset-skeleton
  "dat babel init"
  nil
  "{ \n"
  "  \"presets\" : [\"env\",\"react\"]  \n"
  "\n"
  "}")

(defun babel:generate-babelrc ()
  (interactive)
  (save-excursion
    ;;
    (progn
      (find-file ".babelrc")
      (insert (babelrc-skeleton)))))

(define-skeleton react:index-js-skeleton
  "a basic react index.html" nil
  "import React from 'react';\n"
  "import ReactDOM from 'react-dom';\n"
  "\n"
  "ReactDOM.render(\n"
  " <h1>Hello, world!</h1>, \n"
  "document.getElementById('root')\n"
  ");")

  (defun react:generate-index-js ()
    (interactive)
    (save-excursion
      ;;
      (progn
        (shell-command "mkdir -p ./index.js"
        (find-file "./src/index.htm")
        (insert (react:html-index-html-skeleton))))))

(define-skeleton react:html-index-html-skeleton
  "an example index.html for start a react project"
  "<!DOCTYPE html> \n"
  "<html> \n"
  " <head> \n"
  " <meta charset=\"UTF-8\"> \n"
  " <title>" _ "</title> \n"
  " </head> \n"
  "<body>\n"
  "<div id=\"root\"></div>\n"
  " </body> \n"
  "</html>"
  "\n"
  '(indent-region (point-min) (point-max)))

  (defun react:generate-index-html ()
    (interactive)
    (save-excursion
      ;;
      (progn
        (shell-command "mkdir -p ./public"
        (find-file "./public/index.html")
        (insert (react:html-index-html-skeleton))))))

(defun re-natal:install ()
  (interactive)
  (npm:install-globally "re-natal"))

(defun re-natal:new-app (app-name)
  (interactive "sapp-name")
  (async-shell-command (concat "re-natal init " app-name)
                       (concat "*re-natal* - creating new app: " app-name)))

(setq tern-config
      (json-ht-read "{\"plugins\": {\"node\": {},\"es_modules\": {}}}"))

(defun pip:install-in-virtualenv (package)
(interactive "spackage: ")
(async-shell-command (concat "cd ~/.emacs.d/var; virtualenv " package "; source ~/.emacs.d/var/" package "/bin/activate; pip install --upgrade pip; pip install " package) (concat "*pip install*" " - " package))

)

(defun pip3:install-in-virtualenv (package)
(interactive "spackage: ")
(async-shell-command (concat "cd ~/.emacs.d/var; python3 -m venv " package "; source ~/.emacs.d/var/" package "/bin/activate; pip3 install --upgrade pip; pip3 install " package)))

(defun pip:install (package)
(interactive "spackage: ")
(async-shell-command (concat "pip install --upgrade pip; pip install " package)))

(defun pip:install-in-virtualenv (package)
  (interactive "spackage: ")
  (let ((virtualenv (completing-read "env:" (split-string
                                             (s-chomp "find ~/.emacs.d/var -maxdepth 1 -type d -print0 | xargs -0 basename | grep -Ev '^#|^[.]'")
                                           "\n"))))
    (async-shell-command (concat "source ~/.emacs.d/var/" virtualenv "/bin/activate; pip install --upgrade pip; pip install " package))))

(defun pip:install-in-current-virtualenv (package)
  (interactive "spackage: ")
  (if (eq nil venv-current-name)
      (progn
        (message "no venv selected, choose one and call this function again")
        (venv-workon))
    (async-shell-command (concat
                          "source ~/.emacs.d/var/" venv-current-name "/bin/activate;"
                          "pip install --upgrade pip;"
                          "pip install " package)
                         (concat "*pip install* - " package))))

;; (defun pip3:install-in-current-virtualenv (package)
;;   (interactive "spackage: ")
;;   (let ((virtualenv (completing-read "env:" (split-string
;;                                            (s-chomp "find ~/.emacs.d/var -maxdepth 1 -type d -print0 | xargs -0 basename | grep -Ev '^#|^[.]'")
;;                                            "\n"))))
;;     (async-shell-command (concat "source ~/.emacs.d/var/" virtualenv "/bin/activate; pip3 install --upgrade pip; pip3 install " package))))

(defun python:create-virtualenv (name)
  (interactive "svirtualenv name: ")
  (async-shell-command (concat "cd ~/.emacs.d/var/ ; virtualenv "
                               name
                               "; cd ~/.emacs.d/var/"
                               name
                               "/bin; chmod a+x activate; ./activate; pip install --upgrade pip; cd ~/.python.d; pip install -r requirements.txt")
                       (concat "*Python* - creating virtualenv - " name))
  (geeknote:install-in-venv))

(defun python-install-bidict ()
(interactive)
(pip:install-in-virtualenv "bidict")
)
