clasp/.emacs.d/etc/init.org
***** Pydoc
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package pydoc
:ensure t)

(use-package pydoc-info
:ensure t)
#+END_SRC
****** helm-pydoc
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package helm-pydoc
:ensure t)
#+END_SRC
******* helm-pydoc-at-point
un merged PR in upstream, remove if/when merged
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(defun helm-pydoc-at-point ()
  (interactive)
  (let ((symbol
	 (if (region-active-p)
	     (buffer-substring (region-beginning) (region-end))
	   (current-word))))
    (helm :sources '(helm-pydoc--imported-source helm-pydoc--installed-source)
	  :buffer "*helm pydoc*" :history 'helm-pydoc--history :input symbol)))
#+END_SRC

***** enable linum mode
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(add-hook 'python-mode-hook 'linum-mode)
#+END_SRC
***** virtualenvwrapper
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (use-package virtualenvwrapper
  :ensure t
  :init
  (require 'virtualenvwrapper)
  (venv-initialize-interactive-shells) ;; if you want interactive shell support
  (venv-initialize-eshell) ;; if you want eshell support
  ;; note that setting `venv-location` is not necessary if you
  ;; use the default location (`~/.virtualenvs`), or if the
  ;; the environment variable `WORKON_HOME` points to the right place
  (shell-command "mkdir -p ~/.emacs.d/var")
  (setq venv-location "~/.emacs.d/var")
  (if (file-exists-p "~/.emacs.d/var/emacs/")
      (progn
        (venv-workon "emacs")
        (pythonic-activate "~/.emacs.d/var/emacs"))))
#+END_SRC
****** create virtualenv to known python binary
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun virtualenv:create-specify-python-path (name path)
  (interactive "svirtualenc name: \nfpython path")
  (async-shell-command (concat "cd ~/.emacs.d/var; virtualenv --python=" path " " name)))
#+END_SRC
****** create a python 2.7.13 virtualenv in osx
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(defun virtualenv:create-2-7-13-osx (name)
(interactive "svirtualenv name: ")
(async-shell-command (concat "cd ~/.emacs.d/var; virtualenv --python=/usr/local/Cellar/python/2.7.13/bin/python " name))
)
#+END_SRC
****** create python 3.5.2 virtual env
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(defun virtualenv:create-python3 (name)
(interactive "sname: ")
(async-shell-command (concat "cd ~/.emacs.d/var; /usr/local/Cellar/python3/3.5.2/bin/pip3 --upgrade pip ; /usr/local/Cellar/python3/3.5.2/bin/python3 -m venv " name)))
#+END_SRC

***** anaconda-mode

       mainly for jump to definition and completion
       #+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
          (use-package anaconda-mode
          :ensure t
          :init
          (require 'anaconda-mode)
          (add-hook 'python-mode-hook 'anaconda-mode)
         (define-key anaconda-mode-map (kbd "M-,") nil)
          (define-key anaconda-mode-map (kbd "M-*") nil)
          (define-key anaconda-mode-map (kbd "M-,") 'anaconda-mode-go-back)
          (define-key anaconda-mode-map (kbd "M-*") 'anaconda-find-assignments))

             (use-package company-anaconda
             :ensure t
             :init
             (eval-after-load "company"
                 '(add-to-list 'company-backends 'company-anaconda)))
       #+END_SRC
***** inferior python mode
****** helm-pydoc-at-point
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el

(define-key inferior-python-mode-map (kbd "C-c C-k") 'helm-pydoc-at-point)
#+END_SRC
****** run help on the current function/object
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el

(defun python-describe-symbol ()
  (interactive)
  (fset 'python-help
   (lambda (&optional arg) "Keyboard macro." (interactive "p") (kmacro-exec-ring-item (quote ("help(\346\342" 0 "%d")) arg)))
  (python-help))
#+END_SRC
******* keybinding
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(define-key inferior-python-mode-map (kbd "C-c C-d") 'nil)
(define-key inferior-python-mode-map (kbd "C-c C-d") 'python-describe-symbol)
#+END_SRC
****** fix weird indentation bug
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
     ;; (add-hook 'inferior-python-mode-hook
     ;;   (lambda ()
     ;;     (setq
     ;;       indent-tabs-mode nil ;; i.e. indent with spaces
     ;;       tab-width 4          ;; i.e. tabs consts of 4 spaces
     ;;       )))


  (defun send-input-and-indent ()
    (interactive)
    (comint-send-input)
    (indent-for-tab-command))

  (define-key inferior-python-mode-map (kbd "C-j") 'send-input-and-indent)

#+END_SRC
****** smartparents
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(add-hook 'inferior-python-mode-hook #'smartparens-mode)
#+END_SRC
****** enable anaconda mode
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (add-hook 'inferior-python-mode-hook #'anaconda-mode)
#+END_SRC
***** scimax-modules
****** org-babbel async python code blocks
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el

  (defun scimax:install-python-org-babel-extensions ()
    (interactive)
    (shell-command "cd ~/.emacs.d/lib; wget 'https://raw.githubusercontent.com/jkitchin/scimax/master/scimax-org-babel-python.el'"))
#+END_SRC
******* if its not there download it
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  ;; (cond ((not (file-exists-p "~/.emacs.d/site-lisp/scimax-org-babel-python.el"))
  ;;               (scimax:install-python-org-babel-extensions)))
#+END_SRC
******* load it
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  ;; (load-file "~/.emacs.d/site-lisp/scimax-org-babel-python.el")
#+END_SRC
******* add to the control-c control-c hook
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  ;; (add-to-list 'org-ctrl-c-ctrl-c-hook 'org-babel-async-execute:python)
#+END_SRC
***** Jupyter
****** EIN install
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package ein
:ensure t
:init
(setq ein:use-auto-complete t)
)
#+END_SRC
****** start jupyter server
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(defun jupyter:start-notebook-server ()
(interactive)
(async-shell-command "jupyter notebook")
)
#+END_SRC
****** open jupyter notebook
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun jupyter:open-notebook (path)
    (interactive "D notebook location: ")
    (with-temp-buffer
      (cd path)
      (jupyter:start-notebook-server)))
#+END_SRC
***** traad
****** install
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package traad
:ensure t
:init
(require 'traad)
  (add-hook 'python-mode-hook
          (lambda ()
            (define-key python-mode-map (kbd "C-c r") 'traad-rename))))


#+END_SRC
***** elpy
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package elpy
:ensure t
:init
(require 'elpy))
#+END_SRC
*** Ruby
**** dependencies
***** robe
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (use-package robe
    :ensure t
    :init
    (add-hook 'robe-mode-hook 'ac-robe-setup))
#+END_SRC
***** inf-ruby
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (use-package inf-ruby
    :ensure t
:init
    (add-hook 'inf-ruby-mode-hook 'robe-mode)
    (add-hook 'inf-ruby-mode-hook 'ac-robe-setup))
#+END_SRC
***** enh-ruby-mode
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (use-package enh-ruby-mode
    :ensure t
    :init
    (add-hook 'enh-ruby-mode-hook 'robe-mode)
    (add-hook 'enh-ruby-mode-hook 'auto-complete-mode)
    (add-hook 'enh-ruby-mode-hook 'ac-robe-setup)
    (add-hook 'enh-ruby-mode-hook 'smartparens-mode)
    (add-hook 'enh-ruby-mode-hook 'rainbow-mode)
    (add-hook 'enh-ruby-mode-hook 'yard-mode)
    (add-to-list 'auto-mode-alist
               '("\\(?:\\.rb\\|ru\\|rake\\|thor\\|jbuilder\\|gemspec\\|podspec\\|/\\(?:Gem\\|Rake\\|Cap\\|Thor\\|Vagrant\\|Guard\\|Pod\\)file\\)\\'" . enh-ruby-mode))
    )
#+END_SRC
***** if directory doesn't exist, go download it
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (cond ((not (file-exists-p "~/.emacs.d/lib/ob-go"))
         (install-custom-ob-go)))
#+END_SRC
*** Perl
**** dependencies
***** cpan
****** installation
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun cpan:install-local::lib ()
  (interactive)
  (async-shell-command  (concat "curl -L http://cpanmin.us | perl - App::cpanminus; cpanm --local-lib=~/.emacs.d/perl5 local::lib && eval $(perl -I ~/.emacs.d/perl5/lib/perl5/ -Mlocal::lib)")
                        (conct "*cpan* installing local::lib")))
#+END_SRC

#+RESULTS:
: cpan:install-local::lib

****** utilities
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun cpan:install-package (name)
  (interactive "spackage: ")
  (async-shell-command (concat "cpanm --local-lib=~/.emacs.d/perl5 local::lib && eval $(perl -I ~/.emacs.d/perl5/lib/perl5/ -Mlocal::lib); curl -L http://cpanmin.us | perl - " name)
                       (concat "*cpan* - installing: " name)))


#+END_SRC

*** R
**** dependencies
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package ess
:ensure t
:init
(add-hook 'inferior-ess-mode-hook 'smartparens-mode))
#+END_SRC
*** misc
**** Prolog
***** ediprolog
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package ediprolog
:ensure t)
#+END_SRC
***** ob-prolog
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package ob-prolog
:ensure t)
#+END_SRC
***** inferior prolog config
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(add-hook 'inferior-prolog-mode-hook #'smartparens-mode)
#+END_SRC
**** groovy
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
    (use-package groovy-mode
      :ensure t
      :init
      (require 'groovy-mode)
      (define-key groovy-mode-map (kbd "C-k") 'sp-kill-hybrid-sexp)
      (add-hook 'groovy-mode-hook #'smartparens-mode))
#+END_SRC

***** linum mode
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(add-hook 'groovy-mode-hook #'linum-mode)
#+END_SRC

