clasp/.emacs.d/init.el

(use-package pydoc
:ensure t)

(use-package pydoc-info
:ensure t)

(use-package helm-pydoc
:ensure t)

(defun helm-pydoc-at-point ()
  (interactive)
  (let ((symbol
	 (if (region-active-p)
	     (buffer-substring (region-beginning) (region-end))
	   (current-word))))
    (helm :sources '(helm-pydoc--imported-source helm-pydoc--installed-source)
	  :buffer "*helm pydoc*" :history 'helm-pydoc--history :input symbol)))

(add-hook 'python-mode-hook 'linum-mode)

(use-package virtualenvwrapper
:ensure t
:init
(require 'virtualenvwrapper)
(venv-initialize-interactive-shells) ;; if you want interactive shell support
(venv-initialize-eshell) ;; if you want eshell support
;; note that setting `venv-location` is not necessary if you
;; use the default location (`~/.virtualenvs`), or if the
;; the environment variable `WORKON_HOME` points to the right place
(shell-command "mkdir -p ~/.emacs.d/var")
(setq venv-location "~/.emacs.d/var")
(if (file-exists-p "~/.emacs.d/var/emacs/")
    (progn
      (venv-workon "emacs")
      (pythonic-activate "~/.emacs.d/var/emacs"))))

(defun virtualenv:create-specify-python-path (name path)
(interactive "svirtualenc name: \nfpython path")
(async-shell-command (concat "cd ~/.emacs.d/var; virtualenv --python=" path " " name)))

(defun virtualenv:create-2-7-13-osx (name)
(interactive "svirtualenv name: ")
(async-shell-command (concat "cd ~/.emacs.d/var; virtualenv --python=/usr/local/Cellar/python/2.7.13/bin/python " name))
)

(defun virtualenv:create-python3 (name)
(interactive "sname: ")
(async-shell-command (concat "cd ~/.emacs.d/var; /usr/local/Cellar/python3/3.5.2/bin/pip3 --upgrade pip ; /usr/local/Cellar/python3/3.5.2/bin/python3 -m venv " name)))

(use-package anaconda-mode
 :ensure t
 :init
 (require 'anaconda-mode)
 (add-hook 'python-mode-hook 'anaconda-mode)
(define-key anaconda-mode-map (kbd "M-,") nil)
 (define-key anaconda-mode-map (kbd "M-*") nil)
 (define-key anaconda-mode-map (kbd "M-,") 'anaconda-mode-go-back)
 (define-key anaconda-mode-map (kbd "M-*") 'anaconda-find-assignments))

    (use-package company-anaconda
    :ensure t
    :init
    (eval-after-load "company"
        '(add-to-list 'company-backends 'company-anaconda)))

(define-key inferior-python-mode-map (kbd "C-c C-k") 'helm-pydoc-at-point)

(defun python-describe-symbol ()
  (interactive)
  (fset 'python-help
   (lambda (&optional arg) "Keyboard macro." (interactive "p") (kmacro-exec-ring-item (quote ("help(\346\342" 0 "%d")) arg)))
  (python-help))

(define-key inferior-python-mode-map (kbd "C-c C-d") 'nil)
(define-key inferior-python-mode-map (kbd "C-c C-d") 'python-describe-symbol)

;; (add-hook 'inferior-python-mode-hook
   ;;   (lambda ()
   ;;     (setq
   ;;       indent-tabs-mode nil ;; i.e. indent with spaces
   ;;       tab-width 4          ;; i.e. tabs consts of 4 spaces
   ;;       )))


(defun send-input-and-indent ()
  (interactive)
  (comint-send-input)
  (indent-for-tab-command))

(define-key inferior-python-mode-map (kbd "C-j") 'send-input-and-indent)

(add-hook 'inferior-python-mode-hook #'smartparens-mode)

(add-hook 'inferior-python-mode-hook #'anaconda-mode)

(defun scimax:install-python-org-babel-extensions ()
  (interactive)
  (shell-command "cd ~/.emacs.d/lib; wget 'https://raw.githubusercontent.com/jkitchin/scimax/master/scimax-org-babel-python.el'"))

;; (cond ((not (file-exists-p "~/.emacs.d/site-lisp/scimax-org-babel-python.el"))
;;               (scimax:install-python-org-babel-extensions)))

;; (load-file "~/.emacs.d/site-lisp/scimax-org-babel-python.el")

;; (add-to-list 'org-ctrl-c-ctrl-c-hook 'org-babel-async-execute:python)

(use-package ein
:ensure t
:init
(setq ein:use-auto-complete t)
)

(defun jupyter:start-notebook-server ()
(interactive)
(async-shell-command "jupyter notebook")
)

(defun jupyter:open-notebook (path)
  (interactive "D notebook location: ")
  (with-temp-buffer
    (cd path)
    (jupyter:start-notebook-server)))

(use-package traad
:ensure t
:init
(require 'traad)
  (add-hook 'python-mode-hook
          (lambda ()
            (define-key python-mode-map (kbd "C-c r") 'traad-rename))))

(use-package elpy
:ensure t
:init
(require 'elpy))

(use-package robe
  :ensure t
  :init
  (add-hook 'robe-mode-hook 'ac-robe-setup))

(use-package inf-ruby
    :ensure t
:init
    (add-hook 'inf-ruby-mode-hook 'robe-mode)
    (add-hook 'inf-ruby-mode-hook 'ac-robe-setup))

(use-package enh-ruby-mode
  :ensure t
  :init
  (add-hook 'enh-ruby-mode-hook 'robe-mode)
  (add-hook 'enh-ruby-mode-hook 'auto-complete-mode)
  (add-hook 'enh-ruby-mode-hook 'ac-robe-setup)
  (add-hook 'enh-ruby-mode-hook 'smartparens-mode)
  (add-hook 'enh-ruby-mode-hook 'rainbow-mode)
  (add-hook 'enh-ruby-mode-hook 'yard-mode)
  (add-to-list 'auto-mode-alist
             '("\\(?:\\.rb\\|ru\\|rake\\|thor\\|jbuilder\\|gemspec\\|podspec\\|/\\(?:Gem\\|Rake\\|Cap\\|Thor\\|Vagrant\\|Guard\\|Pod\\)file\\)\\'" . enh-ruby-mode))
  )

(cond ((not (file-exists-p "~/.emacs.d/lib/ob-go"))
       (install-custom-ob-go)))

(defun cpan:install-local::lib ()
(interactive)
(async-shell-command  (concat "curl -L http://cpanmin.us | perl - App::cpanminus; cpanm --local-lib=~/.emacs.d/perl5 local::lib && eval $(perl -I ~/.emacs.d/perl5/lib/perl5/ -Mlocal::lib)")
                      (conct "*cpan* installing local::lib")))

(defun cpan:install-package (name)
(interactive "spackage: ")
(async-shell-command (concat "cpanm --local-lib=~/.emacs.d/perl5 local::lib && eval $(perl -I ~/.emacs.d/perl5/lib/perl5/ -Mlocal::lib); curl -L http://cpanmin.us | perl - " name)
                     (concat "*cpan* - installing: " name)))

(use-package ess
:ensure t
:init
(add-hook 'inferior-ess-mode-hook 'smartparens-mode))

(use-package ediprolog
:ensure t)

(use-package ob-prolog
:ensure t)

(add-hook 'inferior-prolog-mode-hook #'smartparens-mode)

(use-package groovy-mode
  :ensure t
  :init
  (require 'groovy-mode)
  (define-key groovy-mode-map (kbd "C-k") 'sp-kill-hybrid-sexp)
  (add-hook 'groovy-mode-hook #'smartparens-mode))

(add-hook 'groovy-mode-hook #'linum-mode)
