clasp/.emacs.d/etc/init.org
**** (m)mix
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
    (use-package mixal-mode
    :ensure t
    :init
    (setq vxe-mdk-version "1.2.9")
    :config
    (defun vxe-download-mdk ()
      (interactive)
      (cond
       ((not (file-exists-p (concat "~/.emacs.d/opt/mdk-" vxe-mdk-version))) (async-shell-command (concat "cd ~/.emacs.d/opt ; wget https://mirrors.ocf.berkeley.edu/gnu/mdk/v" vxe-mdk-version "/mdk-" vxe-mdk-version ".tar.gz; tar xvf mdk-" vxe-mdk-version ".tar.gz ; rm -rf *.gz; mv ~/.emacs.d/opt/mdk-" vxe-mdk-version " ~/.emacs.d/opt/mdk" )))))
    )

#+END_SRC

***** cpp hooks
** Markup
*** LaTex
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package tex
  :defer t
  :ensure auctex
  :config
  (setq TeX-auto-save t))
#+END_SRC

*** BibTex
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (use-package helm-bibtex
    :ensure t
    :init
    (setq bibtex-completion-bibliography
          '("~/Documents/bibtex/master.bib"))
    (setq bibtex-completion-library-path '("~/Dropbox/pdfs"))
    ;;Bibtex-completion assumes that the name of a PDF consists of the
    ;; BibTeX key followed plus a user-defined suffix (.pdf by default).
    ;; For example, if a BibTeX entry has the key Darwin1859,
    ;; bibtex-completion searches for Darwin1859.pdf.
    )
#+END_SRC
**** org-ref
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (use-package org-ref
    :ensure t)
#+END_SRC

*** Markdown
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (use-package markdown-mode
    :ensure t
    :commands (markdown-mode gfm-mode)
    :mode (("README\\.md\\'" . gfm-mode)
           ("\\.md\\'" . markdown-mode)
           ("\\.markdown\\'" . markdown-mode))
    :init
    (require 'markdown-mode)
    (setq markdown-command "~/.emacs.d/bin/flavor.rb")
    (add-hook 'markdown-mode-hook #'flyspell-mode)
    (add-hook 'markdown-mode-hook #'auto-fill-mode)
    (define-key markdown-mode-map (kbd "C-c C-c") 'server-edit))



#+END_SRC

*** HTML
**** tagedit - paredit for html
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package tagedit
:ensure t
)
#+END_SRC

***** enable paredit keybindings and tag auto close
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(eval-after-load 'sgml-mode
  '(progn
     (require 'tagedit)
     (tagedit-add-paredit-like-keybindings)
     (tagedit-add-experimental-features)
     (add-hook 'sgml-mode-hook (lambda () (tagedit-mode 1)))))
#+END_SRC

**** emmet - tag snippets
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package tagedit
:ensure t)
#+END_SRC

***** enable in sgml mode only
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(add-hook 'sgml-mode-hook #'emmet-mode)
#+END_SRC

**** install html5-tidy
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun download-html5-tidy ()
    (interactive)
    (shell-command "cd ~/.emacs.d/opt; git clone https://github.com/htacg/tidy-html5.git"))

  (defun build-html5-tidy ()
    (interactive)
    (async-shell-command "cd ~/.emacs.d/opt/tidy-html5/build/cmake; cmake ../.. -DCMAKE_BUILD_TYPE=Release -DCMAKE_EXPORT_COMPILE_COMMANDS=1 && make && sudo make install"))
#+END_SRC

***** keybinding for running tidy validation
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(define-key sgml-mode-map (kbd "C-c C-v") 'sgml-validate)
#+END_SRC
**** elnode - serve html from current working director
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package elnode
:ensure t
)
#+END_SRC
**** new html5 boilerplate project
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun init-h5bp-project-cwd ()
    (interactive)
    (async-shell-command "mv index.html index.html.orig;wget https://github.com/h5bp/html5-boilerplate/releases/download/5.3.0/html5-boilerplate_v5.3.0.zip -O out.zip; unzip out.zip"))
#+END_SRC
**** install html5 boilerplate in reagent project
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun init-h5bp-project-in-project ()
    (interactive)
    (async-shell-command "cd ./resources/public;mv index.html index.html.orig;wget https://github.com/h5bp/html5-boilerplate/releases/download/5.3.0/html5-boilerplate_v5.3.0.zip -O out.zip; unzip out.zip; rm index.html; mv index.html.orig index.html"))
#+END_SRC
**** enable sgml mode for html
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(add-hook 'html-mode-hook #'sgml-mode)
#+END_SRC
**** open .html files in sgml move
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
   (add-to-list 'auto-mode-alist '("\\.html\\'" . sgml-mode))
#+END_SRC
*** CSS
**** emmet
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package emmet-mode
:ensure t)
#+END_SRC
***** enable emmet
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(add-hook 'css-mode-hook #'emmet-mode)
#+END_SRC

**** rainbow mode
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package rainbow-mode
:ensure t
:init
(add-hook 'css-mode-hook #'rainbow-mode)
)
#+END_SRC
**** smartparens 
**** State
***** smartparens
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(add-hook 'css-mode-hook #'smartparens-mode)
(define-key css-mode-map (kbd "C-k") 'sp-kill-hybrid-sexp)
#+END_SRC
*** erb
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package web-mode
:ensure t
:init
(require 'web-mode)
(add-to-list 'auto-mode-alist '("\\.erb\\'" . web-mode)))
#+END_SRC
** Data Formats
*** JSON
**** json mode
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (use-package json-mode
    :ensure t
    :init
    (require 'json-mode)
    (setq jsons-path-printer 'jsons-print-path-jq)
    ;; json
    (define-key json-mode-map (kbd "C-k") 'sp-kill-hybrid-sexp)
    (add-hook 'json-mode-hook #'smartparens-mode)
    (add-hook 'json-mode-hook #'linum-mode)
    )

#+END_SRC
***** add selected path to kill ring
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(defun json-mode-path-kill ()
  (interactive)
    (kill-new (jsons-print-path)))

(define-key json-mode-map (kbd "C-c P") 'json-mode-path-kill)
#+END_SRC
**** flymake
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (use-package flymake-json
  :ensure t
  :init
  (add-hook 'json-mode 'flymake-json-load))
#+END_SRC
**** parsong
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(defun parson:install ()
(interactive)
    (async-shell-command (concat
                          "cd ~/.emacs.d/lib;"
                          "git clone https://github.com/syohex/emacs-parson.git;"
                          "cd emacs-parson;"
                          "make;"
                          )
                         (concat "*parson* install")))

  (cond ((file-exists-p "~/.emacs.d/lib/emacs-parson")
         (add-to-list 'load-path "~/.emacs.d/lib/emacs-parson/")
         (require 'parson)))

#+END_SRC

*** csv
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package csv
:ensure t)
#+END_SRC
*** yaml
**** yaml minor mode
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package yaml-mode
:ensure t)
#+END_SRC
**** install
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun yaml:install-libyaml ()
    (interactive)
    (async-shell-command (concat
                          "cd ~/.emacs.d/lib;"
                          "git clone https://github.com/syohex/emacs-libyaml.git;"
                          "cd emacs-libyaml;"
                          "make;"
                          )
                         (concat "*libyaml* install")))
#+END_SRC
**** load
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (cond ((file-exists-p "~/.emacs.d/lib/emacs-libyaml")
         (add-to-list 'load-path "~/.emacs.d/lib/emacs-libyaml/")
         (require 'libyaml)))

#+END_SRC
*** xml
*** html
**** install html5 boilerplate in current project
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun install-h5bp ()
           (interactive)
           (async-shell-command (concat "mkdir -p tmp; cd tmp;"
                                        "wget https://github.com/h5bp/html5-boilerplate/releases/download/6.0.1/html5-boilerplate_v6.0.1.zip -O html5bp.tar.gz;"
                                        "tar xvf html5bp.tar.gz;"
                                        "rsync -avz --exclude '*.html' ./ .."
                                        )
                                (concat "*h5bp* - installing")))
#+END_SRC
*** edn
**** syntax highlighting
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (use-package edn
    :ensure t)
#+END_SRC

