clasp/.emacs.d/init.el

(use-package mixal-mode
:ensure t
:init
(setq vxe-mdk-version "1.2.9")
:config
(defun vxe-download-mdk ()
  (interactive)
  (cond
   ((not (file-exists-p (concat "~/.emacs.d/opt/mdk-" vxe-mdk-version))) (async-shell-command (concat "cd ~/.emacs.d/opt ; wget https://mirrors.ocf.berkeley.edu/gnu/mdk/v" vxe-mdk-version "/mdk-" vxe-mdk-version ".tar.gz; tar xvf mdk-" vxe-mdk-version ".tar.gz ; rm -rf *.gz; mv ~/.emacs.d/opt/mdk-" vxe-mdk-version " ~/.emacs.d/opt/mdk" )))))
)

(use-package tex
  :defer t
  :ensure auctex
  :config
  (setq TeX-auto-save t))

(use-package helm-bibtex
  :ensure t
  :init
  (setq bibtex-completion-bibliography
        '("~/Documents/bibtex/master.bib"))
  (setq bibtex-completion-library-path '("~/Dropbox/pdfs"))
  ;;Bibtex-completion assumes that the name of a PDF consists of the
  ;; BibTeX key followed plus a user-defined suffix (.pdf by default).
  ;; For example, if a BibTeX entry has the key Darwin1859,
  ;; bibtex-completion searches for Darwin1859.pdf.
  )

(use-package org-ref
  :ensure t)

(use-package markdown-mode
  :ensure t
  :commands (markdown-mode gfm-mode)
  :mode (("README\\.md\\'" . gfm-mode)
         ("\\.md\\'" . markdown-mode)
         ("\\.markdown\\'" . markdown-mode))
  :init
  (require 'markdown-mode)
  (setq markdown-command "~/.emacs.d/bin/flavor.rb")
  (add-hook 'markdown-mode-hook #'flyspell-mode)
  (add-hook 'markdown-mode-hook #'auto-fill-mode)
  (define-key markdown-mode-map (kbd "C-c C-c") 'server-edit))

(use-package tagedit
:ensure t
)

(eval-after-load 'sgml-mode
  '(progn
     (require 'tagedit)
     (tagedit-add-paredit-like-keybindings)
     (tagedit-add-experimental-features)
     (add-hook 'sgml-mode-hook (lambda () (tagedit-mode 1)))))

(use-package tagedit
:ensure t)

(add-hook 'sgml-mode-hook #'emmet-mode)

(defun download-html5-tidy ()
  (interactive)
  (shell-command "cd ~/.emacs.d/opt; git clone https://github.com/htacg/tidy-html5.git"))

(defun build-html5-tidy ()
  (interactive)
  (async-shell-command "cd ~/.emacs.d/opt/tidy-html5/build/cmake; cmake ../.. -DCMAKE_BUILD_TYPE=Release -DCMAKE_EXPORT_COMPILE_COMMANDS=1 && make && sudo make install"))

(define-key sgml-mode-map (kbd "C-c C-v") 'sgml-validate)

(use-package elnode
:ensure t
)

(defun init-h5bp-project-cwd ()
  (interactive)
  (async-shell-command "mv index.html index.html.orig;wget https://github.com/h5bp/html5-boilerplate/releases/download/5.3.0/html5-boilerplate_v5.3.0.zip -O out.zip; unzip out.zip"))

(defun init-h5bp-project-in-project ()
  (interactive)
  (async-shell-command "cd ./resources/public;mv index.html index.html.orig;wget https://github.com/h5bp/html5-boilerplate/releases/download/5.3.0/html5-boilerplate_v5.3.0.zip -O out.zip; unzip out.zip; rm index.html; mv index.html.orig index.html"))

(add-hook 'html-mode-hook #'sgml-mode)

(add-to-list 'auto-mode-alist '("\\.html\\'" . sgml-mode))

(use-package emmet-mode
:ensure t)

(add-hook 'css-mode-hook #'emmet-mode)

(use-package rainbow-mode
:ensure t
:init
(add-hook 'css-mode-hook #'rainbow-mode)
)

(add-hook 'css-mode-hook #'smartparens-mode)
(define-key css-mode-map (kbd "C-k") 'sp-kill-hybrid-sexp)

(use-package web-mode
:ensure t
:init
(require 'web-mode)
(add-to-list 'auto-mode-alist '("\\.erb\\'" . web-mode)))

(use-package json-mode
  :ensure t
  :init
  (require 'json-mode)
  (setq jsons-path-printer 'jsons-print-path-jq)
  ;; json
  (define-key json-mode-map (kbd "C-k") 'sp-kill-hybrid-sexp)
  (add-hook 'json-mode-hook #'smartparens-mode)
  (add-hook 'json-mode-hook #'linum-mode)
  )

(defun json-mode-path-kill ()
  (interactive)
    (kill-new (jsons-print-path)))

(define-key json-mode-map (kbd "C-c P") 'json-mode-path-kill)

(use-package flymake-json
:ensure t
:init
(add-hook 'json-mode 'flymake-json-load))

(defun parson:install ()
(interactive)
    (async-shell-command (concat
                          "cd ~/.emacs.d/lib;"
                          "git clone https://github.com/syohex/emacs-parson.git;"
                          "cd emacs-parson;"
                          "make;"
                          )
                         (concat "*parson* install")))

  (cond ((file-exists-p "~/.emacs.d/lib/emacs-parson")
         (add-to-list 'load-path "~/.emacs.d/lib/emacs-parson/")
         (require 'parson)))

(use-package csv
:ensure t)

(use-package yaml-mode
:ensure t)

(defun yaml:install-libyaml ()
  (interactive)
  (async-shell-command (concat
                        "cd ~/.emacs.d/lib;"
                        "git clone https://github.com/syohex/emacs-libyaml.git;"
                        "cd emacs-libyaml;"
                        "make;"
                        )
                       (concat "*libyaml* install")))

(cond ((file-exists-p "~/.emacs.d/lib/emacs-libyaml")
       (add-to-list 'load-path "~/.emacs.d/lib/emacs-libyaml/")
       (require 'libyaml)))

(defun install-h5bp ()
         (interactive)
         (async-shell-command (concat "mkdir -p tmp; cd tmp;"
                                      "wget https://github.com/h5bp/html5-boilerplate/releases/download/6.0.1/html5-boilerplate_v6.0.1.zip -O html5bp.tar.gz;"
                                      "tar xvf html5bp.tar.gz;"
                                      "rsync -avz --exclude '*.html' ./ .."
                                      )
                              (concat "*h5bp* - installing")))

(use-package edn
  :ensure t)
