clasp/.emacs.d/init.el

(keyboard-translate ?\C-q ?\C-x)
          (global-set-key (kbd "C-t") 'quoted-insert)
          (global-set-key (kbd "C-c") nil) ; hack to get rid non prefix errors
          (global-set-key (kbd "C-x x") 'helm-M-x)
          (global-set-key (kbd "C-x C-x") 'helm-M-x)
          (global-set-key (kbd "C-o") 'ace-window)
          (global-set-key (kbd "M-[") 'winner-undo)
          ;; (global-set-key (kbd "C-x 2") 'vxe-split-window-below)
          ;; (global-set-key (kbd "C-x 3") 'vxe-split-window-right)
;

                                                  ;(global-set-key (kbd "C-x C-[") 'winner-undo)

          (global-set-key (kbd "M-]") 'winner-redo)
                                                  ;(global-set-key (kbd "C-x C-]") 'winner-redo)
          (global-set-key (kbd "C-c v") 'org-capture)
          (global-set-key (kbd "C-c ]") 'org-remove-file)
          (global-set-key (kbd "C-c 9") 'vxe:nm-edit-queries)
          (global-set-key (kbd "C-c j") 'notmuch-company)
          (global-set-key (kbd "C-x 5") 'vxe-helm-yas-complete)
          (global-set-key (kbd "C-c k") 'yas-expand)
          (global-set-key (kbd "C-x 6") 'vxe-term-generic-ssh)
        ;  (global-set-key (kbd "C-x 6") 'vxe-search-projects)

          (global-set-key (kbd "C-)") 'paredit-forward-barf-sexp)
          (global-set-key (kbd "M-0") 'paredit-forward-barf-sexp)
          (global-set-key (kbd "M-9") 'paredit-backward-barf-sexp)
          (global-set-key (kbd "M-P") 'paredit-splice-sexp)
          (global-set-key (kbd "M-r") 'forward-whitespace)

          (global-set-key (kbd "M-;") 'comment-dwim)

          (global-set-key (kbd "C-x /") 'hydra-apps/body)
          (global-set-key (kbd "C-x C-/") 'hydra-apps/body)

          (global-set-key (kbd "C-x p") 'vxe-mt-shell-here)
          (global-set-key (kbd "C-x C-p") 'vxe-mt-shell-here)
          (global-set-key (kbd "C-x <f7>") 'isend-associate)

          (define-key org-mode-map (kbd "C-c C-w") 'org-refile)
  ;       
          (define-key org-mode-map (kbd "C-c C-w") 'org-refile)

          (define-key org-mode-map (kbd "C-x i") 'org-insert-link)
          (global-set-key (kbd "M-RET") 'org-meta-return)
          ;; (define-key org-mode-map (kbd "M-RET") 'org-insert-heading-respect-content)

          (define-key company-active-map (kbd "C-n") 'company-select-next-or-abort)
          (define-key company-active-map (kbd "C-p") 'company-select-previous-or-abort)


          (global-set-key (kbd "C-x g g") 'magit-status)
          (global-set-key (kbd "C-x v '") 'magit-diff)
          (global-set-key (kbd "C-x v i") 'magit-init)
          (global-set-key (kbd "C-x v b") 'magit-branch-and-checkout)
          (global-set-key (kbd "C-x v C") 'vc-rollback)
          (global-set-key (kbd "C-x v V") 'magit-checkout)
          (global-set-key (kbd "C-x v v") 'magit-stage-file)
          (global-set-key (kbd "C-x v c") 'magit-commit-popup)
          (global-set-key (kbd "C-x v p") 'magit-push-popup)
          (global-set-key (kbd "C-x v M") 'vc-merge)
          (global-set-key (kbd "C-x v m") 'magit-merge-popup)
          (global-set-key (kbd "C-x v f") 'magit-fetch-popup)
          (global-set-key (kbd "C-x v S") 'vc-create-tag)
          (global-set-key (kbd "C-x v s") 'magit-stash-popup)
          (global-set-key (kbd "C-x v R") 'vc-retrieve-tag)
          (global-set-key (kbd "C-x v r") 'magit-rebase-popup)

          (global-set-key (kbd "C-x m") 'notmuch-mua-new-mail)
          (global-set-key (kbd "C-x b") 'bookmark-jump)
          (global-set-key (kbd "C-c x") 'hydra-gtd/body)
          (global-set-key (kbd "C-c g") 'hydra-agenda/body)
    ;      (global-set-key (kbd "C-c g") 'org-todo-list)
          (global-set-key (kbd "C-c C-g") 'org-todo-list)
          (global-set-key (kbd "C-c Q") 'org-set-tags)
          (global-set-key (kbd "C-c G") 'org-todo)
          (global-set-key (kbd "M-y") 'helm-show-kill-ring)
          (global-set-key (kbd "M-o") 'vxe-shell-on-region)
          (define-key lispy-mode-map (kbd "M-o") 'nil)
          (define-key clojure-mode-map (kbd "M-o") 'vxe-shell-on-region)
          (global-set-key (kbd "C-x $") 'yas-new-snippet)
          (global-set-key (kbd "C-x b") 'bookmark-jump)
          (global-set-key (kbd "C-x 7") 'replace-regexp)


          ;(global-set-key (kbd "C-r") 'helm-swoop-without-pre-input)
          (global-set-key (kbd "C-S-R") 'helm-swoop)
          (global-set-key (kbd "C-S-s") 'helm-org-rifle-current-buffer)
          ;(global-set-key (kbd "C-s") 'helm-swoop-without-pre-input)
          (global-set-key (kbd "C-c G") 'org-tags-view)
        (global-set-key (kbd "C-c y") 'org-store-link)
        (global-set-key (kbd "M-O") 'revert-buffer)
        (global-set-key (kbd "C-c u") 'undo-tree-mode)
        (global-set-key (kbd "C-x \(") (lambda ()
                                         (interactive)
                                         (vxe-nm-inbox)))
        (global-set-key (kbd "<f5>") (lambda ()
                                       (interactive)
                                       (setq-local compilation-read-command nil)
                                       (call-interactively 'compile)))

        (global-set-key (kbd "M-+") 'text-scale-increase)
        (global-set-key (kbd "M-_") 'text-scale-decrease)
        ;(global-set-key (kbd "C-c C-r C-r") 'sre-radar-open-gui)
        (global-set-key (kbd "C-c C-r") 'sre-radar-open-gui)
        (global-set-key (kbd "C-x 9") 'sre-radar-open-gui)
        (global-set-key (kbd "C-c R") 'vxe:open-url)
        (global-set-key (kbd "C-c i") 'isend)
        (global-set-key (kbd "M-g p") 'vxe-search-projects)
        (global-set-key (kbd "M-g P") 'vxe-search-project-files)
        (global-set-key (kbd "C-x %") 'yas-reload-all)
        (global-set-key (kbd "C-M-w") 'ibuffer)
    ;    (global-set-key (kbd "C-c A") 'hydra-appt/body)
        (global-set-key (kbd "C-c a") 'calendar)
        (global-set-key (kbd "C-c A") 'org-agenda)
        (global-set-key (kbd "M-RET") 'org-meta-return)
        (global-set-key (kbd "C-c 6") 'org-sort)
        (global-set-key (kbd "C-c f") 'auto-fill-mode)
        (global-set-key (kbd "C-x O") 'occur)
        (global-set-key (kbd "C-c o") 'send-region-to-omnifocus)
        (global-set-key (kbd "C-c C-M-r") 'sre:gen-rdar-url)
        (global-set-key (kbd "C-x ^") 'vxe:shell-other-window)
        (global-set-key (kbd "M-s O") 'vxe:org-occur-in-agenda-files)
        (global-set-key (kbd "M-s o") 'vxe:occur)
        (global-set-key (kbd "C-|") 'set-input-method)
        (global-set-key (kbd "C-x C-i") 'endless/ispell-word-then-abbrev)
        (global-set-key (kbd "C-h u") 'helm-man-woman)
        (global-set-key (kbd "C-h D") 'my-dictionary-search)
        (global-set-key (kbd "C-h r") 'helm-regexp)

        (global-set-key (kbd "C-x \\") 'expand-abbrev)
        (global-set-key (kbd "C-x C-\\") 'expand-abbrev)
        (global-set-key (kbd "C-x '") 'vxe-term-toggle-mode)
        (global-set-key (kbd "C-x C-'") 'vxe-term-toggle-mode)
        (global-set-key (kbd "M-n") (kbd "C-u 1 C-v"))
        (global-set-key (kbd "M-p") (kbd "C-u 1 M-v"))
        (define-key pdf-view-mode-map (kbd "M-s o") 'pdf-occur)
        (define-key python-mode-map (kbd "C-C C-h") 'helm-pydoc-at-point)
        (define-key inferior-python-mode-map (kbd "C-C C-h") 'helm-pydoc-at-point)
        (define-key org-mode-map (kbd "M-.") 'org-open-at-point)
        (define-key org-mode-map (kbd "M-,") 'org-mark-ring-goto)

        (define-key org-mode-map (kbd "C-C C-t") 'org-show-todo-tree)
        (define-key emacs-lisp-mode-map (kbd "C-C C-c") 'eval-defun)
    (define-key emacs-lisp-mode-map (kbd "C-C C") 'eval-buffer)
    (define-key emacs-lisp-mode-map (kbd "M-.") 'elisp-def)

          (define-key slime-repl-mode-map (kbd "TAB") 'slime-fuzzy-complete-symbol)
