clasp/.emacs.d/etc/init.org
*** Default to grep if ag is not installed
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
    (cond ((string= "0\n" (shell-command-to-string "which ag 2>&1  1>/dev/null; echo $?"))
           (global-set-key (kbd "M-g s") 'helm-projectile-ag)
           (global-set-key (kbd "M-g S") 'grep)
           (global-set-key (kbd "M-s G") 'ag)
           (define-key dired-mode-map (kbd "M-g") nil)
           (define-key dired-mode-map (kbd "e") 'imenu)
           (define-key dired-mode-map (kbd "P") 'dired-up-directory)
           (define-key dired-mode-map (kbd "M-g s") 'helm-projectile-ag))
          (t
           (global-set-key (kbd "M-g s") 'helm-projectile-grep)))

  ;; (cond ((not (eq 0 (shell-command "which ag")))
  ;;        (global-set-key (kbd "M-g s") 'helm-projectile-grep)
  ;;        (t
  ;; 	(global-set-key (kbd "M-g s") 'helm-projectile-ag)
  ;; 	(global-set-key (kbd "M-s G") 'ag)
  ;; 	(define-key dired-mode-map (kbd "M-g") nil)
  ;; 	(define-key dired-mode-map (kbd "M-g s") 'helm-projectile-ag))))



  (global-set-key (kbd "M-g f") 'helm-projectile-find-file)
#+END_SRC

*** Macro enhancements
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(global-set-key (kbd "C-x <f4>") 'helm-execute-kmacro) ; get list of macros
(global-set-key (kbd "C-x C-k N") 'insert-kbd-macro) ; get list of macros
#+END_SRC
*** turn on which-key
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package which-key
:ensure t
:init
(require 'which-key)
(which-key-mode)
)
 #+END_SRC
* experimental
** dired imenu
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package dired-imenu
:ensure t)
#+END_SRC
** nodejs hook
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (add-hook 'nodejs-repl-mode-hook 'smartparens-mode)
#+END_SRC
** repl hydras
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package hydra
:ensure t
:init
  (defhydra hydra-apps (:color green)
    "search"
    ("s" my-org-screenshot "screenshot")
    ("/" vxe-eww-inplace "eww")
    ("C-/" vxe-eww-inplace nil)
    ("?" vxe-eww nil)
    ("g" hydra-geeknote/body "geeknote" :exit t)
    ("c" quick-calc "calc")
    ("e" erc-tls "irc")
    ("v" vxe-emms-play-video "video")
    ("j" jabber-switch-to-roster-buffer "jabber")
    ("a" sx-search "stackoverflow")
    ("h" hackernews "HackerNews")
    ("i" hydra-lang/body "interpreters" :exit t)
    ("d" hydra-documentation/body "documentation" :exit t)
    ("w" wiki-summary "wikipedia")
    ("m" hydra-emms/body "music" :exit t)
    ("k" new-frame-kb "kb")
    ("r" elfeed "RSS")
    ("o" counsel-osx-app "osx")
    ("t" twit "Twitter")
    ("x" vxe:sx-search "Twitter")
    ("b" hydra-blog/body "Blog" :exit t)
    )

  (defhydra hydra-lang (:color blue)
    "interpreters"
    ("p" run-python "python")
    ("i" ielm "ielm")
    ("c" comint-run "comint")
    ("l" slime "lisp")
    ("g" run-geiser "scheme")
    ("e" run-erlang "erlang")
    ("E" run-lfe "lfe")
    ("o" run-prolog "prolog")
    ("t" run-gnuplot "gnuplot")
    )

)

#+END_SRC
** cider repl
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (add-hook 'cider-repl-mode-hook #'paredit-mode)
  (add-hook 'cider-repl-mode-hook #'lispy-mode)
  (add-hook 'cider-repl-mode-hook #'goto-address-mode)
  (add-hook 'cider-repl-mode-hook #'projectile-mode)
  (add-hook 'cider-repl-mode-hook #'auto-complete-mode)
  (add-hook 'cider-repl-mode-hook #'ac-cider-setup)
  (add-hook 'cider-repl-mode-hook #'enable-paredit-mode)
  (add-hook 'cider-repl-mode-hook #'yas-minor-mode)
  (add-hook 'cider-repl-mode-hook #'rainbow-delimiters-mode)
  (add-hook 'cider-repl-mode-hook #'show-paren-mode)
  (add-hook 'cider-repl-mode-hook #'eldoc-mode)
  (add-hook 'cider-mode-hook #'eldoc-mode)

#+END_SRC
** elscreen
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package elscreen
:ensure t 
:init
(elscreen-start))
#+END_SRC
** imenu keybinding
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
 (global-set-key (kbd "C-x C-e") 'eval-last-sexp)
 (global-set-key (kbd "C-x e") 'imenu)

#+END_SRC

#+RESULTS:
: imenu

** icons in dired
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(add-hook 'dired-mode-hook 'all-the-icons-dired-mode)
#+END_SRC
** dired du
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package dired-du
:ensure t )
#+END_SRC

** dired git
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(use-package dired-k
:ensure t
:init
(require 'dired-k)
(define-key dired-mode-map (kbd "K") 'dired-k)

;; You can use dired-k alternative to revert-buffer
(define-key dired-mode-map (kbd "g") 'dired-k)

;; always execute dired-k when dired buffer is opened
(add-hook 'dired-initial-position-hook 'dired-k)

(add-hook 'dired-after-readin-hook #'dired-k-no-revert)
)
#+END_SRC

** ielm clear buffer key
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(define-key comint-mode-map (kbd "C-c b") 'comint-clear-buffer)
#+END_SRC

** electric parenthesis in org mode
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(add-hook 'org-mode-hook #'electric-pair-mode)
#+END_SRC

** new emacs instance
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
    (defun new-emacs-instance ()
      (interactive)
      (async-shell-command "open -n -a /Applications/Emacs.app"))

#+END_SRC
** java hooks
** javascript typescript
#+BEGIN_SRC elisp
  (use-package lsp-javascript-typescript
    :ensure t)
#+END_SRC
** wiki
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el

#+END_SRC
** project search thing
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (defun vxe-search-projects ()
    "search projects, add new dirs by updating ls command below"
    (interactive)
    (let ((query (completing-read "project: " (split-string
                                               (s-chomp (shell-command-to-string (concat "ls -l " vxe:project-path  "| awk '{print $9}'")))

                                               "\n"))))
                                        ;  (find-file (concat "~/opt/" query)))

      (with-temp-buffer
        (cd (concat "~/opt/" query))
        (helm-projectile-ag))))





  (defun vxe-search-project-files ()
    "search projects, add new dirs by updating ls command below"
    (interactive)
    (let ((query (completing-read "project: " (split-string
                                               (s-chomp (shell-command-to-string (concat "ls -l " vxe:project-path  "| awk '{print $9}'")))
                                               "\n"))))
                                        ;  (find-file (concat "~/opt/" query)))

      (with-temp-buffer
        (cd (concat "~/opt/" query))
        (helm-projectile-find-file))))


  (setq vxe:project-path "~/opt/")


#+END_SRC

#+RESULTS:
: ~/opt/
** znc
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(add-to-list 'load-path "~/.emacs.d/lib" t)
(require 'znc)
#+END_SRC
** python repl documentation
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  ;; (define-key inferior-python-mode-map (kbd "C-c C-k") 'helm-pydoc-at-point)
(define-key inferior-python-mode-map (kbd "C-c D") 'python-describe-symbol)
(define-key inferior-python-mode-map (kbd "C-c C-d") 'python-eldoc-at-point)
#+END_SRC
** indium repl keybindings
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(define-key indium-repl-mode-map (kbd "C-k") 'sp-kill-hybrid-sexp)
#+END_SRC
** js-refactor
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (use-package js2-refactor
    :ensure t
    :init
    (js2r-add-keybindings-with-prefix "C-c C-m"))
#+END_SRC
